
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.Заголовок = Строка(ПараметрыСеанса.Пользователь);  
	Партнер  = ПараметрыСеанса.Контрагент;
	Пароль   = ПараметрыСеанса.Контрагент.Пароль;
	Менеджер = ПараметрыСеанса.Контрагент.Ответственный; 
	
	элементы.Партнер.Заголовок = Нстр("fr = 'Partenaire'; ru = 'Партнёр'; en = 'Partner'; es = 'Socio'");  
	элементы.Пароль.Заголовок = Нстр("fr = 'Mot de passe'; ru = 'Пароль'; en = 'Password'; es = 'Contraseña'");  
	элементы.Менеджер.Заголовок = Нстр("fr = 'Gestionnaire'; ru = 'Менеджер'; en = 'Manager'; es = 'Gerente'");  
	элементы.КомандаВыйти.Заголовок = Нстр("fr = 'Sortir'; ru = 'Выйти'; en = 'Exit'; es = 'Salir'");  
	элементы.КомандаИзменитьПаротль.Заголовок = Нстр("fr = 'Changer le mot de passe'; ru = 'Изменить пароль'; en = 'Change the password'; es = 'Cambiar contraseña'");  
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыйти(Команда)
	ЗавершитьРаботуСистемы(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура КомандаИзменитьПаротль(Команда)
	
	Если элементы.Пароль.Доступность = Ложь Тогда      
		элементы.Пароль.Доступность = Истина;		
		элементы.КомандаИзменитьПаротль.Заголовок = Нстр("fr = 'Enregistrer'; ru = 'Сохранить'; en = 'Save'; es = 'Guardar'"); 
	Иначе         
		Если СокрЛП(Пароль) = "" Тогда
			Элементы.Пароль.ЦветРамки = WebЦвета.Красный;	
		Иначе 
			ИзменитьПарольНасервере();
			элементы.Пароль.Доступность = Ложь;	 
			элементы.КомандаИзменитьПаротль.Заголовок = Нстр("fr = 'Changer le mot de passe'; ru = 'Изменить пароль'; en = 'Change the password'; es = 'Cambiar contraseña'");   
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьПарольНасервере()
	Если ЗначениеЗаполнено(Партнер.Пользователь) Тогда
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Партнер.Пользователь.ИдентификаторПользователяИБ);
		ПользовательИБ.Пароль = Пароль;
		ПользовательИБ.Записать();
		Спр = Партнер.ПолучитьОбъект();
		Спр.Пароль = Пароль;
		Попытка
			Спр.Записать();  
		Исключение
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры
