
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ТипЗнч(Параметры.Данные) = Тип("СписокЗначений") Тогда
		Для Каждого Стр Из Параметры.Данные Цикл 
			СЗЗначения.Добавить(Стр.Значение, ?(ЗначениеЗаполнено(Стр.Представление), Стр.Представление, СокрЛП(Стр.Значение)), Стр.Пометка, Стр.Картинка);	
		КонецЦикла;	
	ИначеЕсли ТипЗнч(Параметры.Данные) = Тип("Массив") Тогда
		СЗЗначения.ЗагрузитьЗначения(Параметры.Данные);
		Для Каждого Стр Из СЗЗначения Цикл
			Стр.Представление = Стр.Значение;	
		КонецЦикла;	
	КонецЕсли;
	Если Параметры.Свойство("Заголовок") Тогда
		АвтоЗаголовок = Ложь;
		Заголовок = Параметры.Заголовок;
	КонецЕсли;
	МножественныйВыбор = ?(Параметры.Свойство("МножественныйВыбор"), Параметры.МножественныйВыбор, Истина);
	Элементы.СЗЗначенияПометка.Видимость = МножественныйВыбор;
	Элементы.ФормаГруппаОтметки.Видимость = МножественныйВыбор;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтметки(Команда)
	СЗЗначения.ЗаполнитьПометки(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметки(Команда)
	СЗЗначения.ЗаполнитьПометки(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура СЗЗначенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если МножественныйВыбор Тогда
		ПоказатьЗначение(, Элемент.ТекущиеДанные.Значение);
	Иначе
		Закрыть(Элемент.ТекущиеДанные.Значение);	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Подтвердить(Команда)
	Если МножественныйВыбор Тогда
		Мас = Новый Массив;
		Для Каждого Стр Из СЗЗначения Цикл
			Если Не Стр.Пометка Тогда Продолжить КонецЕсли;
			Мас.Добавить(Стр.Значение);
		КонецЦикла;
		Закрыть(Мас);
	Иначе
		Закрыть(Элементы.СЗЗначения.ТекущиеДанные.Значение);	
	КонецЕсли;
КонецПроцедуры



