
&НаКлиенте
Перем МасУдаляемыеФайлы;
&НаКлиенте
Перем МасТиповУдаляемыхФайлов;

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПрисоединённыеФайлыКлиент.ОткрытьФайл(ВыбраннаяСтрока, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	УдаляемыеФайлы = ПрисоединённыеФайлыВызовСервера.ПолучитьМассивУдаляемыхФайлов(Элемент.ВыделенныеСтроки);
	МасУдаляемыеФайлы = УдаляемыеФайлы.МассивУдаляемыхФайлов;	
	МасТиповУдаляемыхФайлов = УдаляемыеФайлы.МассивТиповОбъектовФайлов;
КонецПроцедуры

&НаКлиенте
Процедура СписокПослеУдаления(Элемент)
	ПрисоединённыеФайлыВызовСервера.УдалитьФайлыСДиска(МасУдаляемыеФайлы);
	Для каждого Значение Из МасТиповУдаляемыхФайлов Цикл
		ОповеститьОбИзменении(Значение);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайлы(Команда)
	Структура = ПрисоединённыеФайлыКлиент.ПолучитьДанныеСвязи(Список.Отбор);	
	ПрисоединённыеФайлыКлиент.ПрисоединитьФайлы(Структура.Объект, Структура.Связь);
	ОповеститьОбИзменении(ТипЗнч(Структура.Объект));

КонецПроцедуры

&НаКлиенте
Процедура СохранитьНаДиск(Команда)
	ПрисоединённыеФайлыКлиент.СохранитьФайлы(Элементы.Список.ВыделенныеСтроки, ЭтаФорма);
КонецПроцедуры



	
