
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПолучитьПредыдущиеДанные();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьПредыдущимиДанными();
	УстановитьВидимостьРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ЗаполнитьПредыдущимиДанными();
КонецПроцедуры

#КонецОбласти
 
#Область Обработчики_элементов_формы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ПолучитьПредыдущиеДанные();
	ЗаполнитьПредыдущимиДанными();
КонецПроцедуры

&НаКлиенте
Процедура ВидПриказаПриИзменении(Элемент)
	ПолучитьПредыдущиеДанные(); 
	ЗаполнитьПредыдущимиДанными();
	УстановитьВидимостьРеквизитов(); 
КонецПроцедуры

&НаКлиенте
Процедура ТЧСотрудникиСотрудникПриИзменении(Элемент)
	ЗаполнитьПредыдущимиДанными();
КонецПроцедуры

#КонецОбласти
 
#Область Дополнительно

&НаКлиенте
Процедура УстановитьВидимостьРеквизитов()
 	ЭтоПриём = Объект.ВидПриказа = ПредопределенноеЗначение("Перечисление.ВидыКадровыхПриказов.Приём");
	ЭтоПеревод = Объект.ВидПриказа = ПредопределенноеЗначение("Перечисление.ВидыКадровыхПриказов.Перевод");
	//
	Элементы.ТЧСотрудникиДолжность.Видимость = ЭтоПриём Или ЭтоПеревод;
	Элементы.ТЧСотрудникиОклад.Видимость = ЭтоПриём Или ЭтоПеревод;
	Элементы.ТЧСотрудникиГрафикРаботы.Видимость = ЭтоПриём Или ЭтоПеревод;
    Элементы.ТЧСотрудникиВариантОклада.Видимость = ЭтоПриём Или ЭтоПеревод;
    Элементы.ТЧСотрудникиМестоХранения.Видимость = ЭтоПриём Или ЭтоПеревод;
	Элементы.ТЧСотрудникиДолжность.АвтоОтметкаНезаполненного = ЭтоПриём Или ЭтоПеревод; 
	Элементы.ТЧСотрудникиГрафикРаботы.АвтоОтметкаНезаполненного = ЭтоПриём Или ЭтоПеревод;
	Элементы.ТЧСотрудникиВариантОклада.АвтоОтметкаНезаполненного = ЭтоПриём Или ЭтоПеревод;
	Элементы.ТЧСотрудникиМестоХранения.АвтоОтметкаНезаполненного = ЭтоПриём Или ЭтоПеревод;
	//
	Элементы.ТЧСотрудникиГруппаЗаголовокСтроки.Видимость = ЭтоПеревод;
	Элементы.ТЧСотрудникиДолжностьИз.Видимость = ЭтоПеревод;
	Элементы.ТЧСотрудникиОкладИз.Видимость = ЭтоПеревод;
	Элементы.ТЧСотрудникиГрафикРаботыИз.Видимость = ЭтоПеревод;
    Элементы.ТЧСотрудникиВариантОкладаИз.Видимость = ЭтоПеревод;
    Элементы.ТЧСотрудникиМестоХраненияИз.Видимость = ЭтоПеревод;
КонецПроцедуры

&НаСервере
Процедура ПолучитьПредыдущиеДанные()
	Если Объект.ВидПриказа <> Перечисления.ВидыКадровыхПриказов.Перевод Тогда Возврат КонецЕсли;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТарифныеСтавкиСрезПоследних.Сотрудник КАК Сотрудник,
	                      |	ТарифныеСтавкиСрезПоследних.Должность КАК Должность,
	                      |	ТарифныеСтавкиСрезПоследних.Оклад КАК Оклад,
	                      |	ТарифныеСтавкиСрезПоследних.ГрафикРаботы КАК ГрафикРаботы,
	                      |	ТарифныеСтавкиСрезПоследних.ВариантОклада КАК ВариантОклада,
	                      |	ТарифныеСтавкиСрезПоследних.МестоХранения КАК МестоХранения
	                      |ИЗ
	                      |	РегистрСведений.ТарифныеСтавки.СрезПоследних(&ДатаСреза, ) КАК ТарифныеСтавкиСрезПоследних");
	Запрос.УстановитьПараметр("ДатаСреза", НачалоМесяца(Объект.Дата) - 1);
	ТЗПредыдущиеДанные.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПредыдущимиДанными()
	Для Каждого Стр Из Объект.ТЧСотрудники Цикл
		Мас = ТЗПредыдущиеДанные.НайтиСтроки(Новый Структура("Сотрудник", Стр.Сотрудник));	
		Если Мас.Количество() = 0 Тогда 
			Стр.ДолжностьИз = Неопределено;
			Стр.ОкладИз = 0;
			Стр.ГрафикРаботыИз = Неопределено;
			Стр.ВариантОкладаИз = Неопределено;	
			Стр.МестоХраненияИз = Неопределено;	
		Иначе	
			Стр.ДолжностьИз = Мас[0].Должность;
			Стр.ОкладИз = Мас[0].Оклад;
			Стр.ГрафикРаботыИз = Мас[0].ГрафикРаботы;
			Стр.ВариантОкладаИз = Мас[0].ВариантОклада;
			Стр.МестоХраненияИз = Мас[0].МестоХранения;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры	

#КонецОбласти 
