
Процедура ВывестиСтикерыНаПринтер(Таб, ВысотаСтраницы, ШиринаСтраницы, ПолеСлева, МасштабПечати, ПредварительныйПросмотр = Ложь) Экспорт
	// Проверка на то, что принтер установлен в системе
	Попытка
		Принтеры = Новый COMОбъект("WbemScripting.SWbemLocator");
	Исключение
		ПоказатьПредупреждение(, ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	ServicesSet = Принтеры.ConnectServer(".");
	ObjectSet = ServicesSet.InstancesOf("Win32_Printer");	
	ПринтерУстановлен = Ложь;
	Для Каждого Стр Из ObjectSet Цикл
		Если НРег(СокрЛП(Стр.Name)) <> НРег(СокрЛП(Таб.ИмяПринтера)) Тогда Продолжить КонецЕсли; 
		ПринтерУстановлен = Истина;
		Прервать;
	КонецЦикла;
	Принтеры = "";
	ServicesSet = "";
	ObjectSet = "";
	Если Не ПринтерУстановлен и Не ПредварительныйПросмотр Тогда
		ПоказатьПредупреждение(, Нстр("ru = 'Не найден принтер этикеток: '; fr = ""Imprimante d'étiquettes introuvable:""") + СокрЛП(Таб.ИмяПринтера));
		Возврат;
	КонецЕсли;	
	// Всё нашли, выводим на печать
	//Таб = Новый ТабличныйДокумент;
	Таб.АвтоМасштаб = Истина;
	//Таб.ШиринаСтраницы = ШиринаСтраницы;
	//Таб.ВысотаСтраницы = ВысотаСтраницы;
	Таб.ПолеСверху = 0;
	Таб.ПолеСнизу = 0;
    Таб.ПолеСлева = 0;
	Таб.ПолеСправа = 0;
	Таб.МасштабПечати = МасштабПечати;
	Если ПредварительныйПросмотр Тогда
		Таб.ОтображатьСетку = Истина;
		Таб.ОтображатьЗаголовки = Истина;
		Таб.Показать();
	Иначе
		Таб.Напечатать();
	КонецЕсли;		
КонецПроцедуры

Процедура ОткрытьПредварительныйПросмотр(Таб, Уникальность = Истина, ОписаниеОповещенияОЗакрытии = Неопределено, ИмяФайла = "") Экспорт
	ИмяФайла = ?(ИмяФайла = "", Таб.ИспользуемоеИмяФайла, ИмяФайла);
	ИмяФайла = ?(ИмяФайла = "", "Document", ИмяФайла);
	Параметры = Новый Структура("Таб, ИмяФайла", Таб, ИмяФайла);
	ОткрытьФорму("ОбщаяФорма.ПредварительныйПросмотр", Параметры,, Уникальность,,, ОписаниеОповещенияОЗакрытии);  
КонецПроцедуры

Функция ПолучитьСписокПринтеров() Экспорт
	// Проверка на то, что принтер установлен в системе
	Попытка
		Принтеры = Новый COMОбъект("WbemScripting.SWbemLocator");
	Исключение
		ПоказатьПредупреждение(, ОписаниеОшибки());
		Возврат Новый СписокЗначений;
	КонецПопытки;
	СписокПринтеров = Новый СписокЗначений;
	ServicesSet = Принтеры.ConnectServer(".");
	ObjectSet = ServicesSet.InstancesOf("Win32_Printer");	
	Для Каждого Стр Из ObjectSet Цикл
		СписокПринтеров.Добавить(СокрЛП(Стр.Name));
	КонецЦикла;
	Принтеры = "";
	ServicesSet = "";
	ObjectSet = "";
	Возврат СписокПринтеров;
КонецФункции
