
#Область Интерфейс

Процедура СформироватьМенюВыбораВидаРеквизита(Форма) Экспорт
	Оп = Новый ОписаниеОповещения("ПослеВыбораВидаРеквизитаКонтрагента", ЭтотОбъект, Форма);
	МасВыбранныеРеквизиты = Новый Массив;
	Для Каждого СтрГруппа Из Форма.ДЗРеквизиты.ПолучитьЭлементы() Цикл
		Для Каждого Стр Из СтрГруппа.ПолучитьЭлементы() Цикл
			МасВыбранныеРеквизиты.Добавить(Стр.Реквизит);	
		КонецЦикла;	
	КонецЦикла;
	ВидКонтрагента = ?(Форма.Объект.Свойство("ВидКонтрагента"), Форма.Объект.ВидКонтрагента, ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ЧастноеЛицо"));
	СЗВыбор = РеквизитыКонтрагентовВызовСервера.ПолучитьДоступныеВидыРеквизитов(Форма.Объект.Ссылка, ВидКонтрагента, МасВыбранныеРеквизиты); 
	Форма.ПоказатьВыборИзМеню(Оп, СЗВыбор, Форма.Элементы.ДобавитьРеквизит);	
КонецПроцедуры

Процедура ОткрытьФормуВводаДополнительныхДанных(Форма) Экспорт
	ТекСтр = Форма.Элементы.ДЗРеквизиты.ТекущиеДанные;
	Если ТекСтр = Неопределено Тогда Возврат КонецЕсли;
	П = Новый Структура("Комментарий, НазначениеРассылки", ТекСтр.Комментарий, ТекСтр.НазначениеРассылки);
	Оп = Новый ОписаниеОповещения("ПослеЗакрытияФормыВводаРеквизитов", ЭтотОбъект, Форма);
	ОткрытьФорму("РегистрСведений.РеквизитыКонтрагентов.Форма.ВводДополнительныхДанных", П, Форма,,,, Оп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

Процедура Скопировать(Форма, ВидРеквизитаНазначения) Экспорт
	ТекСтр = Форма.Элементы.ДЗРеквизиты.ТекущиеДанные;
	Родитель = ТекСтр.ПолучитьРодителя();
	// Найдём установленный
	СтрНазначение = Неопределено;
	Для Каждого Стр Из Родитель.ПолучитьЭлементы() Цикл
		Если Стр.Реквизит <> ВидРеквизитаНазначения Тогда Продолжить КонецЕсли;
		СтрНазначение = Стр;
		Прервать;
	КонецЦикла;	
	Если СтрНазначение = Неопределено Тогда	
		СтрНазначение = Родитель.ПолучитьЭлементы().Добавить();
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(СтрНазначение, ТекСтр);
	СтрНазначение.Реквизит = ВидРеквизитаНазначения; 
КонецПроцедуры

Процедура ОбработатьРезультатЗаполненияРеквизитовПоИНН(Форма, Результат) Экспорт
	Если Результат.Выполнено Тогда
		ОбщегоНазначенияКлиент.РазвернутьДеревоЗначений(Форма.ДЗРеквизиты, Форма.Элементы.ДЗРеквизиты);	
	Иначе	
		ПоказатьПредупреждение(, Результат.ОписаниеОшибки);	
	КонецЕсли;	
КонецПроцедуры	

#КонецОбласти

#Область События_элементов_формы

Процедура ПриАктивацииСтроки(Форма) Экспорт
	// Найдём команды
	КомандаКомментарийРеквизита = Форма.Элементы.Найти("ДЗРеквизитыКонтекстноеМенюКомментарийРеквизита");
	КомандаЗаполнитьПоИНН = Форма.Элементы.Найти("ДЗРеквизитыКонтекстноеМенюЗаполнитьПоИНН");
	КомандаСкопироватьВАдресПоПрописке = Форма.Элементы.Найти("ДЗРеквизитыКонтекстноеМенюСкопироватьВАдресПоПрописке"); 
	КомандаСкопироватьВАдресПроживания = Форма.Элементы.Найти("ДЗРеквизитыКонтекстноеМенюСкопироватьВАдресПроживания");
	КомандаСкопироватьВФактическийАдрес = Форма.Элементы.Найти("ДЗРеквизитыКонтекстноеМенюСкопироватьВФактическийАдрес");
	КомандаСкопироватьВАдресДоставки = Форма.Элементы.Найти("ДЗРеквизитыКонтекстноеМенюСкопироватьВАдресДоставки");
	// Получим данные
	ТекСтр = Форма.Элементы.ДЗРеквизиты.ТекущиеДанные;
	Реквизит = ?(ТекСтр = Неопределено, Неопределено, ТекСтр.Реквизит);
	//
	ЭтоИНН = Реквизит = ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.NIF");
	ЭтоАдресПоПрописке = Реквизит = ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.АдресПоПрописке");
	ЭтоАдресПроживания = Реквизит = ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.АдресПроживания");
	ЭтоЮридическийАдрес = Реквизит = ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.АдресЮридический");
	ЭтоФактическийАдрес = Реквизит = ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.АдресФактический");
	//
	УстановитьВидимостьЭлемента(КомандаКомментарийРеквизита, ДляРеквизитаДоступенКомментарий(Реквизит));
	УстановитьВидимостьЭлемента(КомандаЗаполнитьПоИНН, ЭтоИНН); 
	УстановитьВидимостьЭлемента(КомандаСкопироватьВАдресПоПрописке, ЭтоАдресПроживания);
	УстановитьВидимостьЭлемента(КомандаСкопироватьВАдресПроживания, ЭтоАдресПоПрописке);
	УстановитьВидимостьЭлемента(КомандаСкопироватьВФактическийАдрес, ЭтоЮридическийАдрес);
	УстановитьВидимостьЭлемента(КомандаСкопироватьВАдресДоставки, ЭтоАдресПроживания Или ЭтоАдресПоПрописке Или ЭтоЮридическийАдрес Или ЭтоФактическийАдрес);
КонецПроцедуры

Процедура ВыборТаблицаФормы(Форма, ВыбраннаяСтрока, СтандартнаяОбработка) Экспорт
	ТекСтр = Форма.ДЗРеквизиты.НайтиПоИдентификатору(ВыбраннаяСтрока);
	НачалоВыбора(Форма.Элементы.ДЗРеквизиты, ТекСтр.Реквизит, ТекСтр.Значение, ТекСтр.Представление, СтандартнаяОбработка);	
КонецПроцедуры

Процедура ОбработкаВыбораТаблицаФормы(Форма, ВыбранноеЗначение, СтандартнаяОбработка) Экспорт
	Идентификатор = Форма.Элементы.ДЗРеквизиты.ТекущаяСтрока;
	ТекСтр = Форма.ДЗРеквизиты.НайтиПоИдентификатору(Идентификатор);
	ОбработкаВыбора(ВыбранноеЗначение, ТекСтр.Значение, ТекСтр.Представление, СтандартнаяОбработка);
	ОбщегоНазначенияКлиент.РазвернутьДеревоЗначений(Форма.ДЗРеквизиты, Форма.Элементы.ДЗРеквизиты);
КонецПроцедуры

Процедура ПередНачаломИзменения(Форма) Экспорт
	ТекСтр = Форма.Элементы.ДЗРеквизиты.ТекущиеДанные;
	Эл = Форма.Элементы.ДЗРеквизитыПредставление;
	Эл.Маска = "";
	Если ТекСтр.Реквизит = ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.ICE") Тогда
		Эл.Маска = "999999999999999";	
	КонецЕсли;	
	//Если ТекСтр.Реквизит = ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.CNSS") Тогда
	//	Эл.Маска = "999-999-999 99";	
	//КонецЕсли;	
КонецПроцедуры

Процедура НачалоВыбора(Элемент, ВидРеквизита, РеквизитЗначение, РеквизитПредставление, СтандартнаяОбработка) Экспорт
	Если ЭтоРеквизитАдреса(ВидРеквизита) Тогда
		//СтандартнаяОбработка = Ложь;
		//ВидКонтактнойИнформацииАдреса = Новый Структура;
		//ВидКонтактнойИнформацииАдреса.Вставить("ТолькоНациональныйАдрес", Истина);
		//ВидКонтактнойИнформацииАдреса.Вставить("ВключатьСтрануВПредставление", Ложь);
		//ВидКонтактнойИнформацииАдреса.Вставить("СкрыватьНеактуальныеАдреса", Ложь);	
		////
		//ПараметрыОткрытия = Новый Структура;
		//ПараметрыОткрытия.Вставить("ВидКонтактнойИнформации", ВидКонтактнойИнформацииАдреса);
		//ПараметрыОткрытия.Вставить("Значение", РеквизитЗначение);
		//ПараметрыОткрытия.Вставить("Представление", РеквизитПредставление);
		//ПараметрыОткрытия.Вставить("Комментарий", "");
		//ПараметрыОткрытия.Вставить("Заголовок", НСтр("fr = 'Adresse'; ru = 'Адрес'; en = 'Address'; es = 'Dirección'"));
		//ОткрытьФорму("Обработка.РасширенныйВводКонтактнойИнформации.Форма.ВводАдреса", ПараметрыОткрытия, Элемент);
	ИначеЕсли ЭтоКонтактноеЛицо(ВидРеквизита) Тогда	
		СтандартнаяОбработка = Ложь;
	   	ПоказатьЗначение(, РеквизитПредставление); 
	ИначеЕсли ЭтоТелефон(ВидРеквизита) Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФорму("РегистрСведений.РеквизитыКонтрагентов.Форма.ВводНомераТелефона", Новый Структура("Значение", РеквизитЗначение), Элемент);
	КонецЕсли;	
КонецПроцедуры

Процедура ОбработкаВыбора(ВыбранноеЗначение, РеквизитЗначение, РеквизитПредставление, СтандартнаяОбработка) Экспорт
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Структура") Тогда Возврат КонецЕсли;	
	СтандартнаяОбработка = Ложь;
	РеквизитЗначение = ВыбранноеЗначение.КонтактнаяИнформация;
	РеквизитПредставление = ВыбранноеЗначение.Представление;	
КонецПроцедуры
	
#КонецОбласти

#Область Оповещения

Процедура ПослеВыбораВидаРеквизитаКонтрагента(ВыбранныйЭлемент, Форма) Экспорт
	Если ВыбранныйЭлемент = Неопределено Тогда Возврат КонецЕсли;
	ДанныеРеквизита = ВыбранныйЭлемент.Значение;
	Родитель = Неопределено;
	Для Каждого СтрРодитель Из Форма.ДЗРеквизиты.ПолучитьЭлементы() Цикл
		Если СтрРодитель.Реквизит <> ДанныеРеквизита.Родитель Тогда Продолжить КонецЕсли;
		Родитель = СтрРодитель;
		Прервать;
	КонецЦикла;
	Если Родитель = Неопределено Тогда
		Родитель = Форма.ДЗРеквизиты.ПолучитьЭлементы().Добавить();
		Родитель.Реквизит = ДанныеРеквизита.Родитель;
		Родитель.ИндексКартинки = -1;
	КонецЕсли;
	НС = Родитель.ПолучитьЭлементы().Добавить();
	НС.Реквизит = ДанныеРеквизита.Реквизит;
	НС.ИндексКартинки = ДанныеРеквизита.ИндексКартинки;
	НС.Уровень = 1;
	Форма.Элементы.ДЗРеквизиты.ТекущаяСтрока = НС.ПолучитьИдентификатор();
	Если ЭтоРеквизитАдреса(ДанныеРеквизита.Реквизит) Или ЭтоТелефон(ДанныеРеквизита.Реквизит) Тогда
		НачалоВыбора(Форма.Элементы.ДЗРеквизиты, ДанныеРеквизита.Реквизит, НС.Значение, НС.Представление, Ложь);
	ИначеЕсли ЭтоКонтактноеЛицо(ДанныеРеквизита.Реквизит) Тогда
		Оп = Новый ОписаниеОповещения("ПослеЗакрытияФормыВыбораФизическогоЛица", ЭтотОбъект, Новый Структура("НС, Форма", НС, Форма));
		П = Новый Структура("РежимВыбора", Истина); 
		ОткрытьФорму("Справочник.ФизическиеЛица.ФормаВыбора", П, Форма,,,, Оп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);			
	Иначе
		ОбщегоНазначенияКлиент.РазвернутьДеревоЗначений(Форма.ДЗРеквизиты, Форма.Элементы.ДЗРеквизиты);
	КонецЕсли;	
КонецПроцедуры

Процедура ПослеЗакрытияФормыВводаРеквизитов(РезультатЗакрытия, Форма) Экспорт
	Если РезультатЗакрытия = Неопределено Тогда Возврат КонецЕсли;
	ТекСтр = Форма.Элементы.ДЗРеквизиты.ТекущиеДанные;
	ТекСтр.Комментарий = РезультатЗакрытия.Комментарий;
	ТекСтр.НазначениеРассылки = РезультатЗакрытия.НазначениеРассылки;
КонецПроцедуры	

Процедура ПослеЗакрытияФормыВыбораФизическогоЛица(РезультатЗакрытия, ДополнительныеРеквизиты) Экспорт
	Если РезультатЗакрытия = Неопределено Тогда Возврат КонецЕсли;
	ДополнительныеРеквизиты.НС.Представление = РезультатЗакрытия;
	ОбщегоНазначенияКлиент.РазвернутьДеревоЗначений(ДополнительныеРеквизиты.Форма.ДЗРеквизиты, ДополнительныеРеквизиты.Форма.Элементы.ДЗРеквизиты);
КонецПроцедуры	

#КонецОбласти

#Область Дополнительно

Функция ЭтоРеквизитАдреса(ВидРеквизита)
	Мас = Новый Массив;
	Мас.Добавить(ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.АдресДоставки"));
	Мас.Добавить(ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.АдресПоПрописке"));
	Мас.Добавить(ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.АдресПроживания"));
	Мас.Добавить(ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.АдресФактический"));
	Мас.Добавить(ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.АдресЮридический"));
	Возврат Мас.Найти(ВидРеквизита) <> Неопределено;
КонецФункции

Функция ЭтоКонтактноеЛицо(ВидРеквизита)
	Мас = Новый Массив;
	Мас.Добавить(ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.ГлавныйБухгалтер"));
	Мас.Добавить(ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.Руководитель"));
	Мас.Добавить(ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.Собственник"));
	Мас.Добавить(ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.Сотрудник"));
	Возврат Мас.Найти(ВидРеквизита) <> Неопределено;
КонецФункции

Функция ДляРеквизитаДоступенКомментарий(ВидРеквизита)
	Мас = Новый Массив;
	Мас.Добавить(ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.ГлавныйБухгалтер"));
	Мас.Добавить(ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.Руководитель"));
	Мас.Добавить(ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.Собственник"));
	Мас.Добавить(ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.Сотрудник"));
	Мас.Добавить(ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.EMail"));
	Мас.Добавить(ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.Web"));
	Мас.Добавить(ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.Другое"));
	Мас.Добавить(ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.Телефон"));
	Мас.Добавить(ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.ТелефонФикс"));
	Возврат Мас.Найти(ВидРеквизита) <> Неопределено;
КонецФункции

Функция ЭтоТелефон(ВидРеквизита)
	Возврат ВидРеквизита = ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.Телефон")
		Или ВидРеквизита = ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.ТелефонФикс");
КонецФункции

Процедура УстановитьВидимостьЭлемента(Элемент, Видимость)
	Если Элемент <> Неопределено Тогда
		Элемент.Видимость = Видимость;
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти




