
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Таб = Новый ТабличныйДокумент;	
	Сформировать(ПараметрКоманды, Таб);	
	ВыводПечатныхФормКлиент.ОткрытьПредварительныйПросмотр(Таб);
КонецПроцедуры

&НаСервере
Процедура Сформировать(МасДок, Таб)
	Для Каждого Док Из МасДок Цикл
		Если ТипЗнч(Док) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			МасРеализации = РаботаСДокументами.ПолучитьДокументыПоИмениПоОснованию(Метаданные.Документы.РеализацияТоваровУслуг.Имя, Док, Истина);
			Если МасРеализации.Количество() > 0 Тогда 
				Для Каждого ДокРеализация Из МасРеализации Цикл
					Документы.РеализацияТоваровУслуг.ПечатьСчетНаОплату(ДокРеализация, Таб);	
				КонецЦикла;
			Иначе 
				Документы.РеализацияТоваровУслуг.ПечатьСчетНаОплату(Док, Таб);	
			КонецЕсли;	
		Иначе	
			Документы.РеализацияТоваровУслуг.ПечатьСчетНаОплату(Док, Таб);
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры
