
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) 
	РаботаСДокументами.ЗаполнитьРеквизитыПоУмолчанию(ЭтотОбъект);
	ДатаПоставки = КонецДня(ТекущаяДатаСеанса()) + 1;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда	
		Контрагент = ДанныеЗаполнения.Контрагент;
		Договор = ОбщегоНазначенияВызовСервера.ПолучитьОсновнойДоговор(Контрагент, Организация, Ложь);
		КодСтроки = 1;
		Для Каждого Стр Из ДанныеЗаполнения.МасТовары Цикл
			НС = ТЧТовары.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Стр);
			НС.СтавкаНДС = НС.Номенклатура.СтавкаНДС;
			НС.КодСтроки = КодСтроки;
			НС.СуммаНДС = РаботаСДокументамиКлиентСервер.РассчитатьСуммуНДС(НС.СтавкаНДС, НС.Сумма, ЦенаВключаетНДС);
			КодСтроки = КодСтроки + 1;
		КонецЦикла;
	Иначе
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	УстановитьПривилегированныйРежим(Истина);
	РаботаСДокументами.УстановитьЗаписьВсехРегистров(Движения);
	// Формируем движения
	РегистрыНакопления.ЗаказыПоставщикам.СформироватьДвижения(ЭтотОбъект);
	// Записываем
	Движения.Записать();
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = ПараметрыСеанса.Пользователь;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	РаботаСДокументами.МожноРедактироватьДокумент(ЭтотОбъект, Отказ); 
КонецПроцедуры




