
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Таб = Новый ТабличныйДокумент;
	Сформировать(ПараметрКоманды, Таб);
	ВыводПечатныхФормКлиент.ОткрытьПредварительныйПросмотр(Таб);
КонецПроцедуры

&НаСервере
Процедура Сформировать(ПараметрКоманды, Таб)
	Если Не ПараметрКоманды.Количество() = 0 Тогда 
		//FieldPhoto = ПараметрКоманды.Получить(0).Организация.ФонПечатныхФорм.Get();
		//Try
		//	Картинка = New Picture(FieldPhoto,Истина);
		//	Таб.ФоноваяКартинка = Картинка;
		//Except
		//EndTry;
	КонецЕсли;
	Для Каждого Док Из ПараметрКоманды Цикл		
		Документы.РеализацияТоваровУслуг.PrintFactureEnTete(Док, Таб,Истина);
	КонецЦикла;	
КонецПроцедуры
