
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	РаботаСДокументами.ЗаполнитьРеквизитыПоУмолчанию(ЭтотОбъект);
	ЦенаВключаетНДС = Истина;
	ДатаОтгрузки = ТекущаяДатаСеанса(); 
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Комментарий = "";
	Ответственный = ПараметрыСеанса.Пользователь;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	РаботаСДокументами.МожноРедактироватьДокумент(ЭтотОбъект, Отказ);
	РаботаСДокументами.ЗаполнитьИтогиДокумента(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ECommerce Тогда
		Эл = ПроверяемыеРеквизиты.Найти("Организация");
		ПроверяемыеРеквизиты.Удалить(Эл);
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписыватьСтатус = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ИсторияЗаказовПокупателейПоСтатусамСрезПоследних.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ИсторияЗаказовПокупателейПоСтатусамСрезПоследних.СтатусЗаказаПокупателя КАК СтатусЗаказаПокупателя
	|ИЗ
	|	РегистрСведений.ИсторияЗаказовПокупателейПоСтатусам.СрезПоследних(, ЗаказПокупателя = &ЗаказПокупателя) КАК ИсторияЗаказовПокупателейПоСтатусамСрезПоследних";
	Запрос.УстановитьПараметр("ЗаказПокупателя",Ссылка); 
	
	Выборка = Запрос.Выполнить().Выгрузить();
	
	Если Выборка.Количество() = 0 Тогда 
		ЗаписыватьСтатус = Истина;
		СтатусЗаписи = Перечисления.СтатусыЗаказовПокупателя.Новый;  
		Если Ссылка.МенеджерПодтвердилПроверилОстаток = Истина Тогда
			СтатусЗаписи = Перечисления.СтатусыЗаказовПокупателя.ВРаботе;		
		КонецЕсли;
	Иначе 
		СтатусЗаписи = Выборка[0].СтатусЗаказаПокупателя; 
		Если СтатусЗаписи = Перечисления.СтатусыЗаказовПокупателя.Новый Тогда 
			Если Ссылка.МенеджерПодтвердилПроверилОстаток = Истина Тогда
				ЗаписыватьСтатус = Истина;
				СтатусЗаписи = Перечисления.СтатусыЗаказовПокупателя.ВРаботе;  
			Иначе
				ЗаписыватьСтатус = Ложь;
			КонецЕсли;
		КонецЕсли;   
		Если СтатусЗаписи = Перечисления.СтатусыЗаказовПокупателя.Доставлен или 
			 СтатусЗаписи = Перечисления.СтатусыЗаказовПокупателя.Отгружен или 
			 СтатусЗаписи = Перечисления.СтатусыЗаказовПокупателя.Собран Тогда
			ЗаписыватьСтатус = Ложь;
		КонецЕсли;
	КонецЕсли; 
	
	Если ЗаписыватьСтатус = Истина тогда
		НоваяЗапись = РегистрыСведений.ИсторияЗаказовПокупателейПоСтатусам.СоздатьМенеджерЗаписи();
		НоваяЗапись.Период = ТекущаяДата();		
		НоваяЗапись.ЗаказПокупателя = Ссылка;
		НоваяЗапись.СтатусЗаказаПокупателя = СтатусЗаписи; 
		НоваяЗапись.Записать(Ложь);	
	КонецЕсли;
	
КонецПроцедуры









