#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Механизм ПодключаемыеКоманды (БСП) в maERP не перенесен.
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// Механизм ПодключаемыеКоманды (БСП) в maERP не перенесен.
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ БСП

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	// Механизм ПодключаемыеКоманды (БСП) в maERP не перенесен.
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	// Механизм ПодключаемыеКоманды (БСП) в maERP не перенесен.
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	// Механизм ПодключаемыеКоманды (БСП) в maERP не перенесен.
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти