
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Если ЗначениеЗаполнено(Контрагент) Тогда
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;	
	//КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНового(Команда)
	Оп = Новый ОписаниеОповещения("ПослеСозданияКлиента", ЭтаФорма);
	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаЭлементаРозница",,ЭтаФорма,,,,Оп,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПослеСозданияКлиента(Результат, ДопПараметры) Экспорт
	Если Не Результат = Неопределено Тогда 
		Элементы.Список.ТекущаяСтрока = Результат;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
