
#Область Интерфейс

Функция ПолучитьКонтактнуюИнформацию(Контрагенты, ВидыРеквизитов, НазначениеРассылки = Неопределено) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	РеквизитыКонтрагентовСрезПоследних.Контрагент КАК Контрагент,
	                      |	РеквизитыКонтрагентовСрезПоследних.Реквизит КАК Реквизит,
	                      |	РеквизитыКонтрагентовСрезПоследних.Представление КАК Представление,
	                      |	РеквизитыКонтрагентовСрезПоследних.НазначениеРассылки КАК НазначениеРассылки
	                      |ИЗ
	                      |	РегистрСведений.РеквизитыКонтрагентов.СрезПоследних(
	                      |			,
	                      |			Контрагент В (&Контрагенты)
	                      |				И ВЫБОР
	                      |					КОГДА &ВидыРеквизитов = НЕОПРЕДЕЛЕНО
	                      |						ТОГДА Реквизит В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.Контакты))
	                      |					ИНАЧЕ Реквизит В (&ВидыРеквизитов)
	                      |				КОНЕЦ) КАК РеквизитыКонтрагентовСрезПоследних
	                      |ГДЕ
	                      |	ВЫБОР
	                      |			КОГДА &НазначениеРассылки = НЕОПРЕДЕЛЕНО
	                      |				ТОГДА ИСТИНА
	                      |			ИНАЧЕ РеквизитыКонтрагентовСрезПоследних.НазначениеРассылки = &НазначениеРассылки
	                      |		КОНЕЦ");
	Запрос.УстановитьПараметр("Контрагенты", Контрагенты);
	Запрос.УстановитьПараметр("ВидыРеквизитов", ВидыРеквизитов);
	Запрос.УстановитьПараметр("НазначениеРассылки", НазначениеРассылки);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ПолучитьКонтактнуюИнформациюПоТипу(Контрагенты, ВидРеквизита, НазначениеРассылки = Неопределено, ТЗКонтактнаяИнформация = Неопределено) Экспорт
	Если ТЗКонтактнаяИнформация = Неопределено Тогда
		ТЗКонтактнаяИнформация = ПолучитьКонтактнуюИнформацию(Контрагенты, ВидРеквизита, НазначениеРассылки);	
	КонецЕсли;
	Отбор = Новый Структура("Реквизит", ВидРеквизита);
	Если ЗначениеЗаполнено(НазначениеРассылки) Тогда
		Отбор.Вставить("НазначениеРассылки", НазначениеРассылки);	
	КонецЕсли;	
	Мас = ТЗКонтактнаяИнформация.НайтиСтроки(Отбор);
	МасРезультат = Новый Массив;
	Для Каждого Стр Из Мас Цикл
		МасРезультат.Добавить(Стр.Представление);	
	КонецЦикла;	
	Возврат МасРезультат;
КонецФункции

Функция ПолучитьДеревоРеквизитовКонтрагента(Контрагент) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	РеквизитыКонтрагентовСрезПоследних.Реквизит КАК Реквизит,
	                      |	РеквизитыКонтрагентовСрезПоследних.Представление КАК Представление,
	                      |	РеквизитыКонтрагентовСрезПоследних.Значение КАК Значение,
	                      |	1 КАК Уровень,
	                      |	ВЫБОР
	                      |		КОГДА РеквизитыКонтрагентовСрезПоследних.Реквизит.Родитель = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.РегистрационныеДанные)
	                      |			ТОГДА 3
	                      |		КОГДА РеквизитыКонтрагентовСрезПоследних.Реквизит.Родитель = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.Адреса)
	                      |			ТОГДА 5
	                      |		КОГДА РеквизитыКонтрагентовСрезПоследних.Реквизит.Родитель = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.КонтактныеЛица)
	                      |			ТОГДА 6
	                      |		КОГДА РеквизитыКонтрагентовСрезПоследних.Реквизит = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.Телефон)
	                      |			ТОГДА 0
	                      |		КОГДА РеквизитыКонтрагентовСрезПоследних.Реквизит = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.ТелефонФикс)
	                      |			ТОГДА 0
	                      |		КОГДА РеквизитыКонтрагентовСрезПоследних.Реквизит = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.EMail)
	                      |			ТОГДА 1
	                      |		КОГДА РеквизитыКонтрагентовСрезПоследних.Реквизит = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.Web)
	                      |			ТОГДА 2
	                      |		КОГДА РеквизитыКонтрагентовСрезПоследних.Реквизит = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.Другое)
	                      |			ТОГДА 4
	                      |		ИНАЧЕ -1
	                      |	КОНЕЦ КАК ИндексКартинки,
	                      |	РеквизитыКонтрагентовСрезПоследних.Реквизит.Порядок КАК Порядок,
	                      |	РеквизитыКонтрагентовСрезПоследних.Комментарий КАК Комментарий,
	                      |	РеквизитыКонтрагентовСрезПоследних.НазначениеРассылки КАК НазначениеРассылки
	                      |ИЗ
	                      |	РегистрСведений.РеквизитыКонтрагентов.СрезПоследних(, Контрагент = &Контрагент) КАК РеквизитыКонтрагентовСрезПоследних
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Порядок
	                      |ИТОГИ
	                      |	-1 КАК ИндексКартинки,
	                      |	МИНИМУМ(Порядок)
	                      |ПО
	                      |	Реквизит ТОЛЬКО ИЕРАРХИЯ");
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Возврат Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);	
КонецФункции		

Функция ЗаполнитьРеквизитыПоИНН(Контрагент, NIF) Экспорт
	УстановитьПривилегированныйРежим(Истина);	
	Результат = Новый Структура("Установлены, Сообщение, ВидКонтрагента, Наименование, НаименованиеПолное, NIF, RC, АдресЮридический", Ложь, "");
	ПроверкаПодписки = РаботаСКонтрагентами.ДанныеАутентификацииПользователяИнтернетПоддержки();
	Если ПроверкаПодписки = Неопределено Тогда
		Результат.Сообщение = "Не указаны данные аутентификации поддержки ИТС!";
		Возврат Результат;
	КонецЕсли;
	// Получаем данные
	Если СтрДлина(NIF) = 10 Тогда
		РеквизитыКонтрагента = РаботаСКонтрагентами.РеквизитыЮридическогоЛицаПоИНН(NIF);
		Результат.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ЮридическоеЛицо; 
	ИначеЕсли СтрДлина(NIF) = 12 Тогда
		РеквизитыКонтрагента = РаботаСКонтрагентами.РеквизитыПредпринимателяПоИНН(NIF); 
		Результат.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ИндивидуальныйПредприниматель;
	Иначе
		Результат.Сообщение = "ИНН введен не корректно!"; 
		Возврат Результат;
	КонецЕсли;
	// Заполняем
	Если ЗначениеЗаполнено(РеквизитыКонтрагента.ОписаниеОшибки) Тогда
		Результат.Сообщение = РеквизитыКонтрагента.ОписаниеОшибки; 
		Возврат Результат;	
	КонецЕсли;	
	Результат.Наименование = РеквизитыКонтрагента.НаименованиеСокращенное;
	Результат.НаименованиеПолное = РеквизитыКонтрагента.НаименованиеПолное; 
	Если РеквизитыКонтрагента.Свойство("RC") Тогда
		Результат.RC = РеквизитыКонтрагента.RC;	
	КонецЕсли;
	Если РеквизитыКонтрагента.Свойство("ЮридическийАдрес") Тогда
		Результат.АдресЮридический = РеквизитыКонтрагента.ЮридическийАдрес.Представление;	
	КонецЕсли;	
	УстановитьРеквизиты(Контрагент, РеквизитыКонтрагента);
	Результат.Установлены = Истина;
	Возврат Результат;
КонецФункции

Процедура УстановитьРеквизиты(Контрагент, Реквизиты) Экспорт
	ВидыРеквизитов = ПланыВидовХарактеристик.ВидыРеквизитовКонтрагентов; 
	Если Реквизиты.Свойство("NIF") Тогда
		ДобавитьДанные(Контрагент, ВидыРеквизитов.NIF, Реквизиты.NIF, Реквизиты.NIF); 
	КонецЕсли;
	Если Реквизиты.Свойство("RC") Тогда
		ДобавитьДанные(Контрагент, ВидыРеквизитов.RC, Реквизиты.RC, Реквизиты.RC);
	КонецЕсли;
	Если Реквизиты.Свойство("ДатаРегистрации") Тогда
		ДобавитьДанные(Контрагент, ВидыРеквизитов.ДатаРегистрации, Реквизиты.ДатаРегистрации, Реквизиты.ДатаРегистрации);
	КонецЕсли;
	Если Реквизиты.Свойство("ЮридическийАдрес") Тогда
		ДобавитьДанные(Контрагент, ВидыРеквизитов.АдресЮридический, Реквизиты["ЮридическийАдрес"].КонтактнаяИнформация, Реквизиты["ЮридическийАдрес"].Представление); 
	КонецЕсли;
КонецПроцедуры

Процедура ДобавитьДанные(Контрагент, Реквизит,Значение, Представление, Знач Период = Неопределено) Экспорт
	Если Не ЗначениеЗаполнено(Значение) Тогда Возврат КонецЕсли;
	Если Реквизит.Периодический Тогда 
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	РеквизитыКонтрагентовСрезПоследних.Период КАК Период,
		                      |	РеквизитыКонтрагентовСрезПоследних.Контрагент КАК Контрагент,
		                      |	РеквизитыКонтрагентовСрезПоследних.Реквизит КАК Реквизит,
		                      |	РеквизитыКонтрагентовСрезПоследних.Значение КАК Значение
		                      |ИЗ
		                      |	РегистрСведений.РеквизитыКонтрагентов.СрезПоследних(
		                      |			&ДатаСреза,
		                      |			Контрагент = &Контрагент
		                      |				И Реквизит = &Реквизит
		                      |				И Представление = &Представление) КАК РеквизитыКонтрагентовСрезПоследних");
		Запрос.УстановитьПараметр("ДатаСреза", ?(Период = Неопределено, ТекущаяДатаСеанса(), Период));
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		Запрос.УстановитьПараметр("Реквизит", Реквизит);
		Запрос.УстановитьПараметр("Представление", Представление);
		Рез = Запрос.Выполнить();
		Если Не Рез.Пустой() Тогда Возврат КонецЕсли;
	    Период = ?(Период = Неопределено, ТекущаяДатаСеанса(), Период);
	КонецЕсли;
	МЗ = РегистрыСведений.РеквизитыКонтрагентов.СоздатьМенеджерЗаписи();
	МЗ.Период = ?(Период = Неопределено Или Не Реквизит.Периодический, ДатаНепериодическогоРеквизита(), Период);
	МЗ.Контрагент = Контрагент;
	МЗ.Реквизит = Реквизит;
	МЗ.Разделитель = 0;	
	МЗ.Значение = Значение;
	МЗ.Представление = Представление;
	МЗ.Записать(Истина);
КонецПроцедуры

Процедура УдалитьДанные(Контрагент) Экспорт
	НЗ = РегистрыСведений.РеквизитыКонтрагентов.СоздатьНаборЗаписей();
	НЗ.Отбор.Контрагент.Установить(Контрагент);
	НЗ.Записать(Истина);	
КонецПроцедуры

Функция ПолучитьКонтрагентаПоИНН(NIF) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	РеквизитыКонтрагентов.Контрагент КАК Контрагент
	                      |ИЗ
	                      |	РегистрСведений.РеквизитыКонтрагентов КАК РеквизитыКонтрагентов
	                      |ГДЕ
	                      |	РеквизитыКонтрагентов.Реквизит = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.NIF)
	                      |	И РеквизитыКонтрагентов.Представление = &NIF
	                      |	И РеквизитыКонтрагентов.Контрагент ССЫЛКА Справочник.Контрагенты");
	Запрос.УстановитьПараметр("NIF", NIF);
	Рез = Запрос.Выполнить();
	Возврат ?(Рез.Пустой(), Справочники.Контрагенты.ПустаяСсылка(), Рез.Выгрузить()[0].Контрагент);
КонецФункции	

#КонецОбласти

#Область Дополнительно	

Функция ПолучитьМаскиТелефонныхНомеров() Экспорт
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Код", Новый ОписаниеТипов("Строка"));
	ТЗ.Колонки.Добавить("Страна", Новый ОписаниеТипов("Строка"));
	ТЗ.Колонки.Добавить("СтранаEN", Новый ОписаниеТипов("Строка"));
	ТЗ.Колонки.Добавить("Маска", Новый ОписаниеТипов("Строка"));
	Макет = РегистрыСведений.РеквизитыКонтрагентов.ПолучитьМакет("МаскиТелефонныхНомеров");
	оДанные = Макет.ПолучитьОбласть("Данные");
	Для А = 2 По оДанные.ВысотаТаблицы Цикл
		НС = ТЗ.Добавить();
		НС.Код = СокрЛП(оДанные.Область(А, 1, А, 1).Текст);
		НС.Страна = СокрЛП(оДанные.Область(А, 2, А, 2).Текст);
		НС.СтранаEN = СокрЛП(оДанные.Область(А, 3, А, 3).Текст);
		НС.Маска = СокрЛП(оДанные.Область(А, 4, А, 4).Текст);
	КонецЦикла;	
	Возврат ТЗ;
КонецФункции	

Функция СформироватьДанныеДругое(Представление) Экспорт
	Результат = Новый Структура;
	Результат.Вставить("Представление", Представление);	
	Результат.Вставить("Значение", ОбщегоНазначенияКлиентСервер.КонвертироватьВJSON(Результат));
	Возврат Результат;
КонецФункции

Функция ДатаНепериодическогоРеквизита() Экспорт
	Возврат Дата(2000,1,1);	
КонецФункции

#КонецОбласти

