
#Область Обработчики_событий_формы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВыбранныйГод = Год(ТекущаяДата());
	ОтобразитьКалендарьНаВыбранныйГод();
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура ВыбранныйГодПриИзменении(Элемент)
	ОтобразитьКалендарьНаВыбранныйГод();
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНовыеВыходныеДни();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоУмолчанию(Команда)
	ЗаполнитьВыходныеДниПоУмолчанию();
	Элементы.ДатыВыходных.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ДатыВыходныхВыбор(Элемент, ВыбраннаяДата)
	НайденнаяДата = СЗВыходные.НайтиПоЗначению(ВыбраннаяДата); 
	Если НайденнаяДата = Неопределено Тогда // Добавляем дату
		СЗВыходные.Добавить(ВыбраннаяДата);	
	Иначе // Удаляем дату
		СЗВыходные.Удалить(НайденнаяДата);
	КонецЕсли;
	Элементы.ДатыВыходных.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ДатыВыходныхПриВыводеПериода(Элемент, ОформлениеПериода)
	ЦветВыходногоДня = Новый Цвет(255, 0, 0); // Красный
	ЦветБудничногоДня = Новый Цвет(0, 0, 0); // Черный
	Для Каждого Стр Из ОформлениеПериода.Даты Цикл
		Если СЗВыходные.НайтиПоЗначению(Стр.Дата) = Неопределено Тогда
			Стр.ЦветТекста = ЦветБудничногоДня;				
		Иначе
			Стр.ЦветТекста = ЦветВыходногоДня;
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

#КонецОбласти

#Область Дополнительно

&НаКлиенте
Процедура ОтобразитьКалендарьНаВыбранныйГод()
	НачалоПериода = Дата(ВыбранныйГод, 1, 1);
	КонецПериода = Дата(ВыбранныйГод, 12, 31, 23, 59, 59);
	// Ограничиваем период отображения календаря	
	Элементы.ДатыВыходных.НачалоПериодаОтображения = НачалоПериода;
	Элементы.ДатыВыходных.КонецПериодаОтображения = КонецПериода;
	// Получаем выходные из регистра
	МасВыходные = ПолучитьСписокВыходныхДат(НачалоПериода, КонецПериода);
	СЗВыходные.ЗагрузитьЗначения(МасВыходные);
	Если СЗВыходные.Количество() = 0 Тогда
		ЗаполнитьВыходныеДниПоУмолчанию();	
	КонецЕсли;
	Элементы.ДатыВыходных.Обновить();
КонецПроцедуры	

&НаСервере
Функция ПолучитьСписокВыходныхДат(НачалоПериода, КонецПериода)
	Возврат РегистрыСведений.ПроизводственныйКалендарь.ПолучитьВыходные(НачалоПериода, КонецПериода);
КонецФункции	

&НаСервере
Процедура ЗаписатьНовыеВыходныеДни()
	РегистрыСведений.ПроизводственныйКалендарь.ПерезаписатьВыходные(СЗВыходные);	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьВыходныеДниПоУмолчанию()
	СЗВыходные.Очистить();
	ВыбДата = Дата(ВыбранныйГод, 1, 1);
	// Прописываем субботы и воскресения
	Пока Год(ВыбДата) = ВыбранныйГод Цикл
		ТекДеньНедели = ДеньНедели(ВыбДата); 
		Если ТекДеньНедели = 6 Или ТекДеньНедели = 7 Тогда
			СЗВыходные.Добавить(ВыбДата);	
		КонецЕсли;
		ВыбДата = ВыбДата + 86400;
	КонецЦикла;
	// Прописываем праздники
	СЗВыходные.Добавить(Дата(ВыбранныйГод, 1, 1));	// Новый год
	СЗВыходные.Добавить(Дата(ВыбранныйГод, 1, 2)); 	// Новый год
	СЗВыходные.Добавить(Дата(ВыбранныйГод, 1, 3)); 	// Новый год
	СЗВыходные.Добавить(Дата(ВыбранныйГод, 1, 4)); 	// Новый год
	СЗВыходные.Добавить(Дата(ВыбранныйГод, 1, 5)); 	// Новый год
	СЗВыходные.Добавить(Дата(ВыбранныйГод, 1, 6)); 	// Новый год
	СЗВыходные.Добавить(Дата(ВыбранныйГод, 1, 7)); 	// Рождество
	СЗВыходные.Добавить(Дата(ВыбранныйГод, 1, 8)); 	// Новый год
	СЗВыходные.Добавить(Дата(ВыбранныйГод, 2, 23));	// День защитника Отечества 
	СЗВыходные.Добавить(Дата(ВыбранныйГод, 3, 8));	// Международный женский день
	СЗВыходные.Добавить(Дата(ВыбранныйГод, 5, 1));	// Праздник Весны и Труда
	СЗВыходные.Добавить(Дата(ВыбранныйГод, 5, 9));	// День Победы	
	СЗВыходные.Добавить(Дата(ВыбранныйГод, 6, 12));	// День России
	СЗВыходные.Добавить(Дата(ВыбранныйГод, 11, 4)); // День народного единства
КонецПроцедуры	

#КонецОбласти



