#Область ПрограмныйИнтерфейс

//++ Аботуров Е.В. 05.11.2025 1C-1601
//Процедура копирует/создает для ползователяИБ по имени ИмяПриемник все настройки из ХранилищеСистемныхНастроек
//
// Параметры:
//   ИмяИсточник - Строка - имя пользователя, у которого копируются настройки
//   ИмяПриемник - Строка - имя пользователя, которому настройки загружаются/создаются
//
Процедура ПеренестиНастройкиПользователя(ИмяИсточник, ИмяПриемник) Экспорт
	
	ВыборкаНастроек = ХранилищеСистемныхНастроек.Выбрать(Новый Структура("Пользователь", ИмяИсточник));
	
	Пока ВыборкаНастроек.Следующий() Цикл
		
		Настройка = ХранилищеСистемныхНастроек.Загрузить(ВыборкаНастроек.КлючОбъекта, ВыборкаНастроек.КлючНастроек,, ВыборкаНастроек.Пользователь);
		
		Если Настройка <> Неопределено Тогда
			
			ХранилищеСистемныхНастроек.Сохранить(ВыборкаНастроек.КлючОбъекта, ВыборкаНастроек.КлючНастроек, Настройка, , ИмяПриемник);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры//-- Аботуров Е.В. 05.11.2025

#КонецОбласти
