
Процедура ПолучитьАктуальные(МВТ, ДатаСреза, МасНоменклатура = Неопределено) Экспорт
	Если МасНоменклатура = Неопределено Тогда
		МасНоменклатура = Новый Массив;	
	КонецЕсли;	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПравилаЦенообразованияСрезПоследних.Период КАК Период,
	                      |	ПравилаЦенообразованияСрезПоследних.Параметр КАК Параметр,
	                      |	ВЫБОР
	                      |		КОГДА ТИПЗНАЧЕНИЯ(ПравилаЦенообразованияСрезПоследних.Параметр) = ТИП(Справочник.Номенклатура)
	                      |			ТОГДА 1
	                      |		ИНАЧЕ 2
	                      |	КОНЕЦ КАК Порядок,
	                      |	ПравилаЦенообразованияСрезПоследних.ОсноваРасчёта КАК ОсноваРасчёта,
	                      |	ПравилаЦенообразованияСрезПоследних.ВидНаценки КАК ВидНаценки,
	                      |	ПравилаЦенообразованияСрезПоследних.Показатель КАК Показатель
	                      |ПОМЕСТИТЬ ВТ
	                      |ИЗ
	                      |	РегистрСведений.ПравилаЦенообразования.СрезПоследних(&ДатаСреза, ) КАК ПравилаЦенообразованияСрезПоследних
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ.Период КАК Период,
	                      |	ВТ.Параметр КАК Параметр,
	                      |	ВТ.Порядок КАК Порядок,
	                      |	ВТ.ОсноваРасчёта КАК ОсноваРасчёта,
	                      |	ВТ.ВидНаценки КАК ВидНаценки,
	                      |	ВТ.Показатель КАК Показатель
	                      |ПОМЕСТИТЬ ВТПравила
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		МАКСИМУМ(ВТ.Период) КАК Период
	                      |	ИЗ
	                      |		ВТ КАК ВТ) КАК ВЗ
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ КАК ВТ
	                      |		ПО ВЗ.Период = ВТ.Период
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Номенклатура.Ссылка КАК Номенклатура,
	                      |	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	                      |	ВТПравила.Порядок КАК Порядок,
	                      |	ВТПравила.ОсноваРасчёта КАК ОсноваРасчёта,
	                      |	ВТПравила.ВидНаценки КАК ВидНаценки,
	                      |	ВТПравила.Показатель КАК Показатель
	                      |ПОМЕСТИТЬ ВТПравилаПредварительные
	                      |ИЗ
	                      |	ВТПравила КАК ВТПравила
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	                      |		ПО (ВЫБОР
	                      |				КОГДА ТИПЗНАЧЕНИЯ(ВТПравила.Параметр) = ТИП(Справочник.Номенклатура)
	                      |					ТОГДА ВТПравила.Параметр = Номенклатура.Ссылка
	                      |				КОГДА ТИПЗНАЧЕНИЯ(ВТПравила.Параметр) = ТИП(Справочник.ТоварныеГруппы)
	                      |					ТОГДА ВТПравила.Параметр = Номенклатура.ТоварнаяГруппа
	                      |			КОНЕЦ)
	                      |			И (ВЫБОР
	                      |				КОГДА &НоменклатураУстановлена
	                      |					ТОГДА Номенклатура.Ссылка В (&МасНоменклатура)
	                      |				ИНАЧЕ ИСТИНА
	                      |			КОНЕЦ)
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	Номенклатура.Ссылка,
	                      |	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)),
	                      |	ВТПравила.Порядок,
	                      |	ВТПравила.ОсноваРасчёта,
	                      |	ВТПравила.ВидНаценки,
	                      |	ВТПравила.Показатель
	                      |ИЗ
	                      |	ВТПравила КАК ВТПравила
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	                      |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	                      |			ПО Номенклатура.Ссылка = ХарактеристикиНоменклатуры.Владелец
	                      |		ПО (ВЫБОР
	                      |				КОГДА ТИПЗНАЧЕНИЯ(ВТПравила.Параметр) = ТИП(Справочник.Номенклатура)
	                      |					ТОГДА ВТПравила.Параметр = Номенклатура.Ссылка
	                      |				КОГДА ТИПЗНАЧЕНИЯ(ВТПравила.Параметр) = ТИП(Справочник.ТоварныеГруппы)
	                      |					ТОГДА ВТПравила.Параметр = Номенклатура.ТоварнаяГруппа
	                      |			КОНЕЦ)
	                      |			И (ВЫБОР
	                      |				КОГДА &НоменклатураУстановлена
	                      |					ТОГДА Номенклатура.Ссылка В (&МасНоменклатура)
	                      |				ИНАЧЕ ИСТИНА
	                      |			КОНЕЦ)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТПравилаПредварительные.Номенклатура КАК Номенклатура,
	                      |	ВТПравилаПредварительные.Характеристика КАК Характеристика,
	                      |	ВТПравилаПредварительные.ОсноваРасчёта КАК ОсноваРасчёта,
	                      |	ВТПравилаПредварительные.ВидНаценки КАК ВидНаценки,
	                      |	ВТПравилаПредварительные.Показатель КАК Показатель
	                      |ПОМЕСТИТЬ ВТПравилаЦенообразования
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		ВТПравилаПредварительные.Номенклатура КАК Номенклатура,
	                      |		ВТПравилаПредварительные.Характеристика КАК Характеристика,
	                      |		МИНИМУМ(ВТПравилаПредварительные.Порядок) КАК Порядок
	                      |	ИЗ
	                      |		ВТПравилаПредварительные КАК ВТПравилаПредварительные
	                      |	
	                      |	СГРУППИРОВАТЬ ПО
	                      |		ВТПравилаПредварительные.Номенклатура,
	                      |		ВТПравилаПредварительные.Характеристика) КАК ВЗ
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПравилаПредварительные КАК ВТПравилаПредварительные
	                      |		ПО ВЗ.Номенклатура = ВТПравилаПредварительные.Номенклатура
	                      |			И ВЗ.Характеристика = ВТПравилаПредварительные.Характеристика
	                      |			И ВЗ.Порядок = ВТПравилаПредварительные.Порядок
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |УНИЧТОЖИТЬ ВТ
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |УНИЧТОЖИТЬ ВТПравила
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |УНИЧТОЖИТЬ ВТПравилаПредварительные");
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.УстановитьПараметр("МасНоменклатура", МасНоменклатура);
	Запрос.УстановитьПараметр("НоменклатураУстановлена", МасНоменклатура.Количество() > 0);
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Выполнить();
КонецПроцедуры

Функция СформироватьБазовыеЦены(ДатаСреза) Экспорт
	МВТ = Новый МенеджерВременныхТаблиц;
	ПолучитьАктуальные(МВТ, ДатаСреза);
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЦеныНоменклатурыПоставщиковСрезПоследних.Период КАК Период,
	                      |	ЦеныНоменклатурыПоставщиковСрезПоследних.Номенклатура КАК Номенклатура,
	                      |	ЦеныНоменклатурыПоставщиковСрезПоследних.Характеристика КАК Характеристика,
	                      |	ЦеныНоменклатурыПоставщиковСрезПоследних.ЦенаЕдиницыХранения КАК Цена
	                      |ПОМЕСТИТЬ ВТЦеныПоставщиков
	                      |ИЗ
	                      |	РегистрСведений.ЦеныНоменклатурыПоставщиков.СрезПоследних(&ДатаСреза, ) КАК ЦеныНоменклатурыПоставщиковСрезПоследних
	                      |;
	                      |
						  //|////////////////////////////////////////////////////////////////////////////////
						  //|ВЫБРАТЬ
						  //|	ВТЦеныПоставщиков.Номенклатура КАК Номенклатура,
						  //|	ВТЦеныПоставщиков.Характеристика КАК Характеристика,
						  //|	МАКСИМУМ(ВТЦеныПоставщиков.Цена) КАК Цена
						  //|ПОМЕСТИТЬ ВТЦеныПоставщиковПоследние
						  //|ИЗ
						  //|	(ВЫБРАТЬ
						  //|		МАКСИМУМ(ВТЦеныПоставщиков.Период) КАК Период,
						  //|		ВТЦеныПоставщиков.Номенклатура КАК Номенклатура,
						  //|		ВТЦеныПоставщиков.Характеристика КАК Характеристика
						  //|	ИЗ
						  //|		ВТЦеныПоставщиков КАК ВТЦеныПоставщиков
						  //|	
						  //|	СГРУППИРОВАТЬ ПО
						  //|		ВТЦеныПоставщиков.Номенклатура,
						  //|		ВТЦеныПоставщиков.Характеристика) КАК ВЗ
						  //|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЦеныПоставщиков КАК ВТЦеныПоставщиков
						  //|		ПО ВЗ.Период = ВТЦеныПоставщиков.Период
						  //|			И ВЗ.Номенклатура = ВТЦеныПоставщиков.Номенклатура
						  //|			И ВЗ.Характеристика = ВТЦеныПоставщиков.Характеристика
						  //|
						  //|СГРУППИРОВАТЬ ПО
						  //|	ВТЦеныПоставщиков.Номенклатура,
						  //|	ВТЦеныПоставщиков.Характеристика
						  //|;
	                      |
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТоварыВНаличииОстатки.Номенклатура КАК Номенклатура,
	                      |	ТоварыВНаличииОстатки.Характеристика КАК Характеристика,
	                      |	СУММА(ТоварыВНаличииОстатки.КоличествоОстаток) КАК Количество,
	                      |	СУММА(ТоварыВНаличииОстатки.СуммаОстаток) КАК Сумма
	                      |ПОМЕСТИТЬ ВТОстатки
	                      |ИЗ
	                      |	РегистрНакопления.ТоварыВНаличии.Остатки(&ДатаСреза, ) КАК ТоварыВНаличииОстатки
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ТоварыВНаличииОстатки.Номенклатура,
	                      |	ТоварыВНаличииОстатки.Характеристика
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВЗ.Номенклатура КАК Номенклатура,
	                      |	ВЗ.Характеристика КАК Характеристика,
	                      |	ВЗ.ЗакупочнаяЦена КАК ЗакупочнаяЦена,
	                      |	ВЫБОР
	                      |		КОГДА ВЗ.ВидНаценки = ЗНАЧЕНИЕ(Перечисление.ВидыНаценок.Сумма)
	                      |			ТОГДА ВЗ.ОсноваРасчётаСумма + ВЗ.Показатель
	                      |		КОГДА ВЗ.ВидНаценки = ЗНАЧЕНИЕ(Перечисление.ВидыНаценок.Процент)
	                      |			ТОГДА ВЗ.ОсноваРасчётаСумма + ВЗ.ОсноваРасчётаСумма / 100 * ВЗ.Показатель
	                      |	КОНЕЦ КАК Цена
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		ВЫРАЗИТЬ(ВТПравилаЦенообразования.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	                      |		ВТПравилаЦенообразования.Характеристика КАК Характеристика,
	                      |		ВТПравилаЦенообразования.ВидНаценки КАК ВидНаценки,
	                      |		ВТПравилаЦенообразования.Показатель КАК Показатель,
	                      |		ВТПравилаЦенообразования.ОсноваРасчёта КАК ОсноваРасчёта,
						  |		ВТЦеныПоставщиковПоследние.Цена как ЗакупочнаяЦена,
	                      |		ВЫБОР
	                      |			КОГДА ВТПравилаЦенообразования.ОсноваРасчёта = ЗНАЧЕНИЕ(Перечисление.ОсновыРасчётаНаценок.Себестоимость)
	                      |				ТОГДА ВЫБОР
	                      |						КОГДА ЕСТЬNULL(ВТОстатки.Количество, 0) = 0
	                      |							ТОГДА 0
	                      |						ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВТОстатки.Сумма, 0) / ЕСТЬNULL(ВТОстатки.Количество, 0) + ЕСТЬNULL(ВТОстатки.Сумма, 0) / ЕСТЬNULL(ВТОстатки.Количество, 0) / 100 * ЕСТЬNULL(НадбавкиНаСебестоимостьСрезПоследних.Процент, 0) КАК ЧИСЛО(12, 2))
	                      |					КОНЕЦ
	                      |			КОГДА ВТПравилаЦенообразования.ОсноваРасчёта = ЗНАЧЕНИЕ(Перечисление.ОсновыРасчётаНаценок.ПоследнийПриход)
	                      |				ТОГДА ВЫБОР
	                      |						КОГДА ЕСТЬNULL(ВТЦеныПоставщиковПоследние.Цена, 0) = 0
	                      |							ТОГДА 0
	                      |						ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВТЦеныПоставщиковПоследние.Цена, 0) + ЕСТЬNULL(ВТЦеныПоставщиковПоследние.Цена, 0) / 100 * ЕСТЬNULL(НадбавкиНаСебестоимостьСрезПоследних.Процент, 0) КАК ЧИСЛО(12, 2))
	                      |					КОНЕЦ
	                      |			ИНАЧЕ 0
	                      |		КОНЕЦ КАК ОсноваРасчётаСумма
	                      |	ИЗ
	                      |		ВТПравилаЦенообразования КАК ВТПравилаЦенообразования
	                      |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НадбавкиНаСебестоимость.СрезПоследних(&ДатаСреза, ) КАК НадбавкиНаСебестоимостьСрезПоследних
	                      |			ПО ВТПравилаЦенообразования.Номенклатура = НадбавкиНаСебестоимостьСрезПоследних.Номенклатура
	                      |				И ВТПравилаЦенообразования.Характеристика = НадбавкиНаСебестоимостьСрезПоследних.Характеристика
	                      |			ЛЕВОЕ СОЕДИНЕНИЕ ВТЦеныПоставщиков КАК ВТЦеныПоставщиковПоследние
	                      |			ПО ВТПравилаЦенообразования.Номенклатура = ВТЦеныПоставщиковПоследние.Номенклатура
	                      |				И ВТПравилаЦенообразования.Характеристика = ВТЦеныПоставщиковПоследние.Характеристика
	                      |			ЛЕВОЕ СОЕДИНЕНИЕ ВТОстатки КАК ВТОстатки
	                      |			ПО ВТПравилаЦенообразования.Номенклатура = ВТОстатки.Номенклатура
	                      |				И ВТПравилаЦенообразования.Характеристика = ВТОстатки.Характеристика) КАК ВЗ
						  //|ГДЕ
						  //|	ВЗ.ОсноваРасчётаСумма > 0 
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ВЗ.Номенклатура.Наименование");
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции


