
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Таб = Сформировать(ПараметрКоманды);
	ВыводПечатныхФормКлиент.ОткрытьПредварительныйПросмотр(Таб);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция Сформировать(Знач ПараметрКоманды)
	Таб = Новый ТабличныйДокумент;
	Для Каждого Док Из ПараметрКоманды Цикл
		Документы.РеализацияТоваровУслуг.PrintBLA4(Док, Таб, "Bon de livraison");
	КонецЦикла;
	Возврат Таб;
КонецФункции

#КонецОбласти
