
Процедура СформироватьДвижения(ДокОбъект) Экспорт
	Движения = ДокОбъект.Движения;
	Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ЗаказПоставщику") Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ЗаказПоставщикуТЧТовары.Ссылка.Дата КАК Период,
		                      |	ЗаказПоставщикуТЧТовары.Ссылка КАК Ссылка,
		                      |	ЗаказПоставщикуТЧТовары.ЗаказПоставщику КАК ЗаказПоставщику,
		                      |	ЗаказПоставщикуТЧТовары.Номенклатура КАК Номенклатура,
		                      |	ЗаказПоставщикуТЧТовары.Характеристика КАК Характеристика,
		                      |	ЗаказПоставщикуТЧТовары.КодСтроки КАК КодСтроки,
		                      |	ЗаказПоставщикуТЧТовары.Количество КАК Количество,
		                      |	ЗаказПоставщикуТЧТовары.СуммаСНДС КАК Сумма
		                      |ПОМЕСТИТЬ ВТ
		                      |ИЗ
		                      |	Документ.ЗаказПоставщику.ТЧТовары КАК ЗаказПоставщикуТЧТовары
		                      |ГДЕ
		                      |	ЗаказПоставщикуТЧТовары.Ссылка = &Док
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	ВТ.Период КАК Период,
		                      |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		                      |	ВТ.Ссылка КАК ЗаказПоставщику,
		                      |	ВТ.Номенклатура КАК Номенклатура,
		                      |	ВТ.Характеристика КАК Характеристика,
		                      |	ВТ.КодСтроки КАК КодСтроки,
		                      |	ВТ.Количество КАК Количество,
		                      |	ВТ.Сумма КАК Сумма
		                      |ИЗ
		                      |	ВТ КАК ВТ
		                      |
		                      |ОБЪЕДИНИТЬ ВСЕ
		                      |
		                      |ВЫБРАТЬ
		                      |	ВТ.Период,
		                      |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
		                      |	ВТ.ЗаказПоставщику,
		                      |	ВТ.Номенклатура,
		                      |	ВТ.Характеристика,
		                      |	ВТ.КодСтроки,
		                      |	ЗаказыПоставщикамОстатки.КоличествоОстаток,
		                      |	ЗаказыПоставщикамОстатки.СуммаОстаток
		                      |ИЗ
		                      |	ВТ КАК ВТ
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПоставщикам.Остатки(&ДатаОст, ) КАК ЗаказыПоставщикамОстатки
		                      |		ПО ВТ.ЗаказПоставщику = ЗаказыПоставщикамОстатки.ЗаказПоставщику
		                      |			И ВТ.КодСтроки = ЗаказыПоставщикамОстатки.КодСтроки
		                      |ГДЕ
		                      |	ВТ.ЗаказПоставщику <> ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)");
		Запрос.УстановитьПараметр("Док", ДокОбъект.Ссылка);
		Запрос.УстановитьПараметр("ДатаОст", РаботаСДокументамиВызовСервера.ПолучитьГраницуДокумента(ДокОбъект));
		Движения.ЗаказыПоставщикам.Загрузить(Запрос.Выполнить().Выгрузить());	
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПоступлениеТоваровУслуг") и ЗначениеЗаполнено(ДокОбъект.Основание) и ТипЗнч(ДокОбъект.Основание) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		Если ДокОбъект.Контрагент = Справочники.Контрагенты.Migration тогда Возврат; КонецЕсли;
		Для Каждого Стр Из ДокОбъект.ТЧТовары Цикл
			НС = Движения.ЗаказыПоставщикам.ДобавитьРасход();
			НС.Период = ДокОбъект.Дата;
			НС.ЗаказПоставщику = ДокОбъект.Основание;
			НС.Номенклатура = Стр.Номенклатура;
			НС.Характеристика = Стр.Характеристика;
			НС.КодСтроки = Стр.КодСтроки;
			НС.Количество = Стр.Количество;
			НС.Сумма = Стр.Сумма;
		КонецЦикла;	
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ВозвратПоставщику") Тогда
		ЗаказПоставщику = РаботаСДокументами.ПолучитьДокументРодительПоТипу(Тип("ДокументСсылка.ЗаказПоставщику"), ДокОбъект.Основание);
		Если Не ЗначениеЗаполнено(ЗаказПоставщику) Тогда Возврат КонецЕсли;
		Для Каждого Стр Из ДокОбъект.ТЧТовары Цикл
			НС = Движения.ЗаказыПоставщикам.ДобавитьРасход();
			НС.Период = ДокОбъект.Дата;
			НС.ЗаказПоставщику = ЗаказПоставщику;
			НС.Номенклатура = Стр.Номенклатура;
			НС.Характеристика = Стр.Характеристика;
			НС.КодСтроки = Стр.КодСтроки;
			НС.Количество = -Стр.Количество;
			НС.Сумма = -Стр.Сумма;
		КонецЦикла;
	КонецЕсли;		
КонецПроцедуры
