#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "%Предопределенный%", НСтр("ru = 'Поставляемый в составе конфигурации'; fr = 'Fourni dans le cadre de la configuration'; en = 'Supplied as part of the configuration'; es = 'Suministrado como parte de la configuración'"));
	Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "%Подключаемый%", НСтр("ru = 'Подключаемый по стандарту """"1С:Совместимо""""'; fr = 'Connectable selon la norme """"1C: Compatible""""'; en = 'Pluggable according to the """" standard1C:Compatible""""'; es = '1C:compatible""""'"));
	
	ВозможностьДобавленияНовыхДрайверов = МенеджерОборудованияВызовСервераПереопределяемый.ВозможностьДобавленияНовыхДрайверов(); 
	ПравоДоступаДобавление = ПравоДоступа("Добавление", Метаданные.Справочники.ДрайверыОборудования);
	
	Если Элементы.Найти("СписокСоздать") <> Неопределено Тогда 
		Элементы.СписокСоздать.Видимость = ПравоДоступаДобавление И ВозможностьДобавленияНовыхДрайверов;
	КонецЕсли;
	
	Если Элементы.Найти("СписокКонтекстноеМенюСоздать") <> Неопределено Тогда 
		Элементы.СписокКонтекстноеМенюСоздать.Видимость = ПравоДоступаДобавление И ВозможностьДобавленияНовыхДрайверов;
	КонецЕсли;
	
	Элементы.ДобавитьНовыйДрайверИзФайла.Видимость = ПравоДоступаДобавление И ВозможностьДобавленияНовыхДрайверов;
	
	ЭлементГруппировки = Список.Группировка.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	ЭлементГруппировки.Поле = Новый ПолеКомпоновкиДанных("ТипДрайвера");
	ЭлементГруппировки.Использование = Истина;
	
	ЭлементГруппировки = Список.Группировка.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	ЭлементГруппировки.Поле = Новый ПолеКомпоновкиДанных("ТипОборудования");
	ЭлементГруппировки.Использование = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	#Если МобильныйКлиент Тогда
		Элементы.Список.КоманднаяПанель.Видимость = Ложь;
	#КонецЕсли

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыборФайлаДрайвераЗавершение(ПолноеИмяФайла, Параметры) Экспорт
	
	Если Не ПустаяСтрока(ПолноеИмяФайла) Тогда
		ПараметрыФормы = Новый Структура("ПолноеИмяФайла", ПолноеИмяФайла);
		ОткрытьФорму("Справочник.ДрайверыОборудования.ФормаОбъекта", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНовыйДрайверИзФайла(Команда)
	
	#Если ВебКлиент Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Данный функционал доступен только в режиме тонкого и толстого клиента.'; fr = 'Cette fonctionnalité est disponible uniquement en mode client mince et épais.'; en = 'This functionality is only available in thin and thick client mode.'; es = 'Esta funcionalidad solo está disponible en el modo de cliente delgado y grueso.'"));
		Возврат;
	#КонецЕсли
	
	Оповещение = Новый ОписаниеОповещения("ВыборФайлаДрайвераЗавершение", ЭтотОбъект);
	МенеджерОборудованияКлиент.НачатьВыборФайлаДрайвера(Оповещение);
	
КонецПроцедуры

#КонецОбласти
