
Функция ПолучитьОсновную(Организация) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Кассы.Ссылка КАК Ссылка,
	                      |	Кассы.Основная КАК Основной
	                      |ИЗ
	                      |	Справочник.Кассы КАК Кассы
	                      |ГДЕ
	                      |	Кассы.ПометкаУдаления = ЛОЖЬ
	                      |	И Кассы.Владелец = &Организация
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Основной УБЫВ");
	Запрос.УстановитьПараметр("Организация", Организация);
	Рез = Запрос.Выполнить();
	Возврат ?(Рез.Пустой(), Справочники.Кассы.ПустаяСсылка(), Рез.Выгрузить()[0].Ссылка);
КонецФункции

