
Процедура Сформировать(Сотрудник, Описание, НавигационнаяСсылка = "") Экспорт
	УстановитьПривилегированныйРежим(Истина);
	МЗ = РегистрыСведений.СистемныеОповещения.СоздатьМенеджерЗаписи();
	МЗ.Сотрудник = Сотрудник;
	МЗ.ID = Новый УникальныйИдентификатор;
	МЗ.Описание = Описание;// + " / Автор - " + ПараметрыСеанса.Пользователь;
	МЗ.Дата = ТекущаяДатаСеанса();
	МЗ.Новое = Истина;
	МЗ.НавигационнаяСсылка = НавигационнаяСсылка;
	МЗ.Записать(Истина);
КонецПроцедуры

Функция ПолучитьНеотображённые(Сотрудник) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СистемныеОповещения.Сотрудник КАК Сотрудник,
	                      |	СистемныеОповещения.ID КАК ID,
	                      |	СистемныеОповещения.Описание КАК Описание,
	                      |	СистемныеОповещения.НавигационнаяСсылка КАК НавигационнаяСсылка
	                      |ИЗ
	                      |	РегистрСведений.СистемныеОповещения КАК СистемныеОповещения
	                      |ГДЕ
	                      |	СистемныеОповещения.Сотрудник = &Сотрудник
	                      |	И СистемныеОповещения.Отображено = ЛОЖЬ");
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Процедура ОтметитьКакОтображённое(Сотрудник, ID) Экспорт
	МЗ = РегистрыСведений.СистемныеОповещения.СоздатьМенеджерЗаписи();
	МЗ.Сотрудник = Сотрудник;
	МЗ.ID = ID;
	МЗ.Прочитать();
	Если ЗначениеЗаполнено(МЗ.Сотрудник) Тогда
		МЗ.Отображено = Истина;
		МЗ.Записать(Истина);
	КонецЕсли;	
КонецПроцедуры

Процедура ОчиститьПоСотруднику(Сотрудник) Экспорт
	НЗ = РегистрыСведений.СистемныеОповещения.СоздатьНаборЗаписей();
	НЗ.Отбор.Сотрудник.Установить(Сотрудник);
	НЗ.Записать();
КонецПроцедуры	
