
Функция ПоследнийПрайс(ДатаЦен, ВидЦены, МассивНоменклатуры = Неопределено) Экспорт
	//Запрос = Новый Запрос("ВЫБРАТЬ
	//                      |	ЦеныНоменклатурыСрезПоследних.Период КАК Период,
	//                      |	ЦеныНоменклатурыСрезПоследних.ВидЦены КАК ВидЦены,
	//                      |	ЦеныНоменклатурыСрезПоследних.ТоварнаяГруппа КАК ТоварнаяГруппа,
	//                      |	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	//                      |	ЦеныНоменклатурыСрезПоследних.Характеристика КАК Характеристика,
	//                      |	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
	//                      |	ЦеныНоменклатурыСрезПоследних.Упаковка КАК Упаковка
	//                      |ПОМЕСТИТЬ ВТЦены
	//                      |ИЗ
	//                      |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаЦен, ВидЦены В (&ВидЦены)) КАК ЦеныНоменклатурыСрезПоследних
	//                      |;
	//                      |
	//                      |////////////////////////////////////////////////////////////////////////////////
	//                      |ВЫБРАТЬ
	//                      |	ВТЦены.Период КАК Период,
	//                      |	ВТЦены.ВидЦены КАК ВидЦены,
	//                      |	ВТЦены.Номенклатура КАК Номенклатура,
	//                      |	ВТЦены.Характеристика КАК Характеристика,
	//                      |	ВТЦены.Цена КАК Цена,
	//                      |	ВТЦены.Упаковка КАК Упаковка
	//                      |ИЗ
	//                      |	(ВЫБРАТЬ
	//                      |		МАКСИМУМ(ВТЦены.Период) КАК Период,
	//                      |		ВТЦены.ВидЦены КАК ВидЦены,
	//                      |		ВТЦены.ТоварнаяГруппа КАК ТоварнаяГруппа
	//                      |	ИЗ
	//                      |		ВТЦены КАК ВТЦены
	//                      |	
	//                      |	СГРУППИРОВАТЬ ПО
	//                      |		ВТЦены.ВидЦены,
	//                      |		ВТЦены.ТоварнаяГруппа) КАК ВЗ
	//                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЦены КАК ВТЦены
	//                      |		ПО ВЗ.Период = ВТЦены.Период
	//                      |			И ВЗ.ВидЦены = ВТЦены.ВидЦены
	//                      |			И ВЗ.ТоварнаяГруппа = ВТЦены.ТоварнаяГруппа
	//                      |
	//                      |УПОРЯДОЧИТЬ ПО
	//                      |	ВТЦены.Номенклатура.Наименование,
	//                      |	ВТЦены.Характеристика.Наименование");
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЦеныНоменклатурыСрезПоследних.ВидЦены КАК ВидЦены,
	                      |	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	                      |	ЦеныНоменклатурыСрезПоследних.Характеристика КАК Характеристика,
	                      |	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
	                      |	ЦеныНоменклатурыСрезПоследних.Упаковка КАК Упаковка
	                      |ИЗ
	                      |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	                      |			&ДатаЦен,
	                      |			ВидЦены В (&ВидЦены)
	                      |				И ВЫБОР
	                      |					КОГДА &ЕстьМассивНоменклатуры
	                      |						ТОГДА Номенклатура В (&МассивНоменклатуры)
	                      |					ИНАЧЕ ИСТИНА
	                      |				КОНЕЦ) КАК ЦеныНоменклатурыСрезПоследних
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ЦеныНоменклатурыСрезПоследних.Номенклатура.Наименование,
	                      |	ЦеныНоменклатурыСрезПоследних.Характеристика.Наименование");
	Запрос.УстановитьПараметр("ДатаЦен", ДатаЦен);
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	Запрос.УстановитьПараметр("ЕстьМассивНоменклатуры", Не МассивНоменклатуры = Неопределено);
	Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Процедура СформироватьДвижения(ДокОбъект) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслугТЧТовары.Номенклатура КАК Номенклатура,
	|	ПоступлениеТоваровУслугТЧТовары.Характеристика КАК Характеристика,
	|	МАКСИМУМ(ПоступлениеТоваровУслугТЧТовары.Цена) КАК Цена,
	|	МАКСИМУМ(ПоступлениеТоваровУслугТЧТовары.ЦенаМинимальная) КАК ЦенаМинимальная,
	|	МАКСИМУМ(ПоступлениеТоваровУслугТЧТовары.ЦенаРозничная) КАК ЦенаРозничная,
	|	МАКСИМУМ(ПоступлениеТоваровУслугТЧТовары.ЦенаПоТипуЦен) КАК ЦенаПоТипуЦен
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.ТЧТовары КАК ПоступлениеТоваровУслугТЧТовары
	|ГДЕ
	|	ПоступлениеТоваровУслугТЧТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслугТЧТовары.Характеристика,
	|	ПоступлениеТоваровУслугТЧТовары.Номенклатура";
	Запрос.УстановитьПараметр("ССылка",ДокОбъект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	ВидЦеныМин = Справочники.ВидыЦен.МинимальнаяЦенаПродажи;
	ВидЦеныРозн = Справочники.ВидыЦен.Розничная;
	ВидЦеныЗакуп = Справочники.ВидыЦен.Закупочная;
	ТипЦеныПоТипуЦен = ДокОбъект.ТипЦеныПоТипуЦен;
	Пока Выборка.Следующий() Цикл
		Стр = Выборка;
		Если Не Стр.ЦенаМинимальная = 0 Тогда 
			НС = ДокОбъект.Движения.ЦеныНоменклатуры.Добавить();
			НС.Период = ДокОбъект.Дата;
			НС.ВидЦены = ВидЦеныМин;
			НС.Номенклатура = Стр.Номенклатура;
			НС.Характеристика = Стр.Характеристика;
			НС.ТоварнаяГруппа = Стр.Номенклатура.ТоварнаяГруппа;
			НС.Цена = Стр.ЦенаМинимальная;
		КонецЕсли;
		Если Не Стр.ЦенаРозничная = 0 Тогда 
			НС = ДокОбъект.Движения.ЦеныНоменклатуры.Добавить();
			НС.Период = ДокОбъект.Дата;
			НС.ВидЦены = ВидЦеныРозн;
			НС.Номенклатура = Стр.Номенклатура;
			НС.Характеристика = Стр.Характеристика;
			НС.ТоварнаяГруппа = Стр.Номенклатура.ТоварнаяГруппа;
			НС.Цена = Стр.ЦенаРозничная;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТипЦеныПоТипуЦен) и Не ТипЦеныПоТипуЦен = ВидЦеныРозн Тогда 
			Если Не Стр.ЦенаПоТипуЦен = 0 Тогда 
				НС = ДокОбъект.Движения.ЦеныНоменклатуры.Добавить();
				НС.Период = ДокОбъект.Дата;
				НС.ВидЦены = ТипЦеныПоТипуЦен;
				НС.Номенклатура = Стр.Номенклатура;
				НС.Характеристика = Стр.Характеристика;
				НС.ТоварнаяГруппа = Стр.Номенклатура.ТоварнаяГруппа;
				НС.Цена = Стр.ЦенаПоТипуЦен;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
