#Область ПрограммныйИнтерфейс

// Перечисляет печатные формы объекта.
// См. ПечатныеФормы.НоваяКоллекцияКомандПечати
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - пополняемая коллекция команд печати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	Команда = КомандыПечати.Добавить();
	Команда.ИмяМакета = "ПриходныйКассовыйОрдер";
	Команда.Представление = НСтр("ru = 'Приходный кассовый ордер'; fr = 'Bon d''encaissement';
		|en = 'Cash receipt order'; es = 'Orden de ingreso de caja'");

	Команда = КомандыПечати.Добавить();
	Команда.ИмяМакета = "Ticket";
	Команда.Представление = НСтр("ru = 'Чек'; fr = 'Ticket';
		|en = 'Receipt'; es = 'Recibo'");

КонецПроцедуры

// Формирует запрошенные печатные формы.
// См. ПечатныеФормы.СформироватьПечатныеФормы
//
// Параметры:
//  МассивОбъектов        - Массив          - печатаемые объекты
//  ПараметрыПечати       - Структура       - параметры команды печати
//  КоллекцияПечатныхФорм - ТаблицаЗначений - заполняемая коллекция печатных форм
//  ОбъектыПечати         - СписокЗначений  - соответствие объектов областям печати
//  ПараметрыВывода       - Структура       - параметры окна печати
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	Если ПечатныеФормы.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПриходныйКассовыйОрдер") Тогда
		Таб = Новый ТабличныйДокумент;
		Для Каждого Док Из МассивОбъектов Цикл
			НомерСтрокиНачало = Таб.ВысотаТаблицы + 1;
			ПечатьПриходныйКассовыйОрдер(Док, Таб);
			ПечатныеФормы.ЗадатьОбластьПечати(Таб, НомерСтрокиНачало, ОбъектыПечати, Док);
		КонецЦикла;
		ПечатныеФормы.ВывестиТабличныйДокумент(КоллекцияПечатныхФорм, "ПриходныйКассовыйОрдер",
			НСтр("ru = 'Приходный кассовый ордер'; fr = 'Bon d''encaissement';
			|en = 'Cash receipt order'; es = 'Orden de ingreso de caja'"),
			Таб, "Документ.ПриходныйКассовыйОрдер.ПриходныйКассовыйОрдер");
	КонецЕсли;

	Если ПечатныеФормы.НужноПечататьМакет(КоллекцияПечатныхФорм, "Ticket") Тогда
		Таб = Новый ТабличныйДокумент;
		Таб.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		Таб.АвтоМасштаб = Истина;
		Таб.ОтображатьСетку = Ложь;
		Таб.ОтображатьЗаголовки = Ложь;
		Таб.Защита = Ложь;
		Таб.ПолеСверху = 10;
		Таб.ПолеСлева = 5;
		Таб.ПолеСнизу = 10;
		Таб.ПолеСправа = 5;
		Для Каждого Док Из МассивОбъектов Цикл
			НомерСтрокиНачало = Таб.ВысотаТаблицы + 1;
			ПечатьЧека(Док, Таб);
			ПечатныеФормы.ЗадатьОбластьПечати(Таб, НомерСтрокиНачало, ОбъектыПечати, Док);
		КонецЦикла;
		ПечатныеФормы.ВывестиТабличныйДокумент(КоллекцияПечатныхФорм, "Ticket",
			НСтр("ru = 'Чек'; fr = 'Ticket';
			|en = 'Receipt'; es = 'Recibo'"),
			Таб, "Документ.ПриходныйКассовыйОрдер.Ticket");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Печать

Процедура ПечатьПриходныйКассовыйОрдер(Док, Таб) Экспорт
	Таб.ТолькоПросмотр = Истина;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ОтображатьСетку = Ложь;
	Таб.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	Таб.АвтоМасштаб = Истина;
	Таб.КлючПараметровПечати = "Параметры_печати_Документ_ПриходныйКассовыйОрдер_ПриходныйКассовыйОрдер";
	КарточкаОрганизации = Справочники.Контрагенты.ПолучитьКарточку(Док.Организация, Док.Дата);
	Валюта = Справочники.Валюты.MoroccanDirham;
	Макет = ПечатныеФормы.МакетПечатнойФормы("Документ.ПриходныйКассовыйОрдер.ПриходныйКассовыйОрдер");	
	оШапка = Макет.ПолучитьОбласть("Шапка");
	оШапка.Параметры.ПредставлениеОрганизации = КарточкаОрганизации.Наименование;
	//оШапка.Параметры.ОрганизацияПоОКПО = КарточкаОрганизации.ОКПО;
	оШапка.Параметры.НомерДокумента = РаботаСДокументами.СформироватьЦифровойНомер(Док.Номер);
	оШапка.Параметры.ДатаДокумента = Формат(Док.Дата, "ДЛФ=DD");
	оШапка.Параметры.КодДебета = "50.01";
	оШапка.Параметры.Сумма = Док.Сумма;
	оШапка.Параметры.СуммаРубКоп = Док.Сумма;
	оШапка.Параметры.СуммаПрописью = Справочники.Валюты.СформироватьСуммуПрописью(Док.Сумма, Валюта, Перечисления.Локализации.fr_CA);
	оШапка.Параметры.ПринятоОт = Док.ПринятоОт;
	оШапка.Параметры.Основание = Док.ОснованиеДляПечати;
	оШапка.Параметры.Приложение = Док.Приложение;
	оШапка.Параметры.ВТомЧисле = Док.ВТомЧислеНДС;
	оШапка.Параметры.ФИОГлавногоБухгалтера = КарточкаОрганизации.ГлавныйБухгалтер.ДляПечати;
	оШапка.Параметры.ФИОКассира = Справочники.ФизическиеЛица.СформироватьПредставлениеДляПечати(Док.Кассир);
	Таб.Вывести(оШапка);
	Таб.ВывестиГоризонтальныйРазделительСтраниц();
КонецПроцедуры

Function ПечатьЧека(Док, Spreadsheet) Export
	Template = ПечатныеФормы.МакетПечатнойФормы("Документ.ПриходныйКассовыйОрдер.Ticket");
	
	Header = Template.GetArea("Шапка");
	
	Header.Parameters.Fill(Док);
	
	FieldPhoto = Док.Организация.Логотип.Get();
	Try
		Header.Drawings[0].Picture = New Picture(FieldPhoto);
	Except
	EndTry;
	
	Header.Parameters.КонтрагентЗаголовок = ?(ЗначениеЗаполнено(Док.Контрагент), НСтр("fr = 'Payeur'; ru = 'Плательщик'; en = 'The payer'; es = 'Pagador'"), "");
	Header.Parameters.Контрагент = ?(ЗначениеЗаполнено(Док.Контрагент), Док.Контрагент, "");

	Spreadsheet.Put(Header);
	
	Spreadsheet.PutHorizontalPageBreak();
	
	Return Spreadsheet;
	
	//}}
EndFunction

#КонецОбласти