
Процедура СформироватьДвижения(ДокОбъект) Экспорт
	Движения = ДокОбъект.Движения;
	Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ВозвратПоставщику") Тогда
		ТипОснования = Тип("ДокументСсылка.ПоступлениеТоваровУслуг");		
	Иначе	
		ТипОснования = Тип("ДокументСсылка.РеализацияТоваровУслуг");
	КонецЕсли;
	ДокОснование = РаботаСДокументами.ПолучитьДокументРодительПоТипу(ТипОснования, ДокОбъект.Основание);
	Для Каждого Стр Из ДокОбъект.ДополнительныеСвойства.ТЗТоварыССериями Цикл 
		НС = Движения.ДвиженияСвязанныхДокументов.Добавить(); 
		НС.Период = ДокОбъект.Дата;
		НС.Основание = ДокОснование;
		НС.ХозяйственнаяОперация = ДокОбъект.ХозяйственнаяОперация;
		ЗаполнитьЗначенияСвойств(НС,Стр);
		НС.Количество = -Стр.Количество;
		НС.Сумма = -Стр.Сумма;
		НС.СуммаНДС = -Стр.СуммаНДС;
		НС.СуммаСНДС = -Стр.СуммаСНДС;
	КонецЦикла;
КонецПроцедуры
