
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; 	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();  
	
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;      		
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;    	
	
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);
	
	ДокументРезультат.Очистить();
	
	// +++ Выводим логотип в шапку отчета

	// Получаем дополнительный макет с описанием вывода логотипа
	МакетЛоготип = ПолучитьМакет("ЛоготипКомпании"); 
	// Получаем область верхнего уровня для сворачивания логотипа
	ОбластьСвернуть = МакетЛоготип.ПолучитьОбласть("СвернутьЛоготип");
	// Получаем область логотипа
	Область = МакетЛоготип.ПолучитьОбласть("Шапка");
	Организация = Настройки.ПараметрыДанных.Элементы.Найти(Новый ПараметрКомпоновкиДанных("Организация")).Значение;
	Контрагент = Настройки.ПараметрыДанных.Элементы.Найти(Новый ПараметрКомпоновкиДанных("Контрагент")).Значение;
	КарточкаОрганизации = Справочники.Контрагенты.ПолучитьКарточку(Организация,ТекущаяДатаСеанса());
	Область.Параметры.Организация = Организация;
	Область.Параметры.Адрес = КарточкаОрганизации.АдресЮридический;
	Область.Параметры.Контрагент = Контрагент;
	
	ДокументРезультат.НачатьАвтогруппировкуСтрок();   //Начало группировки строк
	//ДокументРезультат.Вывести(ОбластьСвернуть, 1);    // Вывод строки группировки на 1 уровне
	ДокументРезультат.Вывести(Область,         1);    // Вывод логотипа на втором уровне группировки
	ДокументРезультат.ЗакончитьАвтогруппировкуСтрок();//Завершение группировки строк
	
	// --- Выводим логотип в шапку отчета

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;	
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);		
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
КонецПроцедуры

