
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НадписьПриветствие = НСтр("fr = 'Bienvenu au espace client!'; ru = 'Добро пожаловать в личный кабинет!'; en = 'Welcome to your personal account!'; es = 'Bienvenido a su cuenta personal!'");
    Польз = ПараметрыСеанса.Пользователь;

КонецПроцедуры

// +GAN  29/10/2025  Временная кнопка
&НаКлиенте
Процедура КомандаВойти(Команда)
	ЭтаФорма.Закрыть("ОК");
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Логин", ИмяПользователя());
	ОткрытьФорму("Обработка.ЛичныйКабинетПартнера.Форма.ФормаНоменклатура",ПараметрыФормы,Этаформа,,,,,РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры


&НаКлиенте
Процедура Команда1(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры
// -GAN  29/10/2025  
