
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗагрузитьДанныеДокумента(Объект.Ссылка.Пустая(), Ложь);
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, Объект, СокрЛП(Объект.ХозяйственнаяОперация));
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОперацииСПодключаемымОборудованиемКлиент.ПодключитьОборудование(УникальныйИдентификатор, Истина); 
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//Если Не ТоварныйСоставСоответствуетТоварнойГруппе() Тогда
	//	ПоказатьПредупреждение(, Нстр("fr = 'La composition des marchandises ne correspond pas au groupe de produits'; ru = 'Товарный состав не соответствует товарной группе'; en = 'The product composition does not correspond to the product group'; es = 'La composición de los productos no corresponde al grupo de productos'"),, "Ошибка");
	//	Отказ = Истина;
	//КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, ТекущийОбъект, СокрЛП(Объект.ХозяйственнаяОперация));
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы 

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ЗагрузитьДанныеДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТипЦенПриИзменении(Элемент)
	ЗагрузитьДанныеДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварнаяГруппаПриИзменении(Элемент)
	ЗагрузитьДанныеДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварнаяГруппаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//Если ЕстьВведённыеЦены() Тогда
	//	СтандартнаяОбработка = Ложь;
	//	Оп = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОСменеТоварнойГруппы", ЭтотОбъект, СтандартнаяОбработка);
	//	ПоказатьВопрос(Оп, "При смене товарной группы внесённые цены будут удалены. Продолжить?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет, "Внимание");
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидОтображенияПриИзменении(Элемент)
	ЗагрузитьДанныеДокумента();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНаценкуОтСтаройЦены(Команда)
	Оп = Новый ОписаниеОповещения("ПослеВводаНаценки", ЭтотОбъект, 3);
	ПоказатьВводЧисла(Оп, 0, "Введите % наценки", 3, 0);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНаценкуОтЗакупочнойЦены(Команда)
	Оп = Новый ОписаниеОповещения("ПослеВводаНаценки", ЭтотОбъект, 4);
	ПоказатьВводЧисла(Оп, 0, "Введите % наценки", 3, 0);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНаценкуОтРозничнойЦены(Команда)
	Оп = Новый ОписаниеОповещения("ПослеВводаНаценки", ЭтотОбъект, 5);
	ПоказатьВводЧисла(Оп, 0, "Введите % наценки", 3, 0);
КонецПроцедуры

&НаКлиенте
Процедура ТЧЦеныВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
КонецПроцедуры

&НаКлиенте
Процедура ТЧЦеныНоменклатураПриИзменении(Элемент)
	ЗагрузитьДанныеДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТЧЦеныНоменклатураАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	РаботаСДокументамиКлиент.АвтоподборНоменклатуры(ДанныеВыбора, ПараметрыПолученияДанных, Объект, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ТЧЦеныНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	РаботаСДокументамиКлиент.ОбрабокаВыбораПриАвтоподбореНоменклатуры(Элементы.ТЧЦены.ТекущиеДанные, ВыбранноеЗначение, Объект, СтандартнаяОбработка);
	ЗагрузитьДанныеДокумента();
КонецПроцедуры

#КонецОбласти 

#Область Оповещения

&НаКлиенте
Процедура ПослеВводаНаценки(Наценка, ОсноваНаценки) Экспорт
	Если Наценка = Неопределено Тогда Возврат КонецЕсли;
	Для Каждого Идентификатор Из Элементы.ТЧЦены.ВыделенныеСтроки Цикл
		ТекСтр = Объект.ТЧЦены.НайтиПоИдентификатору(Идентификатор);
		Если ОсноваНаценки = 1 Тогда
			ТекСтр.Цена = ВычисленияКлиентСервер.ДобавитьПроцент(ТекСтр.ЦенаБазовая, Наценка);	
		ИначеЕсли ОсноваНаценки = 2 Тогда
			ТекСтр.Цена = ВычисленияКлиентСервер.ДобавитьПроцент(ТекСтр.ЦенаРекомендованная, Наценка);	
		ИначеЕсли ОсноваНаценки = 3 Тогда
			ТекСтр.Цена = ВычисленияКлиентСервер.ДобавитьПроцент(ТекСтр.ЦенаСтарая, Наценка);
		ИначеЕсли ОсноваНаценки = 4 Тогда
			ТекСтр.Цена = ВычисленияКлиентСервер.ДобавитьПроцент(ТекСтр.ЦенаЗакупочная, Наценка);	
		ИначеЕсли ОсноваНаценки = 5 Тогда
			ТекСтр.Цена = ВычисленияКлиентСервер.ДобавитьПроцент(ТекСтр.ЦенаРозничная, Наценка);
			Если ТекСтр.Цена <= ТекСтр.ЦенаЗакупочная Тогда 
				ТекСтр.Цена = 0;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОСменеТоварнойГруппы(РезультатВопроса, СтандартнаяОбработка) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда Возврат КонецЕсли;
	СтандартнаяОбработка = Истина;
КонецПроцедуры	

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ScanData" и ВводДоступен() Тогда 
		Штрихкод = ОперацииСПодключаемымОборудованиемКлиент.ПолучитьШтрихкод(ИмяСобытия, Параметр, Источник);
		СтруктураТОвара = ОбщегоНазначенияВызовСервера.ПолучитьНоменклатуруПоШтрихкоду(Штрихкод);
		Если СтруктураТОвара = Неопределено Тогда
			Оп = Новый ОписаниеОповещения("ПослеДобавленияНоменклатуры",ЭтаФорма,Новый Структура("Штрихкод",Штрихкод));
			ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента",Новый Структура("Штрихкод",Штрихкод),ЭтаФорма,,,,Оп,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Иначе
			РаботаСДокументамиКлиентСервер.ДобавитьНоменклатуруПоШтрихкоду(Штрихкод, Объект, СтруктураТОвара,"ТЧЦены",,ЭтаФорма);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область Дополнительно

&НаСервере
Процедура ЗагрузитьДанныеДокумента(ОбновитьЦены = Ложь, ЗаполнитьДерево = Ложь)
	УстановитьПривилегированныйРежим(Истина);
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ЦеныНоменклатурыСрезПоследних.Период КАК Период,
	               |	ЦеныНоменклатурыСрезПоследних.ВидЦены КАК ВидЦены,
	               |	ЦеныНоменклатурыСрезПоследних.ТоварнаяГруппа КАК ТоварнаяГруппа,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	               |	ЦеныНоменклатурыСрезПоследних.Характеристика КАК Характеристика,
	               |	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	               |ПОМЕСТИТЬ ВТЦеныПоследние
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	               |			&ДатаЦен,
	               |			Регистратор <> &ЭтотДокумент
	               |				И ВидЦены В (&ВидЦены, ЗНАЧЕНИЕ(Справочник.ВидыЦен.Розничная))) КАК ЦеныНоменклатурыСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЦеныНоменклатурыПоставщиковСрезПоследних.Период КАК Период,
	               |	ЦеныНоменклатурыПоставщиковСрезПоследних.Номенклатура КАК Номенклатура,
	               |	ЦеныНоменклатурыПоставщиковСрезПоследних.Характеристика КАК Характеристика,
	               |	ЦеныНоменклатурыПоставщиковСрезПоследних.ЦенаЕдиницыХранения КАК Цена
	               |ПОМЕСТИТЬ ВТЦеныПоставщиков
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатурыПоставщиков.СрезПоследних(&ДатаЦен, ) КАК ЦеныНоменклатурыПоставщиковСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ЦНП.Номенклатура КАК Номенклатура,
	               |			ЦНП.Характеристика КАК Характеристика,
	               |			МАКСИМУМ(ЦНП.Период) КАК Период
	               |		ИЗ
	               |			РегистрСведений.ЦеныНоменклатурыПоставщиков КАК ЦНП
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ЦНП.Номенклатура,
	               |			ЦНП.Характеристика) КАК ЦеныНоменклатурыПоставщиков
	               |		ПО ЦеныНоменклатурыПоставщиковСрезПоследних.Номенклатура = ЦеныНоменклатурыПоставщиков.Номенклатура
	               |			И ЦеныНоменклатурыПоставщиковСрезПоследних.Характеристика = ЦеныНоменклатурыПоставщиков.Характеристика
	               |			И ЦеныНоменклатурыПоставщиковСрезПоследних.Период = ЦеныНоменклатурыПоставщиков.Период
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТЦеныПрайс.Номенклатура КАК Номенклатура,
	               |	ВТЦеныПрайс.Характеристика КАК Характеристика,
	               |	СУММА(ВЫБОР
	               |			КОГДА ВТЦеныПрайс.ВидЦены = &ВидЦены
	               |				ТОГДА ВТЦеныПрайс.Цена
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК ЦенаСтарая,
	               |	СУММА(ВЫБОР
	               |			КОГДА ВТЦеныПрайс.ВидЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.Розничная)
	               |				ТОГДА ВТЦеныПрайс.Цена
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК ЦенаРозничная
	               |ПОМЕСТИТЬ ВТЦеныПрайс
	               |ИЗ
	               |	ВТЦеныПоследние КАК ВТЦеныПрайс
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТЦеныПрайс.Номенклатура,
	               |	ВТЦеныПрайс.Характеристика
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЫРАЗИТЬ(ТЗБазовыеЦены.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	               |	ВЫРАЗИТЬ(ТЗБазовыеЦены.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
	               |	ВЫРАЗИТЬ(ТЗБазовыеЦены.ЗакупочнаяЦена КАК ЧИСЛО) КАК ЗакупочнаяЦена,
	               |	ВЫРАЗИТЬ(ТЗБазовыеЦены.Цена КАК ЧИСЛО) КАК Цена
	               |ПОМЕСТИТЬ ВТБазовыеЦены
	               |ИЗ
	               |	&ТЗБазовыеЦены КАК ТЗБазовыеЦены
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Номенклатура.Ссылка КАК Номенклатура
	               |ПОМЕСТИТЬ ВТНоменклатура
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	НЕ Номенклатура.ЭтоГруппа
	               |	И НЕ Номенклатура.ПометкаУдаления
	               |	И ВЫБОР
	               |			КОГДА &ТоварнаяГруппа = ЗНАЧЕНИЕ(Справочник.ТоварныеГруппы.ПустаяСсылка)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ Номенклатура.ТоварнаяГруппа = &ТоварнаяГруппа
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &Категория = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ Номенклатура.Ссылка В ИЕРАРХИИ (&Категория)
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЗ.Номенклатура КАК Номенклатура,
	               |	ВЗ.Характеристика КАК Характеристика,
	               |	ВЗ.Номенклатура.ЭтоГруппа КАК ЭтоГруппа,
	               |	ЕСТЬNULL(ВТЦеныПоставщиков.Цена, 0) КАК ЦенаЗакупочная,
	               |	ЕСТЬNULL(ВТЦеныПрайс.ЦенаСтарая, 0) КАК ЦенаСтарая,
	               |	ЕСТЬNULL(ВТЦеныПрайс.ЦенаРозничная, 0) КАК ЦенаРозничная,
	               |	ЕСТЬNULL(ВТБазовыеЦены.Цена, 0) КАК Цена,
	               |	ЕСТЬNULL(ВТБазовыеЦены.Цена, 0) <> 0 КАК ЦенаУстановлена
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВТНоменклатура.Номенклатура КАК Номенклатура,
	               |		ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика
	               |	ИЗ
	               |		ВТНоменклатура КАК ВТНоменклатура
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ВТНоменклатура.Номенклатура,
	               |		ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
	               |	ИЗ
	               |		ВТНоменклатура КАК ВТНоменклатура
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	               |			ПО ВТНоменклатура.Номенклатура = ХарактеристикиНоменклатуры.Владелец
	               |				И (НЕ ХарактеристикиНоменклатуры.ПометкаУдаления)
	               |				И (НЕ ХарактеристикиНоменклатуры.ДляВнутреннегоИспользования)
	               |				И (ИСТИНА В
	               |					(ВЫБРАТЬ
	               |						Константы.ИспользоватьХарактеристикиНоменклатуры
	               |					ИЗ
	               |						Константы КАК Константы))) КАК ВЗ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазовыеЦены КАК ВТБазовыеЦены
	               |		ПО ВЗ.Номенклатура = ВТБазовыеЦены.Номенклатура
	               |			И ВЗ.Характеристика = ВТБазовыеЦены.Характеристика
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТЦеныПоставщиков КАК ВТЦеныПоставщиков
	               |		ПО ВЗ.Номенклатура = ВТЦеныПоставщиков.Номенклатура
	               |			И ВЗ.Характеристика = ВТЦеныПоставщиков.Характеристика
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТЦеныПрайс КАК ВТЦеныПрайс
	               |		ПО ВЗ.Номенклатура = ВТЦеныПрайс.Номенклатура
	               |			И ВЗ.Характеристика = ВТЦеныПрайс.Характеристика
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВЗ.Номенклатура.Наименование";
	ТекстЗапроса = ТекстЗапроса + "						  
	               |АВТОУПОРЯДОЧИВАНИЕ";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ТЗЦены", Объект.ТЧЦены.Выгрузить());
	ЦенаВключаетНДС = ОбщегоНазначенияВызовСервера.ЦенаВключаетНДСПоВидуЦен(Объект.ВидЦены);
	ТЗБазовыеЦены = РегистрыСведений.ПравилаЦенообразования.СформироватьБазовыеЦены(Объект.Дата, ЦенаВключаетНДС);
	Запрос.УстановитьПараметр("ТЗБазовыеЦены", ТЗБазовыеЦены);
	Запрос.УстановитьПараметр("ЭтотДокумент", Объект.Ссылка);
	Запрос.УстановитьПараметр("ДатаЦен", Объект.Дата);
	Запрос.УстановитьПараметр("ВидЦены", Объект.ВидЦены);
	Запрос.УстановитьПараметр("ТоварнаяГруппа", Объект.ТоварнаяГруппа);	
	Запрос.УстановитьПараметр("Категория", Объект.Категория);	
	ТЗ = Запрос.Выполнить().Выгрузить();
	Если ЗаполнитьДерево Тогда
		Объект.ТЧЦены.Загрузить(ТЗ);
	Иначе
		Для Каждого Стр Из Объект.ТЧЦены Цикл
			Стр.ЦенаСтарая = 0;
			Мас = ТЗ.НайтиСтроки(Новый Структура("Номенклатура, Характеристика", Стр.Номенклатура, Стр.Характеристика));
			Если Мас.Количество() > 0 Тогда  
				//ЗаполнитьЗначенияСвойств(Стр, Мас[0], "ЦенаЗакупочная");
				Стр.ЦенаЗакупочная = Мас[0].ЦенаЗакупочная;
				Стр.ЦенаРозничная = Мас[0].ЦенаРозничная;
				Стр.ЦенаСтарая = Мас[0].ЦенаСтарая;
				Если ОбновитьЦены Тогда
					Стр.Цена = Мас[0].Цена;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗагрузитьДанныеДокумента(Истина,Истина);
КонецПроцедуры

&НаСервере
Функция ТоварныйСоставСоответствуетТоварнойГруппе()
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Номенклатура.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.Номенклатура КАК Номенклатура
	                      |ГДЕ
	                      |	Номенклатура.Ссылка В(&Номенклатура)
	                      |	И Номенклатура.ТоварнаяГруппа <> &ТоварнаяГруппа");
	Запрос.УстановитьПараметр("Номенклатура", Объект.ТЧЦены.Выгрузить().ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("ТоварнаяГруппа", Объект.ТоварнаяГруппа);
	Рез = Запрос.Выполнить();
	Возврат Рез.Пустой();	
КонецФункции	

#КонецОбласти
