
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РаботаСДокументами.МожноРедактироватьДокументВФорме(Объект.Ссылка, ЭтаФорма);
	УстановитьПривилегированныйРежим(Истина);
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыФункциональныхОпций(ЭтаФорма);
	ДСОбсуждение.Параметры.УстановитьЗначениеПараметра("Владелец", Объект.Ссылка);
	УстановитьВидЦеныПоДоговору();	
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, Объект);
	ЕстьПравоЗаверениеЦен = РегистрыСведений.НастройкиПользователей.ЗаверениеЦен(); 
	Элементы.ДекорацияСтатусаЗаказа.Заголовок = Строка(РаботаСДокументамиВызовСервера.ПолучитьСтатусЗаказПокупателя(Объект.Ссылка));  
	Элементы.МенеджерПодтвердилПроверилОстаток.Доступность = НЕ объект.МенеджерПодтвердилПроверилОстаток;
	НастроитьФорму(); 
	ЗаполнитьСуммыОплатыДолга();
	ЗаполнитьОстаткиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОперацииСПодключаемымОборудованиемКлиент.ПодключитьОборудование(УникальныйИдентификатор, Истина); 
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить(РаботаСДокументами.СвойствоЗаписьИзФормы(), Истина);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)	
    РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, ТекущийОбъект);
	ЗаполнитьОстаткиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Отказ = РаботаСДокументамиКлиент.КлиентуЗапрещеноОтгружать(Объект);
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура ЦенаВключаетНДСПриИзменении(Элемент)
	ПересчитатьСтрокиПоРежимуНДС();
КонецПроцедуры

&НаКлиенте
Процедура ДатаОтгрузкиПриИзменении(Элемент)
	//РаботаСДокументамиКлиент.ЗаполнитьДанныеПоТорговойТочке(Объект, ВидЦены, Элементы.ТЧТоварыВидЦены);	
	//УстановитьЦеныНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	РаботаСДокументамиКлиент.ЗаполнитьДанныеПоТорговойТочке(Объект, ВидЦены, Элементы.ТЧТоварыВидЦены);	
	//УстановитьЦеныНаСервере();
	УстановитьВидЦеныПоДоговору();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Объект.Договор = ОбщегоНазначенияВызовСервера.ПолучитьОсновнойДоговор(Объект.Контрагент, Объект.Организация, Истина);
	Объект.Менеджер = РаботаСДокументамиВызовСервера.ПолучитьКуратораДоговора(Объект.Договор, Объект.Дата).Менеджер;
	УстановитьВидЦеныПоДоговору();
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	Объект.Менеджер = РаботаСДокументамиВызовСервера.ПолучитьКуратораДоговора(Объект.Договор, Объект.Дата).Менеджер;
	УстановитьВидЦеныПоДоговору();
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекСтр = Элемент.ТекущиеДанные;
		ТекСтр.КодСтроки = РаботаСДокументамиКлиентСервер.ПолучитьСледующийКодСтроки(Объект.ТЧТовары);
		ТекСтр.ВидЦены = ВидЦены;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	РаботаСДокументамиКлиент.ПроверитьКратностьЕдиницы(Элемент.ТекущиеДанные, Объект, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПриАктивизацииЯчейки(Элемент)
	ТекСтр = Элемент.ТекущиеДанные;
	Если ТекСтр = Неопределено Тогда Возврат КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ПараметрыАвтоподбора = РаботаСДокументамиКлиент.ПараметрыАвтободбораНоменклатуры();
	ПараметрыАвтоподбора.ВидЦены = ВидЦены;
	ПараметрыАвтоподбора.ИсключитьХарактеристикиДляВнутреннегоИспользования = Истина;
	РаботаСДокументамиКлиент.АвтоподборНоменклатуры(ДанныеВыбора, ПараметрыПолученияДанных, Объект, СтандартнаяОбработка, ПараметрыАвтоподбора);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	РаботаСДокументамиКлиент.ОбрабокаВыбораПриАвтоподбореНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, ВыбранноеЗначение, Объект, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыХарактеристикаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьЦенуНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыУпаковкаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьЦенуНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыКоличествоУпаковокПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыВидЦеныПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьЦенуНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект);	
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыЦенаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС, "Цена");
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСуммаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС, "Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПроцентСкидкиПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСуммаСкидкиПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС, "Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСкидкаНаЦенуПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС, "Цена");
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСтавкаНДСПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСуммаНДСПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС);
КонецПроцедуры

&НаКлиенте
Процедура ДСОбсуждениеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКомментарий(Команда)
	РаботаСДокументамиКлиент.ЗаписатьЕслиНовый(ЭтаФорма);
	РаботаСДокументамиКлиент.ДобавитьКомментарий(Объект.Ссылка, ПолучитьАдресатаОбсуждения());
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьЦены(Команда)
	УстановитьЦеныНаСервере();
КонецПроцедуры

#КонецОбласти

#Область Дополнительно
	
&НаСервере
Процедура УстановитьЦеныНаСервере()
	РаботаСДокументами.УстановитьЦеныВТабличнойЧасти(Объект.ТЧТовары, ВидЦены, Объект.ДатаОтгрузки);		
КонецПроцедуры 

&НаСервере
Функция ПолучитьАдресатаОбсуждения()
	УстановитьПривилегированныйРежим(Истина);
	Возврат Справочники.Пользователи.ПолучитьПоСотруднику(Объект.Менеджер);	
КонецФункции	

&НаСервере
Процедура УстановитьВидЦеныПоДоговору()
	//ВидЦены = ?(ЗначениеЗаполнено(Объект.Договор.ВидЦены),Объект.Договор.ВидЦены, Справочники.ВидыЦен.Розничная);
	ВидЦены = ?(ЗначениеЗаполнено(Объект.Контрагент.ТипЦены),Объект.Контрагент.ТипЦены, Справочники.ВидыЦен.Розничная);
	РаботаСДокументамиКлиентСервер.ЗаполнитьСписокВыбораВидовЦен(ВидЦены, Элементы.ТЧТоварыВидЦены);
	Объект.ЦенаВключаетНДС = ОбщегоНазначенияВызовСервера.ЦенаВключаетНДСПоВидуЦен(ВидЦены);
КонецПроцедуры

&НаСервере
Процедура НастроитьФорму()
	Элементы.ТЧТоварыВидЦены.ТолькоПросмотр = Не ЕстьПравоЗаверениеЦен;
	Элементы.ТЧТоварыЦена.ТолькоПросмотр = Не ЕстьПравоЗаверениеЦен;
	Элементы.ТЧТоварыСумма.ТолькоПросмотр = Не ЕстьПравоЗаверениеЦен;
	Элементы.ТЧТоварыПроцентСкидки.ТолькоПросмотр = Не ЕстьПравоЗаверениеЦен;
	Элементы.ТЧТоварыСуммаСкидки.ТолькоПросмотр = Не ЕстьПравоЗаверениеЦен;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСуммыОплатыДолга()    
	
		СуммаДолга = "0,00";        
		СуммаОплаты  = "0,00"; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВзаиморасчётыСПокупателями.ОбъектРасчётов КАК ОбъектРасчётов,
	|	ВзаиморасчётыСПокупателями.Сумма КАК Сумма
	|ИЗ
	|	РегистрНакопления.ВзаиморасчётыСПокупателями КАК ВзаиморасчётыСПокупателями
	|ГДЕ
	|	ВзаиморасчётыСПокупателями.ОбъектРасчётов.Основание = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",объект.Ссылка);  
	
	Выборка = Запрос.Выполнить().Выгрузить();
	
	Если Выборка.Количество() = 0 Тогда иначе
	
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВзаиморасчётыСПокупателямиОстатки.ОбъектРасчётов КАК ОбъектРасчётов,
		               |	ВзаиморасчётыСПокупателямиОстатки.СуммаОстаток КАК Сумма
		               |ИЗ
		               |	РегистрНакопления.ВзаиморасчётыСПокупателями.Остатки(, ОбъектРасчётов.Основание = &Ссылка) КАК ВзаиморасчётыСПокупателямиОстатки";
		Запрос.УстановитьПараметр("Ссылка",объект.Ссылка);  
	
		Выборка = Запрос.Выполнить().Выгрузить();
	
		СуммаДолга = Строка(Выборка.Итог("Сумма"));        
		СуммаОплаты  = Строка(объект.Сумма - Выборка.Итог("Сумма")); 
	КонецЕсли; 
	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьОстаткиНаСервере()
	// У заказа нет склада: остаток по складу пользователя
	МестоХранения = РегистрыСведений.НастройкиПользователей.СкладПользователя();
	РегистрыНакопления.ТоварыВНаличии.ЗаполнитьОстаткиСтрок(Объект.ТЧТовары, МестоХранения);
КонецПроцедуры

#КонецОбласти

#Область Оповещения

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ScanData" и ВводДоступен() Тогда 
		Штрихкод = ОперацииСПодключаемымОборудованиемКлиент.ПолучитьШтрихкод(ИмяСобытия, Параметр, Источник);
		СтруктураТОвара = ОбщегоНазначенияВызовСервера.ПолучитьНоменклатуруПоШтрихкоду(Штрихкод, Ложь);
		Если СтруктураТОвара = Неопределено Тогда
			Оп = Новый ОписаниеОповещения("ПослеДобавленияНоменклатуры",ЭтаФорма,Новый Структура("Штрихкод",Штрихкод));
			ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента",Новый Структура("Штрихкод",Штрихкод),ЭтаФорма,,,,Оп,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Иначе
			РаботаСДокументамиКлиентСервер.ДобавитьНоменклатуруПоШтрихкоду(Штрихкод, Объект, СтруктураТОвара,, ВидЦены,ЭтаФорма);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтрокиПоРежимуНДС()
	Для Каждого Стр Из Объект.ТЧТовары Цикл
		РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Стр, Объект.ЦенаВключаетНДС);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
