
Функция ПолучитьПоСотруднику(Сотрудник) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Пользователи.Ссылка КАК Пользователь
	                      |ИЗ
	                      |	Справочник.Пользователи КАК Пользователи
	                      |ГДЕ
	                      |	Пользователи.ФизическоеЛицо = &Сотрудник");
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Рез = Запрос.Выполнить();
	Возврат ?(Рез.Пустой(), Неопределено, Рез.Выгрузить()[0].Пользователь);
КонецФункции

Функция СформироватьСписокРолей(ПользовательИБ) Экспорт
	СписокРолей = "";
	Для Каждого Роль Из ПользовательИБ.Роли Цикл
		ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(СписокРолей, Роль.Синоним, ", ");
	КонецЦикла;
	Возврат СписокРолей;	
КонецФункции	
	
	