
Процедура ПриКопировании(ОбъектКопирования)
	ИдентификаторПользователяИБ = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ЗначениеЗаполнено(ЭтотОбъект.Контрагент) Тогда       
		СпрКонтра = ЭтотОбъект.Контрагент.Ссылка.ПолучитьОбъект();       
		СпрКонтра.ОбменДанными.Загрузка = Истина;
		СпрКонтра.ЛичныйКабинетПартнера = ЭтотОбъект.ВходВПрограммуРазрешен;   
		СпрКонтра.Логин = "";
		СпрКонтра.Пароль = "";		
		
		Попытка
			СпрКонтра.Записать();
		Исключение
			Отказ = Истина; 
			Возврат;
		КонецПопытки;
	КонецЕсли;	
КонецПроцедуры








