
#Область Обработчики_элементов_формы

&НаКлиенте
Процедура РезультатПриАктивизации(Элемент)
	ПодключитьОбработчикОжидания("РассчитатьПоказателиДинамически", 0.2, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ВычислитьВыделенные(Команда)
	РассчитатьПоказателиДинамически();
КонецПроцедуры

#КонецОбласти

#Область Дополнительно

&НаКлиенте
Процедура РассчитатьПоказателиДинамически()
	ТекущаяКоманда = ""; //сумма, среднее, макс, мин...
	ОбщегоНазначенияКлиентСервер.РассчитатьПоказатели(ЭтотОбъект, "Результат", "ФормаВычислитьВыделенные", ТекущаяКоманда, 2);
КонецПроцедуры

#КонецОбласти


