
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	РаботаСДокументами.ЗаполнитьРеквизитыПоУмолчанию(ЭтотОбъект);
	Дата = ТекущаяДатаСеанса();
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	УстановитьПривилегированныйРежим(Истина);
	РаботаСДокументами.УстановитьЗаписьВсехРегистров(Движения);
	Для Каждого Стр Из ТЧТабель Цикл
		РабочийДеньЧасов = Стр.ГрафикРаботы.РабочийДеньЧасов;
		ТекДата = НачалоМесяца(ЭтотОбъект.Дата);
		КонецПериода = КонецМесяца(ЭтотОбъект.Дата);
		Пока ТекДата < КонецПериода Цикл
			НомерДня = День(ТекДата);
			ОтработаноЧасов = Стр["_" + НомерДня];			
			Вариант = Стр["_" + НомерДня + "_Вариант"];
			Если ОтработаноЧасов <> 0 Или Вариант = Справочники.ВариантыВыходаНаРаботу.Рабочий Тогда 			
				НС = Движения.ОтработанноеВремяСотрудников.Добавить();
				НС.ДатаВыхода = ТекДата;
				НС.Сотрудник = Стр.Сотрудник;
				НС.План = РабочийДеньЧасов;
				НС.Факт = ОтработаноЧасов;
				НС.Вариант = Вариант;
			КонецЕсли;
			ТекДата = РаботаСДокументамиКлиентСервер.ДобавитьДень(ТекДата, 1);
		КонецЦикла;
	КонецЦикла;
	Движения.Записать();
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = ПараметрыСеанса.Пользователь;
КонецПроцедуры


