
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("ОбъектМетаданных", КорневойОбъектМетаданных);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СформироватьСтруктуруПодчиненности();
	// Разворачиваем дерево
	ЭлементыДерева = ДЗСтруктураПодчиненности.ПолучитьЭлементы();
	Для Каждого Элемент Из ЭлементыДерева Цикл
		Элементы.ДЗ.Развернуть(Элемент.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура ДЗВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(, Элемент.ДанныеСтроки(ВыбраннаяСтрока).Ссылка); 
КонецПроцедуры

&НаКлиенте
Процедура Провести(Команда)
	ТекСтр = Элементы.ДЗ.ТекущиеДанные;
	Если ТекСтр = Неопределено Тогда Возврат; КонецЕсли;
	ОбработатьКомандуНаСервере(ТекСтр.Ссылка,РежимЗаписиДокумента.Проведение);
	ТекСтр.ИдентификаторКартинки = ПолучитьИдентификаторКартинки(ТекСтр.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ОтменаПроведения(Команда)
	ТекСтр = Элементы.ДЗ.ТекущиеДанные;
	Если ТекСтр = Неопределено Тогда Возврат; КонецЕсли;
	ОбработатьКомандуНаСервере(ТекСтр.Ссылка,РежимЗаписиДокумента.ОтменаПроведения);
	ТекСтр.ИдентификаторКартинки = ПолучитьИдентификаторКартинки(ТекСтр.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПометкаУдаления(Команда)
	ТекСтр = Элементы.ДЗ.ТекущиеДанные;
	Если ТекСтр = Неопределено Тогда Возврат; КонецЕсли;
	ОбработатьКомандуНаСервере(ТекСтр.Ссылка,,Истина);
	ТекСтр.ИдентификаторКартинки = ПолучитьИдентификаторКартинки(ТекСтр.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ДЗПриАктивизацииСтроки(Элемент)
	ТекСтр = Элементы.ДЗ.ТекущиеДанные;
	Если ТекСтр = Неопределено Тогда Возврат; КонецЕсли;
	УстановитьДоступностьКонтекстногоМеню(ТекСтр.Ссылка);
КонецПроцедуры

#КонецОбласти

#Область Дополнительно

&НаСервере
Процедура СформироватьСтруктуруПодчиненности()
	// Получаем список реквизитов связи
	СформироватьТаблицуРеквизитовСвязи();
	// Получим всех первых родителей
	МасПервыеРодители = Новый Массив;
	ПолучитьПервыхРодителей(КорневойОбъектМетаданных, МасПервыеРодители);
	// Формируем структуру
	ДЗ = РеквизитФормыВЗначение("ДЗСтруктураПодчиненности", Тип("ДеревоЗначений"));
	ДЗ.Строки.Очистить();
	Для Каждого Стр Из МасПервыеРодители Цикл		
		НС = ДЗ.Строки.Добавить();
		НС.Ссылка = Стр;
		НС.ИдентификаторКартинки = ПолучитьИдентификаторКартинки(НС.Ссылка);
		ВывестиПодчиненные(НС);
	КонецЦикла;
	ЗначениеВРеквизитФормы(ДЗ, "ДЗСтруктураПодчиненности");	
КонецПроцедуры	

&НаСервере
Процедура ПолучитьПервыхРодителей(ОбъектМетаданных, МасПервыеРодители)
	МасОснования = Новый Массив; // Список оснований документа
	МасРеквизитыОснований = ТЗРеквизитыСвязи.НайтиСтроки(Новый Структура("ИмяОбъекта", ОбъектМетаданных.Метаданные().Имя));
	// Получаем основания документа
	Для Каждого Стр Из МасРеквизитыОснований Цикл
		Если Стр.РодительРеквизита = "Реквизит" Тогда // Реквизит формы
			Если ЗначениеЗаполнено(ОбъектМетаданных[Стр.Реквизит]) Тогда
				МасОснования.Добавить(ОбъектМетаданных[Стр.Реквизит]);	
			КонецЕсли;
		Иначе // Реквизит табличной части	
			Для Каждого ТЧСтр Из ОбъектМетаданных[Стр.РодительРеквизита] Цикл
				Если ЗначениеЗаполнено(ТЧСтр[Стр.Реквизит]) Тогда
					МасОснования.Добавить(ТЧСтр[Стр.Реквизит]);
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;
	КонецЦикла;
	// Получаем родителей
	Если МасРеквизитыОснований.Количество() = 0 Или МасОснования.Количество() = 0 Тогда // Нет родителей, или родители не заполнены, пишем в родители сам документ
		Если МасПервыеРодители.Найти(ОбъектМетаданных) = Неопределено Тогда 
			МасПервыеРодители.Добавить(ОбъектМетаданных);
		КонецЕсли;	
	Иначе // Есть родители, смотрим их основания	
		Для Каждого Стр Из МасОснования Цикл
			ПолучитьПервыхРодителей(Стр, МасПервыеРодители);	
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВывестиПодчиненные(ДЗСтрока)
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	СвязанныеДокументы.Ссылка
	                      |ИЗ
	                      |	КритерийОтбора.СвязанныеДокументы(&ОбъектМетаданных) КАК СвязанныеДокументы");
	Запрос.УстановитьПараметр("ОбъектМетаданных", ДЗСтрока.Ссылка);
	Выб = Запрос.Выполнить().Выбрать();
	Пока Выб.Следующий() Цикл
		НС = ДЗСтрока.Строки.Добавить();
		НС.Ссылка = Выб.Ссылка;
		НС.ИдентификаторКартинки = ПолучитьИдентификаторКартинки(НС.Ссылка);
		ВывестиПодчиненные(НС);
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Функция ПолучитьИдентификаторКартинки(ОбъектМетаданных)
	Если Метаданные.Справочники.Найти(ОбъектМетаданных.Метаданные().Имя) <> Неопределено Тогда
		Возврат ?(ОбъектМетаданных.ПометкаУдаления, 4, 3);
	ИначеЕсли Метаданные.БизнесПроцессы.Найти(ОбъектМетаданных.Метаданные().Имя) <> Неопределено Тогда
		Возврат ?(ОбъектМетаданных.ПометкаУдаления, 6, 5);
	ИначеЕсли Метаданные.Документы.Найти(ОбъектМетаданных.Метаданные().Имя) <> Неопределено Тогда
		Возврат ?(ОбъектМетаданных.Проведен, 0, ?(ОбъектМетаданных.ПометкаУдаления, 1, 2));
	Иначе	
		Возврат 0;
	КонецЕсли;
КонецФункции	

&НаСервере
Процедура СформироватьТаблицуРеквизитовСвязи()
	ТЗРеквизитыСвязи.Очистить();
	Для Каждого Стр Из Метаданные.КритерииОтбора.СвязанныеДокументы.Состав Цикл
		ПолноеИмя = Стр.ПолноеИмя();
		НС = ТЗРеквизитыСвязи.Добавить();
		НС.Реквизит = Стр.Имя;
		// Тип объекта
		Сим = СтрНайти(ПолноеИмя, ".");		
		НС.ТипОбъекта = Лев(ПолноеИмя, Сим - 1);
		ПолноеИмя = Сред(ПолноеИмя, Сим + 1, СтрДлина(ПолноеИмя));
		// Имя объекта
		Сим = СтрНайти(ПолноеИмя, ".");		
		НС.ИмяОбъекта = Лев(ПолноеИмя, Сим - 1);
		ПолноеИмя = Сред(ПолноеИмя, Сим + 1, СтрДлина(ПолноеИмя));
		// Родитель реквизита
		Сим = СтрНайти(ПолноеИмя, ".");		
		НС.РодительРеквизита = Лев(ПолноеИмя, Сим - 1);
		ПолноеИмя = Сред(ПолноеИмя, Сим + 1, СтрДлина(ПолноеИмя));
		Если НС.РодительРеквизита = "ТабличнаяЧасть" Тогда // В родитель записываем имя табличной части
			Сим = СтрНайти(ПолноеИмя, ".");		
			НС.РодительРеквизита = Лев(ПолноеИмя, Сим - 1);
			ПолноеИмя = Сред(ПолноеИмя, Сим + 1, СтрДлина(ПолноеИмя));	
		КонецЕсли;	
	КонецЦикла;		
КонецПроцедуры

&НаСервере
Процедура ОбработатьКомандуНаСервере(Док,РежимЗаписи = Неопределено,ПометкаНаУдаление = Неопределено)
	ДокОбъект = Док.ПолучитьОбъект();
	Если Не РежимЗаписи = Неопределено Тогда 
		ДокОбъект.Записать(РежимЗаписи);
	КонецЕсли;
	Если Не ПометкаНаУдаление = Неопределено Тогда
		Установить = Не ДокОбъект.ПометкаУдаления;
		ДокОбъект.УстановитьПометкуУдаления(Установить);
	КонецЕсли;
	УстановитьДоступностьКонтекстногоМеню(Док);
КонецПроцедуры

&НаСервере
Процедура  УстановитьДоступностьКонтекстногоМеню(Док)
	Элементы.ДЗКонтекстноеМеню.ПодчиненныеЭлементы.ДЗКонтекстноеМенюПровести.Доступность = Не Док.ПометкаУдаления;	
	Элементы.ДЗКонтекстноеМеню.ПодчиненныеЭлементы.ДЗКонтекстноеМенюОтменаПроведения.Доступность = Док.Проведен;	
	Элементы.ДЗКонтекстноеМеню.ПодчиненныеЭлементы.ДЗКонтекстноеМенюПометкаУдаления.Доступность = Истина;	
КонецПроцедуры

#КонецОбласти
