
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПолучитьДанныеСРБК();		
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеСРБК()
	ДЗБанки = Справочники.Банки.ПолучитьКлассификаторБанковСРБК();
	ЗначениеВДанныеФормы(ДЗБанки, ДЗКлассификатор);
КонецПроцедуры	

&НаКлиенте
Процедура ЗагрузитьБанки(Команда)
	ЗагрузитьБанкиСервер();
	Сообщить(Нстр("fr = 'Les banques sont chargées'; ru = 'Банки загружены'; en = 'Banks are loaded'; es = 'Bancos cargados'"));
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьБанкиСервер()
	ДеревоБанков = РеквизитФормыВЗначение("ДЗКлассификатор");
	Мас = ДеревоБанков.Строки.НайтиСтроки(Новый Структура("Загрузка", Истина), Истина);
	Для Каждого Стр Из Мас Цикл
		Если СокрЛП(Стр.ТипБанка) = "" и СокрЛП(Стр.КоррСчёт) = "" Тогда // Отметка на группе банков
			ГруппаБанков = Справочники.Банки.ПолучитьГруппуПоБИК(Стр.БИК, Стр.Наименование);	
		Иначе // Отметка на банке
			Банк = Справочники.Банки.ПолучитьПоБИК(Стр.БИК, ДеревоБанков);
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура НайтиПоБику(Команда)
	Для Каждого Стр Из ДЗКлассификатор.ПолучитьЭлементы() Цикл
		Для Каждого Стр2 Из Стр.ПолучитьЭлементы() Цикл
			Если СокрЛП(Стр2.БИК) = СокрЛП(БИКПоиск) Тогда
				Элементы.ДЗКлассификатор.ТекущаяСтрока = Стр2.ПолучитьИдентификатор(); 
				Прервать;	
			КонецЕсли;	
		КонецЦикла;	
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ДЗКлассификаторЗагрузкаПриИзменении(Элемент)
	ТекСтр = Элементы.ДЗКлассификатор.ТекущиеДанные;
	Мас = ТекСтр.ПолучитьЭлементы();
	Для Каждого Стр Из Мас Цикл
		Стр.Загрузка = ТекСтр.Загрузка;	
	КонецЦикла;	
КонецПроцедуры

