
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	РаботаСДокументами.ЗаполнитьРеквизитыПоУмолчанию(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	РаботаСДокументами.УстановитьЗаписьВсехРегистров(Движения);
	ЭтоУвольнение = ВидПриказа = Перечисления.ВидыКадровыхПриказов.Увольнение;
	ТЗСотрудники = ТЧСотрудники.Выгрузить();
	Если ЭтоУвольнение Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ТарифныеСтавкиСрезПоследних.Сотрудник КАК Сотрудник
		                      |ИЗ
		                      |	РегистрСведений.ТарифныеСтавки.СрезПоследних(&ДатаСреза, Сотрудник В (&Сотрудники)) КАК ТарифныеСтавкиСрезПоследних");
		Запрос.УстановитьПараметр("ДатаСреза", НачалоМесяца(ЭтотОбъект.Дата) - 1);
		Запрос.УстановитьПараметр("Сотрудники", ТЗСотрудники.ВыгрузитьКолонку("Сотрудник"));	
		ТЗТарифныеСтавки = Запрос.Выполнить().Выгрузить();
		ТЗСотрудники.Очистить();
		Для Каждого Стр Из ТЧСотрудники Цикл
			НС = ТЗСотрудники.Добавить();
			НС.Сотрудник = Стр.Сотрудник;
			СтрТС = ТЗТарифныеСтавки.Найти(Стр.Сотрудник, "Сотрудник");
		КонецЦикла;	
	КонецЕсли;	
	Для Каждого Стр Из ТЗСотрудники Цикл
		НС = Движения.ТарифныеСтавки.Добавить();
		НС.Период = Дата;
		НС.ВидПриказа = ВидПриказа;
		НС.Организация = Организация;
		ЗаполнитьЗначенияСвойств(НС, Стр);
	КонецЦикла;
	Движения.Записать();
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ВидПриказа = Перечисления.ВидыКадровыхПриказов.Приём Или ВидПриказа = Перечисления.ВидыКадровыхПриказов.Перевод Тогда
		ПроверяемыеРеквизиты.Добавить("ТЧСотрудники.Должность");
		//ПроверяемыеРеквизиты.Добавить("ТЧСотрудники.ГрафикРаботы");
		ПроверяемыеРеквизиты.Добавить("ТЧСотрудники.ВариантУчётаРабочегоВремени");
	КонецЕсли;
КонецПроцедуры


