
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	ПолучитьБанковскиеСчетаДляВыгрузки();
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ПустаяСтрока(Объект.ВерсияФормата) Тогда
		Объект.ВерсияФормата = "1.03";
	КонецЕсли;
	ОбновитьДокументыКВыгрузке(Неопределено);
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура Обновить(Команда)
	ПолучитьБанковскиеСчетаДляВыгрузки();
	ОбновитьДокументыКВыгрузке(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ДокументыКВыгрузкеУстановитьВсеОтметки(Команда)
	ТЧДокументыКВыгрузкеУстановитьОтметку(Истина);	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыКВыгрузкеСнятьВсеОтметки(Команда)
	ТЧДокументыКВыгрузкеУстановитьОтметку(Ложь);	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыКЗагрузкеУстановитьВсеОтметки(Команда)
	ТЧДокументыКЗагрузкеУстановитьОтметку(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ДокументыКЗагрузкеСнятьВсеОтметки(Команда)
	ТЧДокументыКЗагрузкеУстановитьОтметку(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ТЧБанковскиеСчетаПометкаПриИзменении(Элемент)
	ОбновитьДокументыКВыгрузке(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ТЧБанковскиеСчетаПериодВыгрузкиПриИзменении(Элемент)
	ТекСтр = Элементы.ТЧБанковскиеСчета.ТекущиеДанные;
	ТекСтр.ВыгрузкаНачалоПериода = ТекСтр.ПериодВыгрузки.ДатаНачала;
	ТекСтр.ВыгрузкаКонецПериода = ТекСтр.ПериодВыгрузки.ДатаОкончания;
	ТекСтр.Пометка = Истина;	
	ОбновитьДокументыКВыгрузке(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ТЧДокументыКВыгрузкеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекСтр = Элемент.ТекущиеДанные;
	Если Поле = Элементы.ТЧДокументыКВыгрузкеНомер Или Поле = Элементы.ТЧДокументыКВыгрузкеДата Тогда
		ПоказатьЗначение(, ТекСтр.Документ);
	ИначеЕсли Поле = Элементы.ТЧДокументыКВыгрузкеКонтрагент Тогда
		ПоказатьЗначение(, ТекСтр.Контрагент);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТЧДокументыКВыгрузкеВыгружатьПриИзменении(Элемент)
	ТЧДокументыКВыгрузкеОбновитьИтогиВПодвале();
КонецПроцедуры

&НаКлиенте
Процедура ТЧДокументыКЗагрузкеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекСтр = Элемент.ТекущиеДанные;
	Если Поле = Элементы.ТЧДокументыКЗагрузкеДокумент Тогда
		ПоказатьЗначение(, ТекСтр.Документ);
	ИначеЕсли Поле = Элементы.ТЧДокументыКЗагрузкеКонтрагент Тогда
		ПоказатьЗначение(, ТекСтр.Контрагент);	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТЧИнформацияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекСтр = Объект.ТЧИнформация.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если ЗначениеЗаполнено(ТекСтр.Данные) Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьЗначение(, ТекСтр.Данные);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыгрузитьДокументы(Команда)
	Если Объект.ТЧДокументыКВыгрузке.Количество() > 0 Тогда
		ПараметрыДиалога = Новый ПараметрыДиалогаПолученияФайлов;
		ПараметрыДиалога.ВыборКаталога = Истина;
		ПараметрыДиалога.Заголовок = "Выберите каталог для сохранения банковских выписок";
		МасОписаниеФайлов = ВыгрузитьДокументыНаСервере();
		Если МасОписаниеФайлов.Количество() = 0 Тогда  
			ТекстСообщения = "Не выбраны документы для выгрузки";	
		Иначе
			Обещание = ПолучитьФайлыССервераАсинх(МасОписаниеФайлов, ПараметрыДиалога);
			Рез = Ждать Обещание;
			ТекстСообщения = "Документы выгружены";
		КонецЕсли;
	Иначе		
		Мас = Объект.ТЧБанковскиеСчета.НайтиСтроки(Новый Структура("Пометка", Истина));
		ТекстСообщения = "";
		Для Каждого Стр Из Мас Цикл
			Если Стр.ВыгрузкаНачалоПериода = Стр.ВыгрузкаКонецПериода Тогда
				ТекстПериода = Формат(Стр.ВыгрузкаНачалоПериода, "ДФ=dd.MM.yyyy");
			Иначе
				ТекстПериода = НСтр("период с " + Формат(Стр.ВыгрузкаНачалоПериода, "ДФ=dd.MM.yyyy") + " по " + Формат(Стр.ВыгрузкаКонецПериода, "ДФ=dd.MM.yyyy"));
			КонецЕсли;
			ТекстСообщения = ТекстСообщения + "Отсутствуют платежные поручения за " + ТекстПериода + " 
				|по счету " + СокрЛП(Стр.Наименование) + " - " + СокрЛП(Стр.Организация) + "
				|";
		КонецЦикла;
		ТекстСообщения = ТекстСообщения + "
			|Попробуйте изменить период или указать другой банковский счет."	
	КонецЕсли;
	ПоказатьПредупреждение(, ТекстСообщения);
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗагрузитьДокументы(Команда)
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.Заголовок = "Выберите файлы с банковской выпиской";
	ПараметрыДиалога.Фильтр = "Текстовый документ(*.txt)|*.txt";
	ПараметрыДиалога.МножественныйВыбор = Истина;
	Обещание = ПоместитьФайлыНаСерверАсинх(,, ПараметрыДиалога, ЭтаФорма.УникальныйИдентификатор);
	МасОписаниеФайлов = Ждать Обещание;
	Если МасОписаниеФайлов = Неопределено Тогда Возврат КонецЕсли;
	МасАдреса = Новый Массив;
	Для Каждого Стр Из МасОписаниеФайлов Цикл
		МасАдреса.Добавить(Стр.Адрес);	
	КонецЦикла;	
	ЗагрузитьДокументыНаСервере(МасАдреса);	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	СоздатьДокументыНаСервере();
	Оповестить("ЗагруженаВыпискаИзБанка");
КонецПроцедуры

#КонецОбласти

#Область Дополнительно

&НаКлиенте
Процедура ТЧДокументыКВыгрузкеУстановитьОтметку(Отметка)
	Для Каждого Стр Из Объект.ТЧДокументыКВыгрузке Цикл
		Стр.Выгружать = Отметка;
	КонецЦикла;	
	ТЧДокументыКВыгрузкеОбновитьИтогиВПодвале();	
КонецПроцедуры

&НаКлиенте
Процедура ТЧДокументыКЗагрузкеУстановитьОтметку(Отметка)
	Для Каждого Стр Из Объект.ТЧДокументыКЗагрузке Цикл
		Стр.Загружать = Отметка;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ТЧДокументыКВыгрузкеОбновитьИтогиВПодвале()
	КоличествоКВыгрузке = 0;
	СуммаКВыгрузке = 0;
	Мас = Объект.ТЧДокументыКВыгрузке.НайтиСтроки(Новый Структура("Выгружать", Истина));
	Для каждого Стр Из Мас Цикл
		КоличествоКВыгрузке = КоличествоКВыгрузке + 1;
		СуммаКВыгрузке = СуммаКВыгрузке + Стр.СуммаДокумента;		
	КонецЦикла;
	Элементы.ТЧДокументыКВыгрузкеВыгружать.ТекстПодвала = КоличествоКВыгрузке;
	Элементы.ТЧДокументыКВыгрузкеСуммаДокумента.ТекстПодвала = Формат(СуммаКВыгрузке, "ЧЦ=12; ЧДЦ=2");
КонецПроцедуры

&НаСервере
Процедура ПолучитьБанковскиеСчетаДляВыгрузки()	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВЗ.БанковскийСчёт.Наименование КАК Наименование,
	                      |	ВЗ.БанковскийСчёт.НомерСчёта КАК НомерСчёта,
	                      |	ВЗ.БанковскийСчёт КАК БанковскийСчёт,
	                      |	ВЗ.БанковскийСчёт.Владелец КАК Организация,
	                      |	ВЗ.БанковскийСчёт.Банк КАК Банк,
	                      |	ИСТИНА КАК Пометка,
	                      |	ВЗ.ВыгрузкаНачалоПериода КАК ВыгрузкаНачалоПериода,
	                      |	ВЗ.ВыгрузкаКонецПериода КАК ВыгрузкаКонецПериода
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		СписаниеБезналичныхДенежныхСредств.БанковскийСчёт КАК БанковскийСчёт,
	                      |		МИНИМУМ(СписаниеБезналичныхДенежныхСредств.Дата) КАК ВыгрузкаНачалоПериода,
	                      |		МАКСИМУМ(СписаниеБезналичныхДенежныхСредств.Дата) КАК ВыгрузкаКонецПериода
	                      |	ИЗ
	                      |		Документ.СписаниеБезналичныхДенежныхСредств КАК СписаниеБезналичныхДенежныхСредств
	                      |	ГДЕ
	                      |		СписаниеБезналичныхДенежныхСредств.ПроведеноБанком = ЛОЖЬ
	                      |		И СписаниеБезналичныхДенежныхСредств.Проведен = ИСТИНА
	                      |	
	                      |	СГРУППИРОВАТЬ ПО
	                      |		СписаниеБезналичныхДенежныхСредств.БанковскийСчёт) КАК ВЗ");
	Объект.ТЧБанковскиеСчета.Загрузить(Запрос.Выполнить().Выгрузить());
	Для Каждого Стр Из Объект.ТЧБанковскиеСчета Цикл
		Стр.ПериодВыгрузки.ДатаНачала = Стр.ВыгрузкаНачалоПериода;
		Стр.ПериодВыгрузки.ДатаОкончания = Стр.ВыгрузкаКонецПериода;
	КонецЦикла;
	Объект.ТЧДокументыКВыгрузке.Очистить();
	Объект.ТЧДокументыКЗагрузке.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДокументыКВыгрузке(Элемент)
	Если Не ПроверитьЗаполнение() Тогда Возврат КонецЕсли;
	ОчиститьСообщения();
	ЗаполнитьДокументыКВыгрузке();
	ТЧДокументыКВыгрузкеОбновитьИтогиВПодвале();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументыКВыгрузке()
	Объект.Программа = "";
	Объект.Кодировка = "Windows";
	Об = РеквизитФормыВЗначение("Объект");
	Об.ЗаполнитьПлатёжныеДокументы();
	ЗначениеВРеквизитФормы(Об, "Объект");
	ЕстьСтрокиЭкспортаСОшибками = Ложь;
	УстановитьПериодыВыгрузкиЗагрузки();
КонецПроцедуры

&НаСервере
Функция ВыгрузитьДокументыНаСервере()
	Об = РеквизитФормыВЗначение("Объект");
	Возврат Об.ВыгрузитьДокументы(ЭтаФорма.УникальныйИдентификатор);
КонецФункции

&НаСервере
Процедура ЗагрузитьДокументыНаСервере(МасАдреса)
	Об = РеквизитФормыВЗначение("Объект");
	Об.ЗагрузитьДокументы(МасАдреса);
	ЗначениеВРеквизитФормы(Об, "Объект");
	УстановитьПериодыВыгрузкиЗагрузки();
КонецПроцедуры

&НаСервере
Процедура УстановитьПериодыВыгрузкиЗагрузки()
	Для Каждого Стр Из Объект.ТЧБанковскиеСчета Цикл
		Стр.ПериодВыгрузки.ДатаНачала = Стр.ВыгрузкаНачалоПериода;
		Стр.ПериодВыгрузки.ДатаОкончания = Стр.ВыгрузкаКонецПериода;
		Стр.ПериодЗагрузки.ДатаНачала = Стр.ЗагрузкаНачалоПериода;
		Стр.ПериодЗагрузки.ДатаОкончания = Стр.ЗагрузкаКонецПериода;
	КонецЦикла;	
КонецПроцедуры	

&НаСервере
Процедура СоздатьДокументыНаСервере()
	Об = РеквизитФормыВЗначение("Объект");
	Об.СоздатьДокументы();
	ЗначениеВРеквизитФормы(Об, "Объект");
	УстановитьПериодыВыгрузкиЗагрузки();
КонецПроцедуры

#КонецОбласти

