
Перем мЭтоНовыйЭлемент;
Перем мМонопольныйРежимПередЗаписью;

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаСообщенияПользователю = СообщитьИнформациюПользователюПослеСозданияНовогоУзла();
	
	#Если Клиент Тогда
	Сообщить(СтрокаСообщенияПользователю);
	#КонецЕсли
	
КонецПроцедуры

Функция СообщитьИнформациюПользователюПослеСозданияНовогоУзла() Экспорт
	
	//НужноПерезапуститьВсеПодключенияКИБ = Ложь;
	//
	//Если мЭтоНовыйЭлемент 
	//	И НЕ мМонопольныйРежимПередЗаписью Тогда
	//	
	//	НужноПерезапуститьВсеПодключенияКИБ = Истина;
	//	
	//КонецЕсли;	
	//
	//Если НужноПерезапуститьВсеПодключенияКИБ Тогда
	//	
	//	Если мМонопольныйРежимПередЗаписью Тогда
	//		
	//		ПолныеПрава.ОпределитьПараметрыСеансаДляОбменаДанными();
	//		Возврат "";
	//		
	//	Иначе	
	//		
	//		Возврат "Для корректной работы механизма обмена данными необходимо завершить работу всех пользователей и перезапустить текущий сеанс работы 1С:Предприятия.";	
	//		
	//	КонецЕсли;
	//	
	//Иначе
	//	
	//	Если мЭтоНовыйЭлемент Тогда
	//		
	//		ПолныеПрава.ОпределитьПараметрыСеансаДляОбменаДанными();	
	//		
	//	КонецЕсли;
	//	
	//	Возврат "";
	//	
	//КонецЕсли;
	
КонецФункции

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	мЭтоНовыйЭлемент = ЭтоНовый();
	
	мМонопольныйРежимПередЗаписью = Истина; //ОбщегоНазначения.ОпределитьТекущийРежимРаботыМонопольный();
	
КонецПроцедуры
