
Функция ПолучитьДанныеКлассификатора() Экспорт
	ТД = Новый ТекстовыйДокумент;
	ТД = Справочники.УпаковкиЕдиницыИзмерения.ПолучитьМакет("КлассификаторЕдиницИзмерения");
	ТекстМакета = ТД.ПолучитьТекст();		
	Возврат ОбщегоНазначения.ЗначениеИзСтрокиXML(ТекстМакета);	
КонецФункции

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	Если ВидФормы = "ФормаОбъекта" Тогда
		СтандартнаяОбработка = Ложь;		
		Если Параметры.Свойство("Ключ")	И Параметры.Ключ.ТипИзмеряемойВеличины = Перечисления.ТипыИзмеряемыхВеличин.Упаковка Тогда 				
			ВыбраннаяФорма = "ФормаЭлементаУпаковка";
		ИначеЕсли Параметры.Свойство("ЗначениеКопирования") И Параметры.ЗначениеКопирования.ТипИзмеряемойВеличины = Перечисления.ТипыИзмеряемыхВеличин.Упаковка Тогда
			ВыбраннаяФорма = "ФормаЭлементаУпаковка";
		ИначеЕсли Параметры.Свойство("ПараметрыВыбора") и
			((Параметры.ПараметрыВыбора.Свойство("Владелец") и ТипЗнч(Параметры.ПараметрыВыбора.Владелец) = Тип("СправочникСсылка.НаборыУпаковок")) Или 
			(Параметры.ПараметрыВыбора.Свойство("ТипИзмеряемойВеличины") и Параметры.ПараметрыВыбора.ТипИзмеряемойВеличины = Перечисления.ТипыИзмеряемыхВеличин.Упаковка)) Тогда  			
			ВыбраннаяФорма = "ФормаЭлементаУпаковка";	
		Иначе
			ВыбраннаяФорма = "ФормаЭлементаЕдиница";	
		КонецЕсли;
	ИначеЕсли ВидФормы = "ФормаСписка" Тогда
		СтандартнаяОбработка = Ложь;
		ТекущаяСтрока = Неопределено; 		
		Если Параметры.Свойство("ТекущаяСтрока", ТекущаяСтрока) Тогда
			Владелец = ТекущаяСтрока.Владелец;
		ИначеЕсли Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Владелец") Тогда
			Владелец = Параметры.Отбор.Владелец;	
		Иначе
			Владелец = Неопределено;
		КонецЕсли;		
		Если Владелец = Справочники.НаборыУпаковок.БазовыеЕдиницыИзмерения Тогда
			ВыбраннаяФорма = "ФормаСпискаЕдиниц";
		Иначе
			ВыбраннаяФорма = "ФормаСпискаУпаковок";
		КонецЕсли;		
		Если Владелец <> Неопределено Тогда			
			Если Не Параметры.Свойство("Отбор") Тогда
				Параметры.Вставить("Отбор", Новый Структура);
			КонецЕсли;			
			Параметры.Отбор.Вставить("Владелец", Владелец);			
		КонецЕсли;
	ИначеЕсли ВидФормы = "ФормаВыбора" Тогда
		СтандартнаяОбработка = Ложь;
		ТипИзмеряемойВеличины = Неопределено;		
		Если Параметры.Свойство("Отбор") и 
			(Параметры.Отбор.Свойство("ТипИзмеряемойВеличины", ТипИзмеряемойВеличины) Или Параметры.Свойство("ТипИзмеряемойВеличины", ТипИзмеряемойВеличины)) Тогда
			Если ТипИзмеряемойВеличины = Перечисления.ТипыИзмеряемыхВеличин.Упаковка Тогда
				ВыбраннаяФорма = "ФормаВыбораУпаковки";
			Иначе
				ВыбраннаяФорма = "ФормаВыбораЕдиницы";
			КонецЕсли;
		//ИначеЕсли (Параметры.Свойство("Номенклатура") и Не (Параметры.Свойство("ВсегдаВыбиратьЕдиницуИзмерения") и Не ЗначениеЗаполнено(Параметры.Номенклатура))) Или
		//	(Параметры.Свойство("НоменклатураОприходование") и Не (Параметры.Свойство("ВсегдаВыбиратьЕдиницуИзмерения") и Не ЗначениеЗаполнено(Параметры.НоменклатураОприходование))) Тогда 
			//ВыбраннаяФорма = "ФормаВыбораИзДокументов";
			//Если Параметры.Свойство("НоменклатураОприходование") Тогда
			//	Параметры.Вставить("Номенклатура", Параметры.НоменклатураОприходование);	
			//КонецЕсли;			
			//СтандартнаяОбработка = Ложь;	
		Иначе
			ВыбраннаяФорма = "ФормаВыбораЕдиницы";
			Если Не Параметры.Свойство("Отбор") Тогда
				Параметры.Вставить("Отбор", Новый Структура);
			КонецЕсли;
			Мас = Новый Массив;
			Мас.Добавить(Перечисления.ТипыИзмеряемыхВеличин.Вес);
			Мас.Добавить(Перечисления.ТипыИзмеряемыхВеличин.Объем);
			Мас.Добавить(Перечисления.ТипыИзмеряемыхВеличин.Площадь);
			Мас.Добавить(Перечисления.ТипыИзмеряемыхВеличин.Длина);
			Мас.Добавить(Перечисления.ТипыИзмеряемыхВеличин.КоличествоШтук);
			Мас.Добавить(Перечисления.ТипыИзмеряемыхВеличин.Мощность);
			Мас.Добавить(Перечисления.ТипыИзмеряемыхВеличин.Энергия);
			Мас.Добавить(Перечисления.ТипыИзмеряемыхВеличин.ЭлектрическийЗаряд);
			Мас.Добавить(Перечисления.ТипыИзмеряемыхВеличин.Время);
			Мас.Добавить(Перечисления.ТипыИзмеряемыхВеличин.ПустаяСсылка());
			Параметры.Отбор.Вставить("ТипИзмеряемойВеличины", Мас);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

Функция СформироватьНаименование(ТипУпаковки, Единица, Числитель, Знаменатель, ЕдиницаВладельца) Экспорт	
	Если ТипУпаковки = Перечисления.ТипыУпаковокНоменклатуры.Разупаковка Тогда
		Возврат СокрЛП(СокрЛП(Единица) + " (" + Формат(Числитель, "ЧРД=.") + "/" + Формат(Знаменатель, "ЧРД=.") + " " + СокрЛП(ЕдиницаВладельца) + ")");
	ИначеЕсли ТипУпаковки = Перечисления.ТипыУпаковокНоменклатуры.ТоварноеМесто Тогда
		Возврат "";		
	ИначеЕсли Числитель <> 0 И Знаменатель <> 0 Тогда 
		Возврат СокрЛП(СокрЛП(Единица) + " (" + Формат(Числитель / Знаменатель, "ЧРД=.") + " " + СокрЛП(ЕдиницаВладельца) + ")");
	Иначе 
		Возврат "";
	КонецЕсли;
КонецФункции
