
#Область _______________________________________________________________ОБРАБОТЧИКИ_СОБЫТИЙ_________________________________________________________________________


// Процедура - обработчик события "ОбработкаЗаполнения" объекта
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Дата = ТекущаяДата();
	НапоминаниеДатаНачала = Дата;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ВидОперации") Тогда
		ВидОперации = ДанныеЗаполнения.ВидОперации;		
	КонецЕсли;
	
	// Заполнение реквизитов документа по умолчанию
	ОбщегоНазначенияСПАВызовСервера.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, , ДанныеЗаполнения);
	
КонецПроцедуры

// Процедура - обработчик события "ПриКопировании" объекта
//
Процедура ПриКопировании(ОбъектКопирования)
	
	// Заполнение реквизитов документа по умолчанию
	ОбщегоНазначенияСПАВызовСервера.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, ОбъектКопирования);
	                       
КонецПроцедуры

// Обработка перед записью объекта на сервере
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//Если во взаимодействие вид операции входящий звонок он по умолчанию отработан
	Если ВидОперации = Перечисления.ВидыОперацийВзаимодействия.ТелефонныйЗвонокВходящий Тогда
		ЗадачаОтработана = Истина;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВзаимодействия.Годовщина Тогда
		Тема = ВидГодовщины;	
	КонецЕсли;
	
КонецПроцедуры

// Обработчик при записи объекта
//
Процедура ПриЗаписи(Отказ)
	
	//Создаем новую задачу
	Если НапоминаниеИспользовать = Истина И ЗадачаОтработана = Ложь Тогда
		
		//Проверить существование ранее
		ЗапросПроверка = Новый Запрос("ВЫБРАТЬ  РАЗРЕШЕННЫЕ
		                              |	ЗадачаИсполнителя.Ссылка
		                              |ИЗ
		                              |	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
		                              |ГДЕ
		                              |	ЗадачаИсполнителя.Предмет = &ЗадачаПредмет");
									  
		ЗапросПроверка.УстановитьПараметр("ЗадачаПредмет", Ссылка);
		ВыборкаРезультат = ЗапросПроверка.Выполнить().Выбрать();
		
		Если ВыборкаРезультат.Количество() = 0 Тогда
			//Если задача не была ранее создана, создать задачу
			НоваяЗадача = Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
			НоваяЗадача.Заполнить(Ссылка);
			НоваяЗадача.Записать();
		Иначе
			//при модифицированности взаимодействия перезаписать задачу
			Пока ВыборкаРезультат.Следующий() Цикл
				ОбъектЗадачи =  ВыборкаРезультат.Ссылка.ПолучитьОбъект();
				ОбъектЗадачи.Заполнить(Ссылка);
				ОбъектЗадачи.ПометкаУдаления = Ложь;
				ОбъектЗадачи.Выполнена = Ложь;
				ОбъектЗадачи.ДатаИсполнения = Неопределено;
				ОбъектЗадачи.Записать();
			КонецЦикла;
		КонецЕсли;
	
	КонецЕсли;	
	
	//Если записывается со статусом отработан выполнить и связанную с ним задачу
	Если НапоминаниеИспользовать = Истина И ЗадачаОтработана = Истина Тогда
		
		//Получить задачу для записываемого взаимодействия
		ЗапросПроверка = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
		                              |	ЗадачаИсполнителя.Ссылка
		                              |ИЗ
		                              |	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
		                              |ГДЕ
		                              |	ЗадачаИсполнителя.Предмет = &ЗадачаПредмет
		                              |	И НЕ ЗадачаИсполнителя.ПометкаУдаления");
		
		ЗапросПроверка.УстановитьПараметр("ЗадачаПредмет",Ссылка);
		ВыборкаРезультат = ЗапросПроверка.Выполнить().Выбрать();
		
		//Если задача ранее не выполнена выполнить ее
		Пока ВыборкаРезультат.Следующий() Цикл
			Если ВыборкаРезультат.Ссылка.Выполнена = Ложь Тогда
				ОбъектЗадачи = ВыборкаРезультат.Ссылка.ПолучитьОбъект();
				ОбъектЗадачи.Выполнена      = Истина;
				ОбъектЗадачи.ДатаИсполнения = ТекущаяДата();
				ОбъектЗадачи.Записать();
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#Область __________________________________________________________СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ____________________________________________________________________



#КонецОбласти
