
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Номенклатура") Тогда 
		П = Новый Структура("Отбор", Новый Структура("Номенклатура", ПараметрКоманды));
	Иначе
		П = Новый Структура("Отбор", Новый Структура("Номенклатура, Серия", ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(ПараметрКоманды,"Владелец"), ПараметрКоманды));
	КонецЕсли;
	ОткрытьФорму("РегистрСведений.ШтрихкодыНоменклатуры.ФормаСписка", П, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
