
#Область Обработчики_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("Документ", Отчет.Документ);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не ОтчетСформирован Тогда
		СформироватьОтчет();
		ОтчетСформирован = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура ТабличныйДокументПриАктивизации(Элемент)
	РассчитатьПоказателиДинамически();
КонецПроцедуры

&НаКлиенте
Процедура ВычислитьВыделенные(Команда)
	РассчитатьПоказателиДинамически();
КонецПроцедуры

#КонецОбласти

#Область Дополнительно

&НаСервере
Процедура СформироватьОтчет()
	Таб.Очистить();
	Макет = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("Макет");
	МетаданныеДокумента = Отчет.Документ.Метаданные();
	МассивРегистров = ПолучитьМассивИспользуемыхРегистров(Отчет.Документ, МетаданныеДокумента.Движения);
	Для Каждого МетаданныеРегистра Из МетаданныеДокумента.Движения Цикл
		Если МассивРегистров.Найти(МетаданныеРегистра.Имя) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ВывестиДанныеПоРегистру(МетаданныеРегистра, Макет);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивИспользуемыхРегистров(Регистратор, Движения)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	ВыводитьОбъединение = Ложь;
	ТекстЗапроса = "";
	Для Каждого Движение Из Движения Цикл
		Если РаботаСДокументамиКлиентСервер.ЕстьРеквизит(Движение, "ПланСчетов") Тогда Продолжить КонецЕсли; // Регистры бухгалтерии пропускаем
		Если Не ПравоДоступа("Чтение", Метаданные["Регистры"+ОпределитьВидРегистра(Движение)][Движение.Имя]) Тогда Продолжить; КонецЕсли;
		Если ВыводитьОбъединение Тогда
			ТекстЗапроса = ТекстЗапроса + "
										|ОБЪЕДИНИТЬ ВСЕ
										|";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
									|ВЫБРАТЬ ПЕРВЫЕ 1
									|""" + Движение.Имя + """ КАК ИмяРегистра
									|
									|ИЗ " + Движение.ПолноеИмя() + "
									|
									|ГДЕ Регистратор = &Регистратор
									|";
		ВыводитьОбъединение = Истина;
	КонецЦикла;
	Запрос.Текст = ТекстЗапроса;
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ИмяРегистра");
КонецФункции

&НаСервере
Процедура ВывестиДанныеПоРегистру(МетаданныеРегистра, Макет)
	ВидРегистра = ОпределитьВидРегистра(МетаданныеРегистра);
	оЗаголовокОтчета = Макет.ПолучитьОбласть("ЗаголовокОтчета");	
	оЗаголовок = Макет.ПолучитьОбласть("ЗаголовокЯчейки");
	оЯчейка = Макет.ПолучитьОбласть("Ячейка");
	оОтступ = Макет.ПолучитьОбласть("Отступ");
	оЗаголовокОтчета.Параметры.СинонимРегистра = "Регистр " + НРег(ВидРегистра) + " """ + МетаданныеРегистра.Синоним + """";;
	Таб.Вывести(оЗаголовокОтчета);	
	ЦветЗеленый = WebЦвета.Зеленый;
	ЦветКрасный = WebЦвета.Кирпичный;
	ДвижениеПриход = ВидДвиженияНакопления.Приход;
	Результат = ПолучитьДанныеПоДвижениям(МетаданныеРегистра, ВидРегистра);
	ТЗВидДвижений = Результат.ТЗВидДвижений;
	ТЗРесурсы = Результат.ТЗРесурсы;
	ТЗИзмерения = Результат.ТЗИзмерения;
	ТЗРеквизиты = Результат.ТЗРеквизиты;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Документ", Отчет.Документ);
	Запрос.Текст = Результат.ТекстЗапроса;	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл		
		Если ТЗВидДвижений <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(ТЗВидДвижений.Добавить(), Выборка, "ВидДвижения");
		КонецЕсли;		
		СтрокаРесурсов = ТЗРесурсы.Добавить();
		СтрокаИзмерений = ТЗИзмерения.Добавить();
		СтрокаРеквизитов = ТЗРеквизиты.Добавить();		
		Для Каждого ЭлементАналитики Из Результат.СтруктураПолей.Измерения.МассивРеквизитовАналитики Цикл			
			СтрокаИзмерений[ЭлементАналитики.Поле] = ПолучитьЗначенияВСтроку(Выборка, ЭлементАналитики.МассивПолей);			
		КонецЦикла;		
		Для Каждого ЭлементАналитики Из Результат.СтруктураПолей.Реквизиты.МассивРеквизитовАналитики Цикл
			СтрокаРеквизитов[ЭлементАналитики.Поле] = ПолучитьЗначенияВСтроку(Выборка, ЭлементАналитики.МассивПолей);			
		КонецЦикла;		
		ЗаполнитьЗначенияСвойств(СтрокаРесурсов, Выборка, Результат.СтруктураПолей.Ресурсы.СтрокаПолей);
		ЗаполнитьЗначенияСвойств(СтрокаИзмерений, Выборка, Результат.СтруктураПолей.Измерения.СтрокаПолей);
		ЗаполнитьЗначенияСвойств(СтрокаРеквизитов, Выборка, Результат.СтруктураПолей.Реквизиты.СтрокаПолей);		
	КонецЦикла;
	Таб.НачатьГруппуСтрок();
	Таб.Вывести(оОтступ);
	КоличествоСтрокРезультата = Выборка.Количество();	
	Если ТЗВидДвижений <> Неопределено Тогда		
		оЗаголовок.Параметры.ЗаголовокКолонки = "Вид движения";
		Таб.Присоединить(оЗаголовок);		
	КонецЕсли;	
	ПрисоединитьОбласть(Таб, оЗаголовок, ТЗИзмерения);
	ПрисоединитьОбласть(Таб, оЗаголовок, ТЗРесурсы);
	ПрисоединитьОбласть(Таб, оЗаголовок, ТЗРеквизиты);	
	Для НомерСтроки = 1 По КоличествоСтрокРезультата Цикл		
		Таб.Вывести(оОтступ);
		Если ТЗВидДвижений <> Неопределено Тогда
			ВидДвижения = ТЗВидДвижений[НомерСтроки - 1].ВидДвижения;
			оЯчейка.Параметры.Значение = ВидДвижения;
			//оЯчейка.Параметры.Значение = ?(ВидДвижения = ДвижениеПриход, "+", "-");
			Таб.Присоединить(оЯчейка);			
			Область = Таб.Область("Ячейка");
			Область.ШиринаКолонки = 13;			
			Если ВидДвижения = ВидДвиженияНакопления.Расход Тогда
				Область.ЦветТекста = ЦветКрасный;
			Иначе
				Область.ЦветТекста = ЦветЗеленый;
			КонецЕсли;			
		КонецЕсли;		
		ПрисоединитьОбластьПоСтроке(Таб, оЯчейка, ТЗИзмерения[НомерСтроки - 1]);
		ПрисоединитьОбластьПоСтроке(Таб, оЯчейка, ТЗРесурсы[НомерСтроки - 1]);
		ПрисоединитьОбластьПоСтроке(Таб, оЯчейка, ТЗРеквизиты[НомерСтроки - 1]);
	КонецЦикла;
	Таб.ЗакончитьГруппуСтрок();
КонецПроцедуры

&НаСервере
Функция ОпределитьВидРегистра(МетаданныеРегистра)
	Если Метаданные.РегистрыНакопления.Индекс(МетаданныеРегистра) >= 0 Тогда
		Результат = "Накопления";
	ИначеЕсли Метаданные.РегистрыСведений.Индекс(МетаданныеРегистра) >= 0 Тогда
		Результат = "Сведений";
	ИначеЕсли Метаданные.РегистрыБухгалтерии.Индекс(МетаданныеРегистра) >= 0 Тогда
		Результат = "Бухгалтерии";
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ДобавитьКолонкуВТаблицу(МетаданныеПоля, ТаблицаПолей)
	ТаблицаПолей.Колонки.Добавить(МетаданныеПоля.Имя,, МетаданныеПоля.Синоним);
КонецПроцедуры

&НаСервере
Процедура ДобавитьКолонкуПериодВТаблицу(ТаблицаПолей)
	ТаблицаПолей.Колонки.Добавить("Период",, "Период");	
КонецПроцедуры

&НаСервере
Процедура ПрисоединитьОбласть(ТабличныйДокумент, Область, Таблица)
	Для Каждого Колонка Из Таблица.Колонки Цикл
		Область.Параметры.ЗаголовокКолонки = Колонка.Заголовок;
		ТабличныйДокумент.Присоединить(Область);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПрисоединитьОбластьПоСтроке(ТабличныйДокумент, Область, СтрокаТаблицы)
	Для Каждого Колонка Из СтрокаТаблицы.Владелец().Колонки Цикл
		Область.Параметры.Значение = СтрокаТаблицы[Колонка.Имя];
		ТабличныйДокумент.Присоединить(Область); 
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеПоДвижениям(МетаданныеРегистра, ВидРегистра)
	ТЗРесурсы = Новый ТаблицаЗначений;
	ТЗИзмерения = Новый ТаблицаЗначений;
	ТЗРеквизиты = Новый ТаблицаЗначений;
	ТЗВидДвижений = Неопределено;	
	СтруктураПолей = Новый Структура("Измерения, Реквизиты, Ресурсы",
					 Новый Структура("СтрокаПолей, МассивРеквизитовАналитики", "", Новый Массив),
					 Новый Структура("СтрокаПолей, МассивРеквизитовАналитики", "", Новый Массив),
					 Новый Структура("СтрокаПолей, МассивРеквизитовАналитики", "", Новый Массив));	
	НуженПериод = Не (ВидРегистра = "Сведений" И МетаданныеРегистра.ПериодичностьРегистраСведений = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический);
	Если НуженПериод Тогда
		ИмяКоллекции = "Измерения";
		ИмяТаблицы = ТЗИзмерения;		
		ДобавитьКолонкуПериодВТаблицу(ТЗИзмерения);		
		СтруктураПолей[ИмяКоллекции].СтрокаПолей = СтруктураПолей[ИмяКоллекции].СтрокаПолей + ?(ПустаяСтрока(СтруктураПолей[ИмяКоллекции].СтрокаПолей),"", ",") + "Период";		
	КонецЕсли;	
	ТекстСоединения = "";
	ТекстПолейВыборки = "";	
	Для Счетчик = 1 По 2 Цикл		
		Если Счетчик = 1 Тогда
			ИмяКоллекции = "Измерения";
			ИмяТаблицы = ТЗИзмерения;
		Иначе
			ИмяКоллекции = "Реквизиты";
			ИмяТаблицы = ТЗРеквизиты;
		КонецЕсли;		
		Для Каждого Измерение Из МетаданныеРегистра[ИмяКоллекции] Цикл			
			ДобавитьКолонкуВТаблицу(Измерение, ИмяТаблицы);			
			ТекстПоля = "ПРЕДСТАВЛЕНИЕССЫЛКИ(Таблица." + Измерение.Имя + ") КАК " + Измерение.Имя + ", ";			
			СтруктураПолей[ИмяКоллекции].СтрокаПолей = СтруктураПолей[ИмяКоллекции].СтрокаПолей	+ ?(ПустаяСтрока(СтруктураПолей[ИмяКоллекции].СтрокаПолей), "", ",") + Измерение.Имя;		
			ТекстПолейВыборки = ТекстПолейВыборки + Символы.ПС + ТекстПоля;			
		КонецЦикла;		
	КонецЦикла;	
	ИмяКоллекции = "Ресурсы";
	Для Каждого Ресурс Из МетаданныеРегистра[ИмяКоллекции] Цикл 		
		ТекстПолейВыборки = ТекстПолейВыборки + "
							|Таблица." + Ресурс.Имя + " КАК " + Ресурс.Имя + ", ";		
		СтруктураПолей[ИмяКоллекции].СтрокаПолей = СтруктураПолей[ИмяКоллекции].СтрокаПолей
							+ ?(ПустаяСтрока(СтруктураПолей[ИмяКоллекции].СтрокаПолей), "", ",") + Ресурс.Имя;		
		ДобавитьКолонкуВТаблицу(Ресурс, ТЗРесурсы); 		
	КонецЦикла;	
	Если ВидРегистра = "Накопления" и МетаданныеРегистра.ВидРегистра = Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Остатки Тогда		
		ТЗВидДвижений = Новый ТаблицаЗначений;
		ТЗВидДвижений.Колонки.Добавить("ВидДвижения",, "ВидОрганизации движения");		
		ТекстПолейВыборки = ТекстПолейВыборки + "Таблица.ВидДвижения КАК ВидДвижения,";		
	КонецЕсли;	
	Если НуженПериод Тогда		
		ТекстПолейВыборки = ТекстПолейВыборки + "Таблица.Период КАК Период,";		
	КонецЕсли;	
	ТекстПолейВыборки = ТекстПолейВыборки + "Таблица.НомерСтроки КАК НомерСтроки";	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|" + ТекстПолейВыборки + "
					|ИЗ
					|" + МетаданныеРегистра.ПолноеИмя() + " КАК Таблица 
					|" + ТекстСоединения + "
					|ГДЕ
					|	Таблица.Регистратор = &Документ
					|
					|УПОРЯДОЧИТЬ ПО
					|	НомерСтроки";	
	Возврат Новый Структура("ТекстЗапроса, СтруктураПолей, ТЗРесурсы, ТЗИзмерения, ТЗРеквизиты, ТЗВидДвижений",
				            ТекстЗапроса, СтруктураПолей, ТЗРесурсы, ТЗИзмерения, ТЗРеквизиты, ТЗВидДвижений);
КонецФункции

&НаСервере
Функция ПолучитьЗначенияВСтроку(ВыбокаДанных, МассивПолей)
	Результат = "";
	Для Каждого ИмяПоля Из МассивПолей Цикл
		Если ЗначениеЗаполнено(ВыбокаДанных[ИмяПоля]) Тогда
			Результат = Результат + ?(ПустаяСтрока(Результат), "", "; ") + ВыбокаДанных[ИмяПоля];
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура РассчитатьПоказателиДинамически()
	ТекущаяКоманда = ""; // Сумма, среднее, макс, мин...
	ОбщегоНазначенияКлиентСервер.РассчитатьПоказатели(ЭтотОбъект, "Таб", "ФормаВычислитьВыделенные", ТекущаяКоманда, 2);
КонецПроцедуры

#КонецОбласти



