
#Область Печать

Процедура ПечатьПеремещениеТоваров(Док, Таб) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Таб.ОтображатьСетку = Ложь;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	Таб.АвтоМасштаб = Истина;
	Таб.КлючПараметровПечати = "Параметры_печати_Документ_ПеремещениеТоваров_ПеремещениеТоваров";

	Макет = Документы.ПеремещениеТоваров.ПолучитьМакет("НакладнаяНаПеремещение");	
	оЗаголовок = Макет.ПолучитьОбласть("ЗаголовокПеремещение");
	оЗаголовок.Параметры.ТекстЗаголовка = РаботаСДокументами.КраткоеПредставлениеДокумента(Док, НСтр("fr = 'Transfert de marchandises'; ru = 'Перемещение товаров'; en = 'Movement of goods'; es = 'Movimiento de mercancías'"));
	оЗаголовок.Параметры.ОрганизацияПредставление = Док.Организация;
	оЗаголовок.Параметры.ОтправительПредставление = Док.МестоХранения;
	оЗаголовок.Параметры.ПолучательПредставление = Док.МестоХраненияОприходование;
	Таб.Вывести(оЗаголовок);
	Таб.Вывести(Макет.ПолучитьОбласть("ШапкаТаблицы"));
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВЫРАЗИТЬ(ТЗ.НомерСтроки КАК ЧИСЛО) КАК НомерСтроки,
	                      |	ВЫРАЗИТЬ(ТЗ.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	                      |	ВЫРАЗИТЬ(ТЗ.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
	                      |	ВЫРАЗИТЬ(ТЗ.Упаковка КАК Справочник.УпаковкиЕдиницыИзмерения) КАК Упаковка,
	                      |	ВЫРАЗИТЬ(ТЗ.КоличествоУпаковок КАК ЧИСЛО) КАК КоличествоУпаковок,
	                      |	ВЫРАЗИТЬ(ТЗ.Количество КАК ЧИСЛО) КАК Количество
	                      |ПОМЕСТИТЬ ВТ
	                      |ИЗ
	                      |	&ТЗ КАК ТЗ
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ.НомерСтроки КАК НомерСтроки,
	                      |	ВТ.Номенклатура КАК Номенклатура,
	                      |	ВТ.Характеристика КАК Характеристика,
	                      |	ВЫБОР
	                      |		КОГДА ВТ.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	                      |			ТОГДА ВТ.Номенклатура.Единица
	                      |		ИНАЧЕ ВТ.Упаковка
	                      |	КОНЕЦ КАК Упаковка,
	                      |	ВТ.КоличествоУпаковок КАК КоличествоУпаковок,
	                      |	ВТ.Количество КАК Количество,
	                      |	ВТ.Номенклатура.Артикул КАК Артикул,
	                      |	ВТ.Номенклатура.Единица КАК ЕдиницаХранения
	                      |ИЗ
	                      |	ВТ КАК ВТ
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	НомерСтроки");
	Запрос.УстановитьПараметр("ТЗ", Док.ТЧТовары.Выгрузить());
	Выб = Запрос.Выполнить().Выбрать();
	//
	оСтрока = Макет.ПолучитьОбласть("Строка"); 	
	Пока Выб.Следующий() Цикл
		оСтрока.Параметры.Заполнить(Выб);
		оСтрока.Параметры.Товар = ОбщегоНазначенияКлиентСервер.ПредставлениеНоменклатуры(Выб.Номенклатура, Выб.Характеристика, , Истина);
		Таб.Вывести(оСтрока);
	КонецЦикла;
	Таб.Вывести(Макет.ПолучитьОбласть("Подвал"));
	Таб.Вывести(Макет.ПолучитьОбласть("Подписи"));
	Таб.ВывестиГоризонтальныйРазделительСтраниц();
	Таб.ИспользуемоеИмяФайла = РаботаСДокументами.КраткоеПредставлениеДокумента(Док, "Перемещение товаров");
КонецПроцедуры

#КонецОбласти
