 	
Функция ПолучитьДоступныеВидыРеквизитов(Контрагент, ВидКонтрагента, МасВыбранныеРеквизиты) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВидыРеквизитовКонтрагентовТЧВидыКонтрагентов.Ссылка КАК Реквизит,
	                      |	ВидыРеквизитовКонтрагентовТЧВидыКонтрагентов.Ссылка.Родитель КАК Родитель,
	                      |	ВидыРеквизитовКонтрагентовТЧВидыКонтрагентов.Ссылка.Порядок КАК Порядок
	                      |ИЗ
	                      |	ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.ТЧВидыКонтрагентов КАК ВидыРеквизитовКонтрагентовТЧВидыКонтрагентов
	                      |ГДЕ
	                      |	ВидыРеквизитовКонтрагентовТЧВидыКонтрагентов.ВидКонтрагента = &ВидКонтрагента
	                      |	И НЕ ВидыРеквизитовКонтрагентовТЧВидыКонтрагентов.Ссылка.Служебный
	                      |	И НЕ ВидыРеквизитовКонтрагентовТЧВидыКонтрагентов.Ссылка В
	                      |				(ВЫБРАТЬ
	                      |					ВидыРеквизитовКонтрагентов.Ссылка КАК Ссылка
	                      |				ИЗ
	                      |					ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов КАК ВидыРеквизитовКонтрагентов
	                      |				ГДЕ
	                      |					ВидыРеквизитовКонтрагентов.Ссылка В (&МасВыбранныеРеквизиты)
	                      |					И НЕ ВидыРеквизитовКонтрагентов.Множественный)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Порядок
	                      |ИТОГИ
	                      |	МИНИМУМ(Порядок)
	                      |ПО
	                      |	Реквизит ТОЛЬКО ИЕРАРХИЯ");
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ВидКонтрагента", ВидКонтрагента);
	Запрос.УстановитьПараметр("МасВыбранныеРеквизиты", МасВыбранныеРеквизиты);
	ВыбГруппа = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	СЗ = Новый СписокЗначений;
	Пока ВыбГруппа.Следующий() Цикл	
		Выб = ВыбГруппа.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		Пока Выб.Следующий() Цикл
			Если Выб.Реквизит = ПланыВидовХарактеристик.ВидыРеквизитовКонтрагентов.Телефон Тогда
				Картинка = БиблиотекаКартинок.Телефон16; 
				ИндексКартинки = 0;
			ИначеЕсли Выб.Реквизит = ПланыВидовХарактеристик.ВидыРеквизитовКонтрагентов.EMail Тогда
				Картинка = БиблиотекаКартинок.Почта16;
				ИндексКартинки = 1;
			ИначеЕсли Выб.Реквизит = ПланыВидовХарактеристик.ВидыРеквизитовКонтрагентов.Web Тогда
				Картинка = БиблиотекаКартинок.Web16;
				ИндексКартинки = 2;
			ИначеЕсли Выб.Реквизит = ПланыВидовХарактеристик.ВидыРеквизитовКонтрагентов.Другое Тогда
				Картинка = БиблиотекаКартинок.Разное16;
				ИндексКартинки = 4;
			ИначеЕсли ВыбГруппа.Реквизит = ПланыВидовХарактеристик.ВидыРеквизитовКонтрагентов.РегистрационныеДанные Тогда
				Картинка = БиблиотекаКартинок.Запись16;
				ИндексКартинки = 3;
			ИначеЕсли ВыбГруппа.Реквизит = ПланыВидовХарактеристик.ВидыРеквизитовКонтрагентов.Адреса Тогда
				Картинка = БиблиотекаКартинок.Адрес16;
				ИндексКартинки = 5;
			ИначеЕсли ВыбГруппа.Реквизит = ПланыВидовХарактеристик.ВидыРеквизитовКонтрагентов.КонтактныеЛица Тогда
				Картинка = БиблиотекаКартинок.Сотрудник16;
				ИндексКартинки = 6;	
			Иначе
				Картинка = Неопределено;
				ИндексКартинки = -1;
			КонецЕсли;
			Данные = Новый Структура("Реквизит, Родитель, ИндексКартинки", Выб.Реквизит, Выб.Родитель, ИндексКартинки);
			СЗ.Добавить(Данные, Строка(Выб.Реквизит),, Картинка);	
		КонецЦикла;	
	КонецЦикла;
	Возврат СЗ;
КонецФункции	

Функция СуществуетКонтрагентСУказаннымICE(ICE, ТекКонтрагент) Экспорт
	Возврат РеквизитыКонтрагентов.СуществуетКонтрагентСУказаннымICE(ICE, ТекКонтрагент);
КонецФункции
