////////////////////////////////////////////////////////////////////////////////
// Функции и процедуры обеспечения формирования бухгалтерских отчетов.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Вызывается при создании формы отчета на сервере для возможности дополнительной настройки.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - Форма отчета.
//
Процедура ПриСозданииНаСервере(Форма) Экспорт

КонецПроцедуры

// Вызывается при установке настроек по умолчанию для формы отчета.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - Форма отчета.
//
Процедура УстановитьНастройкиПоУмолчанию(Форма) Экспорт

КонецПроцедуры

// Выполняет установку макета оформления для отчета.
//
// Параметры:
//	ПараметрыОтчета - Структура - передается из формы отчета при запуске фонового задания отчета.
//		Может содержать ключ:
//			* МакетОформления - Строка - Название макета оформления.
//	НастройкаКомпоновкиДанных - НастройкиКомпоновкиДанных - Настройки, которые будут использоваться для отчета. 
//	СтандартнаяОбработка - Булево - Если установить внутри процедуры в Ложь, то стандартная обработка не будет выполняться.
//
Процедура УстановитьМакетОформленияОтчета(ПараметрыОтчета, НастройкаКомпоновкиДанных, СтандартнаяОбработка) Экспорт

КонецПроцедуры

// Позволяет ограничить суммовые показатели справки-расчета.
//
// Параметры:
//   ПоддерживаемыеНаборы - см. СправкиРасчетыКлиентСервер.ВсеНаборыСуммовыхПоказателей - 
//
// Возвращаемое значение:
//   см. СправкиРасчетыКлиентСервер.ВсеНаборыСуммовыхПоказателей - 
//
Процедура ПустыеПараметрыОтчетаВедомостьАмортизацииОС(ПараметрыОтчета) Экспорт
	
	ПараметрыОтчета.ИдентификаторОтчета = "ВедомостьАмортизацииОСБухгалтерскийУчет";
	
	НаборПоказателей = Новый Массив;
	НаборПоказателей.Добавить("БУ");
	
	БухгалтерскиеОтчеты.ДобавитьПоказателиВПараметры(ПараметрыОтчета, НаборПоказателей);
	
КонецПроцедуры

// Добавляет к структуре параметров ключи, специфичные для данного отчета.
//
// Параметры:
//  ПараметрыОтчета - см. ЗаполнениеФинОтчетностиВБанки.ПустыеПараметрыОтчетаВаловаяПрибыль()
//
Процедура ПустыеПараметрыОтчетаВаловаяПрибыль(ПараметрыОтчета) Экспорт
	
КонецПроцедуры

// Заполняет настройки СКД на основе настроек, переданных в структуре.
//
// Параметры:
//   КомпоновщикНастроек - КомпоновщикНастроекКомпоновкиДанных - из настраиваемого отчета.
//   НовыеПользовательскиеНастройкиКД - ПользовательскиеНастройкиКомпоновкиДанных - в ДополнительныеСвойства содержат параметры настройки.
//
// См. реализацию процедуры ПриЗагрузкеПользовательскихНастроекНаСервере() в модуле объекта отчета, вызываемую согласно
// настройкам из ОтчетыКлиентСервер.НастройкиОтчетаПоУмолчанию()
//
Процедура ПриЗагрузкеПользовательскихНастроек(Отчет, НовыеПользовательскиеНастройкиКД, КомпоновщикНастроек) Экспорт

КонецПроцедуры

// Вызывается в обработчике одноименного события формы отчета после выполнения кода формы.
//
// Параметры:
//   КомпоновщикНастроек - КомпоновщикНастроекКомпоновкиДанных - из настраиваемого отчета.
//   НовыеПользовательскиеНастройкиКД - ПользовательскиеНастройкиКомпоновкиДанных - в ДополнительныеСвойства содержат параметры настройки.
//   Форма - ФормаКлиентскогоПриложения - форма отчета.
//
// См. реализацию процедуры ПриЗагрузкеПользовательскихНастроекНаСервере() в модуле объекта отчета, вызываемую согласно
// настройкам из ОтчетыКлиентСервер.НастройкиОтчетаПоУмолчанию()
//
Процедура ПриЗагрузкеПользовательскихНастроекНастройкаФормы(Форма, НовыеПользовательскиеНастройкиКД, КомпоновщикНастроек) Экспорт

КонецПроцедуры

// Формирует представление для списка активных отборов в отчете.
//
// Параметры:
//  ПараметрыОтчета - Структура - может содержать свойство "Подразделение".
//  КомпоновщикНастроек - КомпоновщикНастроекКомпоновкиДанных - источник отборов.
//  СтандартнаяОбработка - Булево - возвращаемое значение. Если Ложь, то ТекстОтбор считается заполненным.
//  ТекстОтбор   - возвращаемое значение. Представление отборов.
//
Процедура ОписаниеОтборовОтчета(ПараметрыОтчета, КомпоновщикНастроек, СтандартнаяОбработка, ТекстОтбор) Экспорт
	
КонецПроцедуры

// Дополняет список счетов учета товаров.
//
// Параметры:
//  СчетаУчетаТоваров - Массив из ПланСчетовСсылка.Хозрасчетный - счета и субсчета учета товаров.
//
Процедура СчетаУчетаТоваров(СчетаУчетаТоваров) Экспорт

КонецПроцедуры

// Вызывается перед компоновкой макета бух. отчетов, выводит информацию по валютам регл., упр. и фин. отчетности,
//	если соответствующие показатели выбраны.
//	Параметры:
//		КомпоновщикНастроек - компоновщик настроек отчета;
//		ПараметрыОтчета - Структура - см. функцию "ПодготовитьПараметрыОтчета" форм бух. отчетности.
//
Процедура УстановитьПараметрыВалют(Схема, КомпоновщикНастроек, ПараметрыОтчета) Экспорт


КонецПроцедуры

// Вызывается после вывода результата, для корректировки фиксации сверху отчета (вывод доп. параметров влияет на высоту отчета)
//
// Параметры:
//  Схема - СхемаКомпоновкиДанных - схема компоновки данных отчета.
//  КоличествоСтрокПараметров - Число - число по которому будем фиксировать шапку отчета.
//
Процедура ВысотаВыводимыхПараметров(Схема, КоличествоСтрокПараметров) Экспорт


КонецПроцедуры

// Вызывается в местах, где требуется получить полный список показателей отчета. Дополняет список показателями, существующими только в
// данной конфигурации.
//
// Параметры:
//  МассивПоказателей - Массив - см. ПолучитьНаборПоказателей() в модуле менеджера отчета.
//  НеДобавлятьРазницу - Булево - не добавляеть в список показателей те, которые является производными от других, и служат лишь для сверки.
//
Процедура ДополнительныеПоказателиБухгалтерскихОтчетов(МассивПоказателей, НеДобавлятьРазницу = Ложь) Экспорт
	
	Если НеДобавлятьРазницу Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

// Вызывается при переносе значений параметров отчета из формы в структуру параметров. Дополняет список флагов, определяющих использование
// показателей отчета, теми показателями, которые существуют только в данной конфигурации.
//
// Параметры:
//  ПараметрыОтчета - Структура - см. ПодготовитьПараметрыОтчета() в форме отчета.
//  Отчет        - ОтчетОбъект - объект с реквизитами отчета.
//  НеДобавлятьРазницу - Булево - не добавляеть в список показателей те, которые является производными от других, и служат лишь для сверки.
//
Процедура ДополнительныеПараметрыОтчета(ПараметрыОтчета, Отчет, НеДобавлятьРазницу = Ложь) Экспорт
	
КонецПроцедуры

// Вызывается при инициализации реквизитов отчета. Устанавливает флаги использования показателей отчета, которые существуют
// только в данной конфигурации.
//
// Параметры:
//  Отчет        - ОтчетОбъект - объект с реквизитами отчета.
//
Процедура ДополнительноеУправлениеПоказателями(Отчет) Экспорт
	
КонецПроцедуры

// Вызывается для установки настроек отчета по-умолчанию. Добавляет использование группировок отчета, которые существуют только в
// данной конфигурации.
//
// Параметры:
//  Отчет        - ОтчетОбъект - объект с реквизитами отчета.
//
Процедура ДобавитьДополнительныеГруппировки(Отчет) Экспорт


КонецПроцедуры

// Вызывается для установки настроек отчета по-умолчанию. Добавляет использование отборов отчета, которые существуют только в
// данной конфигурации.
//
// Параметры:
//  Отчет        - ОтчетОбъект - объект с реквизитами отчета.
//
Процедура ДобавитьДополнительныеОтборы(Отчет) Экспорт
	

КонецПроцедуры

// Дополняем показатели расшифровки данными по упр. и фин. отчетности.
//	Параметры:
//		НастройкиРасшифровки - Структура;
//		Отчет - ОтчетОбъект - отчет, для которого производится расшифровка;
//
Процедура ДополнитьНастройкуРасшифровкиПоказателямиУправленческогоУчетаИОтчетности(НастройкиРасшифровки, Отчет) Экспорт
	
	
КонецПроцедуры

// Добавляет на форму отчета новые элементы формы - показатели упр. и фин. отчетности
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - Форма отчета.
//
Процедура ДобавитьПоказателиУправленческогоУчетаИОтчетности(Форма) Экспорт

	
КонецПроцедуры

// Вызывается перед проверкой заполнения отчета, обнуляет показатели отчета, если они ранее были скрыты по ФО.
//	Параметры:
//		Отчет - ОтчетОбъект - отчет, для которого проводится проверка заполнения.
//
Процедура ПередПроверкойЗаполнения(Отчет) Экспорт

	
КонецПроцедуры

// Позволяет ограничить суммовые показатели справки-расчета.
//
// Параметры:
//   ПоддерживаемыеНаборы - см. СправкиРасчетыКлиентСервер.ВсеНаборыСуммовыхПоказателей - 
//
// Возвращаемое значение:
//   см. СправкиРасчетыКлиентСервер.ВсеНаборыСуммовыхПоказателей - 
//
Процедура РазрешенныеНаборыСуммовыхПоказателей(ПоддерживаемыеНаборы) Экспорт


КонецПроцедуры

// Для недоступных по функциональным опциям показателей отчета принудительно проставляет значение Ложь.
//
// Параметры:
//  ПараметрыОтчета - Структура - см. в модуле менеджера отчета функцию ПустыеПараметрыКомпоновкиОтчета().
//
Процедура ОтключитьНедоступныеПоказатели(ПараметрыОтчета) Экспорт
	
КонецПроцедуры

// Подбирает вариант дополнительного набора данных, поля которого должны быть доступны для использования в СКД.
//
// Параметры:
//  ТипПоля      - ОписаниеТипов - анализируемый набор типов поля СКД.
//  ИмяНабора    - Строка - возвращаемый параметр. Имя дополнительного набора данных: ОС, НМА или ФизЛица.
//
Процедура ПодобратьДополнительныйНаборДанных(ТипПоля, ИмяНабора) Экспорт
	
КонецПроцедуры

// Устанавливает настройки отчета ШахматнаяВедомость, специфичные для данной конфигурации.
//
Процедура ДобавитьВидСуммОтчета(Форма) Экспорт
	
	
КонецПроцедуры

// Вызывается при открытии отчета. Удаляет с формы ссылки на элементы справки, не поддерживаемые в данной конфигурации.
//
Процедура УдалитьСсылкуНаСправкуИзОписанияФорматированнойСтроки(Форма) Экспорт


КонецПроцедуры

// Вызывается из обработчика события "ПриЗагрузкеПользовательскихНастроекНаСервере" формы отчета.
//
// Параметры:
//	ФормаОтчета   - ФормаКлиентскогоПриложения - Форма отчета.
//
Процедура ПроверитьАктуальность(ФормаОтчета) Экспорт


КонецПроцедуры

// Вызывается из процедуры "СформироватьОтчетНаСервере" формы отчета.
//
// Параметры:
//  Отчет         - ОтчетОбъект - объект с реквизитами отчета.
//	ФормаОтчета   - Число - признак вида суммы.
//
Процедура ОпределениеВидаСуммыОтчета(Отчет, ВидСуммыФормированияОтчета) Экспорт

	
КонецПроцедуры

#КонецОбласти
