
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТЗМаски.Загрузить(РегистрыСведений.РеквизитыКонтрагентов.ПолучитьМаскиТелефонныхНомеров());
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ЧастноеЛицо;
		Объект.Покупатель = Истина;
	КонецЕсли;
	НастроитьФорму();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	НЗ = РегистрыСведений.РеквизитыКонтрагентов.СоздатьНаборЗаписей();
	НЗ.Отбор.Контрагент.Установить(Объект.Ссылка);
	
	Если ЗначениеЗаполнено(Телефон) Тогда 
		НС = НЗ.Добавить();
		НС.Контрагент = Объект.Ссылка;
		НС.Реквизит = ПланыВидовХарактеристик.ВидыРеквизитовКонтрагентов.Телефон;
		НС.Представление = Телефон;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(EMail) Тогда 
		НС = НЗ.Добавить();
		НС.Контрагент = Объект.Ссылка;
		НС.Реквизит = ПланыВидовХарактеристик.ВидыРеквизитовКонтрагентов.EMail;
		НС.Представление = EMail;
	КонецЕсли;

	Если ЗначениеЗаполнено(Объект.CIN) Тогда 
		НС = НЗ.Добавить();
		НС.Контрагент = Объект.Ссылка;
		НС.Реквизит = ПланыВидовХарактеристик.ВидыРеквизитовКонтрагентов.CIN;
		НС.Представление = Объект.CIN;
	КонецЕсли;

	Если ЗначениеЗаполнено(Объект.ICE) Тогда 
		НС = НЗ.Добавить();
		НС.Контрагент = Объект.Ссылка;
		НС.Реквизит = ПланыВидовХарактеристик.ВидыРеквизитовКонтрагентов.ICE;
		НС.Представление = Объект.ICE;
	КонецЕсли;

	НЗ.Записать(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗакрытьФорму = Ложь;
	Если Не ЗначениеЗаполнено(Маска) Тогда
		Мас = ТЗМаски.НайтиСтроки(Новый Структура("Страна", НСтр("fr = 'Maroc'; ru = 'Марокко'; en = 'Morocco'; es = 'Marruecos'")));
		УстановитьПараметрыНомера(Мас[0]);			
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрыНомера(Данные)
	Маска = Данные.Маска; 
	Элементы.Телефон.Маска = Маска;
КонецПроцедуры	

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если Не ЗакрытьФорму Тогда 
		СтандартнаяОбработка = Ложь;
		ЗакрытьФорму = Истина;
		Закрыть(Объект.Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидКонтрагентаПриИзменении(Элемент)
	НастроитьФорму();
КонецПроцедуры

&НаСервере
Процедура НастроитьФорму()
	Элементы.CIN.Видимость = Не Объект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ЮридическоеЛицо;
	Элементы.ICE.Видимость = Объект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ЮридическоеЛицо;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если РеквизитыКонтрагентовВызовСервера.СуществуетКонтрагентСУказаннымICE(Объект.ICE,Объект.Ссылка) Тогда
		ТекстСообщения = НСтр("fr = 'Contrepartie avec ce ICE existe déjà !'; ru = 'Контрагент с таким идентификационным номеров уже существует!'; en = 'A counterparty with such identification numbers already exists!'; es = 'La contraparte con estos números de identificación ya existe!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Отказ = Истина;
		возврат;
	КонецЕсли;
КонецПроцедуры
