
#Область Номенклатура

Функция ПолучитьДанныеВыбораНоменклатуры(ПараметрыПолученияДанных) Экспорт
	Возврат Справочники.Номенклатура.ПолучитьДанныеВыбора(ПараметрыПолученияДанных);	
КонецФункции

Функция КоличествоЕдиницыТолькоЦелое(Номенклатура, Упаковка) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВЗ.Единица КАК Единица
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		ВЫБОР
	                      |			КОГДА &Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	                      |				ТОГДА ВЫРАЗИТЬ(&Номенклатура КАК Справочник.Номенклатура).Единица
	                      |			ИНАЧЕ ВЫРАЗИТЬ(&Упаковка КАК Справочник.УпаковкиЕдиницыИзмерения).Единица
	                      |		КОНЕЦ КАК Единица) КАК ВЗ
	                      |ГДЕ
	                      |	ВЗ.Единица.ТипИзмеряемойВеличины В (ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук), ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Упаковка))");
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Упаковка", Упаковка);
	Рез = Запрос.Выполнить();
	Возврат Не Рез.Пустой();			
КонецФункции	

#КонецОбласти  

#Область Разное  

Функция ПолучитьСтатусЗаказПокупателя(ЗаказПокупателя) Экспорт
	
	Результат = Перечисления.СтатусыЗаказовПокупателя.Новый;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ИсторияЗаказовПокупателейПоСтатусамСрезПоследних.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ИсторияЗаказовПокупателейПоСтатусамСрезПоследних.СтатусЗаказаПокупателя КАК СтатусЗаказаПокупателя
	|ИЗ
	|	РегистрСведений.ИсторияЗаказовПокупателейПоСтатусам.СрезПоследних(, ЗаказПокупателя = &ЗаказПокупателя) КАК ИсторияЗаказовПокупателейПоСтатусамСрезПоследних";
	Запрос.УстановитьПараметр("ЗаказПокупателя",ЗаказПокупателя); 
	
	Выборка = Запрос.Выполнить().Выгрузить();
	
	Если Выборка.Количество() = 0 Тогда Иначе
		Результат = Выборка[0].СтатусЗаказаПокупателя;	
	КонецЕсли;

	Возврат Результат; 
КонецФункции

Процедура ДобавитьКомментарий(Владелец, Описание, Адресат = Неопределено) Экспорт
	РегистрыСведений.КонтекстныеОбсуждения.ДобавитьСобытие(Владелец, Описание, Адресат);	
КонецПроцедуры

Функция ПолучитьНепоказанныеСистемныеОповещения() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Результат = Новый Массив;	
	ТЗ = РегистрыСведений.СистемныеОповещения.ПолучитьНеотображённые(ПараметрыСеанса.Пользователь);
	Для Каждого Стр Из ТЗ Цикл
		Результат.Добавить(Новый Структура("Описание, НавигационнаяСсылка", Стр.Описание, Стр.НавигационнаяСсылка));
		РегистрыСведений.СистемныеОповещения.ОтметитьКакОтображённое(Стр.Сотрудник, Стр.ID);
	КонецЦикла;	
	Возврат Результат; 
КонецФункции

Функция ПолучитьСуммуОснованияДляПлатёжногоДокумента(Документ) Экспорт
	Если ТипЗнч(Документ) = Тип("СправочникСсылка.Контрагенты") Тогда
		СуммаДокумента = 0;
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.КорректировкаДолга") Тогда
		СуммаДокумента = 0;	
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ПлатёжнаяВедомостьНаАванс") 
		Или ТипЗнч(Документ) = Тип("ДокументСсылка.ВыплатаЗарплаты") Тогда
		СуммаДокумента = Документ.Сумма-ДенежныеСредства.ПолучитьОстатокВыплатыЗПОснованию(Документ,Истина);
	Иначе	
		СуммаДокумента = Документ.Сумма;
	КонецЕсли;	
	Результат = Новый Структура("Сумма, СтавкаНДС, СуммаНДС, НесколькоСтавокНДС, РасшифровкаНДС", СуммаДокумента,, 0, Ложь, ""); 
	МасРасшифровкаНДС = Новый Массив;
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Или
		ТипЗнч(Документ) = Тип("ДокументСсылка.РеализацияТоваровУслуг")  Тогда
		ТЗ = Документ.ТЧТовары.Выгрузить(, "СтавкаНДС, СуммаНДС, СуммаСНДС");
		ТЗ.Свернуть("СтавкаНДС", "СуммаНДС, СуммаСНДС");
		Если ТЗ.Количество() = 1 Тогда
			ЗаполнитьЗначенияСвойств(Результат, ТЗ[0], "СтавкаНДС, СуммаНДС");
		ИначеЕсли ТЗ.Количество() > 1 Тогда	
			Результат.СуммаНДС = ТЗ.Итог("СуммаНДС");
			Результат.НесколькоСтавокНДС = Истина;
			МасРасшифровкаНДС = РаботаСДокументами.КонвертироватьНДСПлатёжногоДокументаВМассив(ТЗ);	
		КонецЕсли;
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств") Или 
		ТипЗнч(Документ) = Тип("ДокументСсылка.СписаниеБезналичныхДенежныхСредств") Или
		ТипЗнч(Документ) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Или
		ТипЗнч(Документ) = Тип("ДокументСсылка.РасходныйКассовыйОрдер") Тогда
		Результат.Сумма = Документ.Сумма;	
	КонецЕсли;
	Результат.РасшифровкаНДС = ОбщегоНазначенияКлиентСервер.КонвертироватьВJSON(МасРасшифровкаНДС);
	Возврат Результат;	
КонецФункции	

Функция ПолучитьСуммуДокумента(Док) Экспорт
	Возврат ?(ЗначениеЗаполнено(Док), Док.Сумма, 0);		
КонецФункции	

Функция ПолучитьГраницуДокумента(Знач ДокОбъект) Экспорт
	Ссылка = ДокОбъект.Ссылка;
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Если ДокОбъект.Дата = Ссылка.Дата Тогда		
			Возврат Новый Граница(Ссылка.МоментВремени(), ВидГраницы.Исключая);
		Иначе
			Возврат Новый Граница(ДокОбъект.Дата, ВидГраницы.Исключая);	
		КонецЕсли;	
	Иначе
		Возврат ТекущаяДатаСеанса();	
	КонецЕсли;			
КонецФункции	

Функция ПолучитьКуратораДоговора(Договор,Дата = Неопределено) Экспорт
	Возврат Справочники.ДоговорыСКонтрагентами.ПолучитьКуратораДоговора(Договор,Дата);
КонецФункции // ()

Функция КлиентуЗапрещеноОтгружать(Контрагент, ДатаОтгрузки) Экспорт
	Возврат Контрагент.ЗапретОтгрузок;
КонецФункции

#КонецОбласти 


