
#Область Форма

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.НаборУпаковок = Справочники.НаборыУпаковок.ИндивидуальныйДляНоменклатуры Тогда
		ИспользованиеУпаковок = "ИндивидуальныйНабор";
	Иначе
		ИспользованиеУпаковок = "ОбщийНабор";
	КонецЕсли; 
	
	ЗаполнитьКартинки();
	
	Если Параметры.Свойство("Штрихкод") Тогда 
		Штрихкод = Параметры.Штрихкод;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда 
		Объект.Единица = Константы.ЕдиницаПоУмолчанию.Получить();
		Объект.СтавкаНДС = Константы.СтавкаНДСПоУмолчанию.Получить();
	КонецЕсли; 
	
	ЗаполнитьМинОстаткиНаСервере();
	ЗаполнитьЦеныНаСервере();
	Элементы.ЗакупочнаяЦена.ТолькоПросмотр = Не ЗакупочнаяЦена = 0;
	Элементы.ГруппаЦены.Видимость = Не РольДоступна("PDV");
	
	ИспользоватьПроизводство = ПолучитьФункциональнуюОпцию("Производство");
	КомплектИспользован = Справочники.Номенклатура.КомплектИспользованВДокументах(Объект.Ссылка);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПараметрыФормыПоУмолчанию()
	
	Если ИспользоватьПроизводство Тогда 
		НадписьТехнологическаяКарта = "На изготовление 1 " + Объект.Единица + " требуется сырья и полуфабриков в объеме: ";
	КонецЕсли;
	
	ЭтоПолуфабрикат = Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Полуфабрикат");
	ЭтоПродукция 	= Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Продукция");
	ЭтоКомплект 	= Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Комплект");

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	//Изображение = ПолучитьНавигационнуюСсылку(ТекущийОбъект.Ссылка, "Изображение");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ЗаполнитьПараметрыФормыПоУмолчанию();
	// Изображения и присоединённые файлы товара берутся с диска компьютера: в веб-клиенте
	// это возможно только через расширение для работы с 1С:Предприятием.
	РасширениеРаботыС1СПредприятиемКлиент.Подключить(Неопределено,
		НСтр("ru = 'Для работы с изображениями и файлами товара установите расширение для работы с 1С:Предприятием.';
			|fr = 'Pour travailler avec les images et les fichiers de l''article, installez l''extension pour travailler avec 1C:Entreprise.';
			|en = 'To work with item images and files, install the 1C:Enterprise extension.';
			|es = 'Para trabajar con las imágenes y los archivos del artículo, instale la extensión para trabajar con 1C:Empresa.'"));
	УстановитьВидимостьЭлементов(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Не ПроверкаНаДубли() Тогда
		ТекстСообщения = НСтр("fr = 'Produit avec ce ID existe déjà !'; ru = 'Товар с таким артикулом уже существует!'; en = 'A product with such an article already exists!'; es = 'El producto con este artículo ya existe!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Отказ = Истина;
		возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.НаименованиеПолное) Тогда
		Объект.НаименованиеПолное = Объект.Наименование;	
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
		Объект.Наименование = Объект.НаименованиеПолное;	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//ОбщегоНазначения.ЗаписатьДанныеВХранилищеЗначения(ТекущийОбъект, "Изображение", Изображение);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(Штрихкод) Тогда
		НЗ = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();
		НЗ.Штрихкод = Штрихкод;
		НЗ.Номенклатура = Объект.Ссылка;
		НЗ.Записать(Истина);
	КонецЕсли;
	ШК = РегистрыСведений.ШтрихкодыНоменклатуры.ПолучитьШК(Объект.Ссылка);
	Если (ШК = "" или ШК<>Объект.Артикул) И ЗначениеЗаполнено(Объект.Артикул) Тогда
		НЗ = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();
		НЗ.Штрихкод = Объект.Артикул;
		НЗ.Номенклатура = Объект.Ссылка;
		НЗ.Записать(Истина);
	КонецЕсли;
	//ШК = РегистрыСведений.ШтрихкодыНоменклатуры.ПолучитьШК(Объект.Ссылка);
	//Если ШК = "" Тогда
	//	НЗ = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();
	//	НЗ.Штрихкод = РегистрыСведений.ШтрихкодыНоменклатуры.СформироватьEAN13();
	//	НЗ.Номенклатура = Объект.Ссылка;
	//	НЗ.Записать(Истина);
	//КонецЕсли;
	//Изображение = ПолучитьНавигационнуюСсылку(ТекущийОбъект.Ссылка, "Изображение");
	Если СохранитьЦены Тогда
		Если ДокУстановкаЦен = Документы.УстановкаЦенНоменклатурыВручную.ПустаяСсылка() Тогда 
			Док = Документы.УстановкаЦенНоменклатурыВручную.СоздатьДокумент();
			Док.Ответственный = ПараметрыСеанса.Пользователь;	
		Иначе
			Док = ДокУстановкаЦен.ПолучитьОбъект();
			Док.ТЧЦены.Очистить();
		КонецЕсли;
		Док.Номенклатура = Объект.Ссылка;
		Док.Дата = ТекущаяДатаСеанса();
		Для Каждого Стр из ТЗЦены Цикл 
			Если Стр.Цена = 0 Тогда Продолжить; КонецЕсли;
			НС = Док.ТЧЦены.Добавить();
			НС.ВидЦены = Стр.ВидЦены;
			НС.Цена = Стр.Цена;
		КонецЦикла;
		Док.Записать(РежимЗаписиДокумента.Проведение);
		ДокУстановкаЦен = Док.Ссылка;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Для Каждого Стр из ТЗХранение Цикл
		МЗ = РегистрыСведений.МинимальныйОстатокПоСкладам.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ,Стр);
		МЗ.Активность = Истина;
		МЗ.Номенклатура = Объект.Ссылка;
		МЗ.Записать(Истина);
	КонецЦикла;
КонецПроцедуры


#КонецОбласти // Форма





#Область ПрограмныйИнтерфейс

&НаКлиенте
Процедура УстановитьВидимостьЭлементов() 
	
	Элементы.ГруппаИндивидуальныйНаборУпаковок.Видимость = Объект.ИспользоватьУпаковки;
	Элементы.ГруппаОбщийНаборУпаковок.Видимость = Объект.ИспользоватьУпаковки;
	Элементы.Единица.Доступность = Истина;
	
	Если ИспользованиеУпаковок = "ИндивидуальныйНабор" Тогда
		Элементы.НаборУпаковок.Видимость = Ложь;
		Элементы.ГиперссылкаПерейтиУпаковкиНабора.Видимость = Ложь;
		Элементы.ГиперссылкаПерейтиУпаковкиНоменклатуры.Видимость = Истина;		
	Иначе
		Элементы.НаборУпаковок.Видимость = Истина;
		Элементы.ГиперссылкаПерейтиУпаковкиНабора.Видимость = Истина;
		Элементы.ГиперссылкаПерейтиУпаковкиНоменклатуры.Видимость = Ложь;
		Если Объект.ИспользоватьУпаковки Тогда
			Элементы.Единица.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли; 
	
	Элементы.СтраницаТехкарта.Видимость = ЭтаФорма.ИспользоватьПроизводство И (ЭтоПолуфабрикат ИЛИ ЭтоПродукция);

	Элементы.СтраницаКомплект.Видимость = ЭтоКомплект;
	Элементы.СтраницаХранение.Видимость = Не ЭтоКомплект;
	Элементы.СоставКомплекта.ТолькоПросмотр = КомплектИспользован;

КонецПроцедуры

&НаКлиенте
Процедура ПослеДобавленияУдаленияКартинок(Результат, ДопПараметры) Экспорт
	ЗаполнитьКартинки();
КонецПроцедуры

&НаСервере
Процедура УстановитьЕдиницуНабораУпаковок()
	Если Объект.НаборУпаковок <> Справочники.НаборыУпаковок.ИндивидуальныйДляНоменклатуры Тогда
		Объект.Единица = Объект.НаборУпаковок.Единица;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКартинки()
	НЗ = РегистрыСведений.ПрисоединённыеФайлы.СоздатьНаборЗаписей();
	НЗ.Отбор.Объект.Установить(Объект.Ссылка);
	НЗ.Прочитать();
	Изображения.Загрузить(НЗ.Выгрузить());
	Изображения.Сортировать("ДатаДобавления убыв");
	Если Изображения.Количество()>0 Тогда 
		НомерКартинки = 1;
	КонецЕсли;
	ЗаполнитьИзображениеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзображениеНаСервере()
	Если НомерКартинки > Изображения.Количество() Тогда
		НомерКартинки = Изображения.Количество();
	КонецЕсли;
	Если НомерКартинки = 0 Тогда
		Изображение = "";
		УстановитьДоступностьКнопокКартинки();
		Возврат;
	КонецЕсли;
	ID = Изображения.Получить(НомерКартинки-1).ID;
	КлючЗаписиРег = РегистрыСведений.ПрисоединённыеФайлы.СоздатьКлючЗаписи(Новый Структура("Объект,ID", Объект.Ссылка,ID));
	Если Не КлючЗаписиРег.Пустой() Тогда
		Изображение = ПолучитьНавигационнуюСсылку(КлючЗаписиРег, "Данные");
	КонецЕсли;
	УстановитьДоступностьКнопокКартинки();
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьКнопокКартинки()
	Если НомерКартинки = 0 Тогда 
		Элементы.ИзображениеВлево.Доступность = Ложь;
		Элементы.ИзображениеВправо.Доступность = Ложь;
	Иначе
		Элементы.ИзображениеВлево.Доступность = НомерКартинки > 1;
		Элементы.ИзображениеВправо.Доступность = НомерКартинки < Изображения.Количество();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УдалитьИзображениеНаСервере(ID)
	КлючЗаписиРег = РегистрыСведений.ПрисоединённыеФайлы.СоздатьКлючЗаписи(Новый Структура("Объект,ID", Объект.Ссылка,ID));
	МасКлючей  = Новый Массив;
	МасКлючей.Добавить(КлючЗаписиРег);
	МасУдаляемыеФайлы = ПрисоединённыеФайлыВызовСервера.ПолучитьМассивУдаляемыхФайлов(МасКлючей);
	НЗ = РегистрыСведений.ПрисоединённыеФайлы.СоздатьНаборЗаписей();
	НЗ.Отбор.Объект.Установить(Объект.Ссылка);
	НЗ.Отбор.ID.Установить(ID);
	НЗ.Записать();
	ПрисоединённыеФайлыВызовСервера.УдалитьФайлыСДиска(МасУдаляемыеФайлы);
	ЗаполнитьКартинки();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМинОстаткиНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МестаХранения.Ссылка КАК МестоХранения,
	|	ЕСТЬNULL(МинимальныйОстатокПоСкладам.МаксимальноеКоличествоХранения, &МаксимальноеКоличествоХранения) КАК МаксимальноеКоличествоХранения,
	|	ЕСТЬNULL(МинимальныйОстатокПоСкладам.МинимальноеКоличествоХранения, &МинимальноеКоличествоХранения) КАК МинимальноеКоличествоХранения
	|ИЗ
	|	Справочник.МестаХранения КАК МестаХранения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МинимальныйОстатокПоСкладам КАК МинимальныйОстатокПоСкладам
	|		ПО МестаХранения.Ссылка = МинимальныйОстатокПоСкладам.МестоХранения
	|			И (МинимальныйОстатокПоСкладам.Номенклатура = &Номенклатура
	|				И НЕ &Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))";
	Запрос.УстановитьПараметр("Номенклатура", Объект.Ссылка);
	Запрос.УстановитьПараметр("МаксимальноеКоличествоХранения", Объект.МаксимальноеКоличествоХранения);
	Запрос.УстановитьПараметр("МинимальноеКоличествоХранения", Объект.МинимальноеКоличествоХранения);
	ТЗХранение.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКоличествоМинМакс(Команда)
	Для Каждого Стр из ТЗХранение Цикл
		Стр.МинимальноеКоличествоХранения = Объект.МинимальноеКоличествоХранения;
		Стр.МаксимальноеКоличествоХранения = Объект.МаксимальноеКоличествоХранения;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПроверкаНаДубли()
	Если Не ЗначениеЗаполнено(Объект.Артикул) Тогда 
		возврат истина;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Артикул = &Артикул
	|	И Номенклатура.ЭтоГруппа = ЛОЖЬ
	|	И Не Номенклатура.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Артикул", Объект.Артикул);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Возврат Запрос.Выполнить().Пустой();
КонецФункции

&НаСервере
Процедура ЗаполнитьЦеныНаСервере()
	Запрос = Новый Запрос;
	Если Объект.Ссылка.Пустая() Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыЦен.Ссылка КАК ВидЦены
		|ИЗ
		|	Справочник.ВидыЦен КАК ВидыЦен
		|ГДЕ
		|	НЕ ВидыЦен.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыЦен.Закупочная)
		|	И НЕ ВидыЦен.ПометкаУдаления";
	Иначе
		ТЗЦеныПоставщиков = РегистрыСведений.ЦеныНоменклатурыПоставщиков.СрезПоследних(,Новый Структура("Номенклатура",Объект.Ссылка));
		Если Не ТЗЦеныПоставщиков.Количество() = 0 Тогда
			ТЗЦеныПоставщиков.Сортировать("Период убыв");
			ЗакупочнаяЦена = ТЗЦеныПоставщиков.Получить(0).Цена;
		КонецЕсли;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыЦен.Ссылка КАК ВидЦены,
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
		|ИЗ
		|	Справочник.ВидыЦен КАК ВидыЦен
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, Номенклатура = &Номенклатура) КАК ЦеныНоменклатурыСрезПоследних
		|		ПО ВидыЦен.Ссылка = ЦеныНоменклатурыСрезПоследних.ВидЦены
		|ГДЕ
		|	НЕ ВидыЦен.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыЦен.Закупочная)
		|	И НЕ ВидыЦен.ПометкаУдаления";
		Запрос.УстановитьПараметр("Номенклатура", Объект.Ссылка);
	КонецЕсли;
	ТЗЦены.Загрузить(Запрос.Выполнить().Выгрузить());
	Для Каждого Стр из ТЗЦены Цикл 
		Стр.Наценка = ?(ЗакупочнаяЦена = 0,0, (Стр.Цена/ЗакупочнаяЦена-1)*100);
	КонецЦикла;
КонецПроцедуры


#КонецОбласти // ПрограммныйИнтерфейс  



#Область ЭлементыФормы

&НаКлиенте
Процедура ВидПриИзменении(Элемент)
	
	ЗаполнитьПараметрыФормыПоУмолчанию();
	УстановитьВидимостьЭлементов();     
	
КонецПроцедуры

&НаКлиенте
Процедура ИзображениеНажатие(Элемент, СтандартнаяОбработка)
	//РаботаСДокументамиКлиент.ЗаписатьЕслиНовый(ЭтаФорма);
	//Если Объект.Ссылка.Пустая() Тогда 
	//	Отказ = Истина;
	//КонецЕсли;
	//ПрисоединённыеФайлыКлиент.ВыбратьИзображение(ЭтаФорма, "Изображение", СтандартнаяОбработка);
	СтандартнаяОбработка = Ложь;
	Фильтр = "Все картинки (*.bmp;*.dib;*.rle;*.jpg;*.jpeg;*.tif;*.png)|*.bmp;*.dib;*.rle;*.jpg;*.jpeg;*.tif;*.png|" 
				+ "BMP (*.bmp;*.dib;*.rle)|*.bmp;*.dib;*.rle|"
				+ "JPEG (*.jpg;*.jpeg)|*.jpg;*.jpeg|"
				+ "TIFF (*.tif)|*.tif|"
				+ "PNG (*.png)|*.png|";
	Оп = Новый ОписаниеОповещения("ПослеДобавленияУдаленияКартинок",ЭтаФорма);
	ПрисоединённыеФайлыКлиент.ПрисоединитьФайлы(Объект.Ссылка,,Фильтр,Оп);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьИзображение(Команда)
	//ПрисоединённыеФайлыКлиент.УдалитьИзображение(ЭтаФорма, Изображение);
	Если НомерКартинки = 0 Тогда
		Возврат;
	КонецЕсли;
	СтрКартинки = Изображения.Получить(НомерКартинки-1);
	Если СтрКартинки = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	ID = СтрКартинки.ID;
	УдалитьИзображениеНаСервере(ID);
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьУпаковкиПриИзменении(Элемент)
	Если Объект.ИспользоватьУпаковки Тогда
		ИспользованиеУпаковок = "ИндивидуальныйНабор";
		ИспользованиеУпаковокИндивидуальныйНаборПриИзменении(Элемент);
	Иначе
		Объект.НаборУпаковок = Неопределено;
		УстановитьВидимостьЭлементов();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИспользованиеУпаковокИндивидуальныйНаборПриИзменении(Элемент)
	Объект.НаборУпаковок = ПредопределенноеЗначение("Справочник.НаборыУпаковок.ИндивидуальныйДляНоменклатуры");
	УстановитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ИспользованиеУпаковокОбщийНаборПриИзменении(Элемент)
	Объект.НаборУпаковок = Неопределено;
	УстановитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаПерейтиУпаковкиНоменклатурыНажатие(Элемент)
	РаботаСДокументамиКлиент.ЗаписатьЕслиНовый(ЭтаФорма, Истина);
	Отбор = Новый Структура;
	Отбор.Вставить("Владелец", Объект.Ссылка);
	Отбор.Вставить("ТипИзмеряемойВеличины", ПредопределенноеЗначение("Перечисление.ТипыИзмеряемыхВеличин.Упаковка"));
	П = Новый Структура("Отбор", Отбор);
	ОткрытьФорму("Справочник.УпаковкиЕдиницыИзмерения.ФормаСписка", П,, ЭтаФорма.УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаПерейтиУпаковкиНабораНажатие(Элемент)
	РаботаСДокументамиКлиент.ЗаписатьЕслиНовый(ЭтаФорма, Истина);
	Отбор = Новый Структура;
	Отбор.Вставить("Владелец", Объект.НаборУпаковок);
	Отбор.Вставить("ТипИзмеряемойВеличины", ПредопределенноеЗначение("Перечисление.ТипыИзмеряемыхВеличин.Упаковка"));
	П = Новый Структура("Отбор", Отбор);
	ОткрытьФорму("Справочник.УпаковкиЕдиницыИзмерения.ФормаСписка", П,, ЭтаФорма.УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура НаборУпаковокПриИзменении(Элемент)
	УстановитьЕдиницуНабораУпаковок();
	УстановитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ИзображениеВправо(Команда)
	НомерКартинки = НомерКартинки + 1;
	ЗаполнитьИзображениеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ИзображениеВлево(Команда)
	НомерКартинки = НомерКартинки - 1;
	ЗаполнитьИзображениеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТЗХранениеПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТЗХранениеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗакупочнаяЦенаПриИзменении(Элемент)
	Для Каждого Стр из ТЗЦены Цикл 
		Стр.Наценка = ?(ЗакупочнаяЦена = 0,0, (Стр.Цена/ЗакупочнаяЦена-1)*100);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТЗЦеныЦенаПриИзменении(Элемент)
	ТекСтр = Элементы.ТЗЦены.ТекущиеДанные;
	ТекСтр.Наценка = ?(ЗакупочнаяЦена = 0,0, (ТекСтр.Цена/ЗакупочнаяЦена-1)*100);
	СохранитьЦены = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТЗЦеныНаценкаПриИзменении(Элемент)
	ТекСтр = Элементы.ТЗЦены.ТекущиеДанные;
	ТекСтр.Цена = (ТекСтр.Наценка+100)*ЗакупочнаяЦена/100;
	СохранитьЦены = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТехнологическаяКартаНоменклатураПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТехнологическаяКарта.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		ТекущаяСтрока.ЕИ = ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(ТекущаяСтрока.Номенклатура, "Единица");
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти // ЭлементыФормы




