
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЕдиницаВладельца = Объект.Владелец.Единица;
	УстановитьДоступностьРеквизитов(Ложь);
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура ЕдиницаПриИзменении(Элемент)
	УстановитьДоступностьРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура ТипУпаковкиПриИзменении(Элемент)
	УстановитьДоступностьРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура ЧислительПриИзменении(Элемент)
	УстановитьДоступностьРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоУпаковокПриИзменении(Элемент)
	УстановитьДоступностьРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура РодительПриИзменении(Элемент)
	УстановитьДоступностьРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура ЗнаменательПриИзменении(Элемент)
	УстановитьДоступностьРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура ПоставляетсяВМногооборотнойТареПриИзменении(Элемент)
	УстановитьДоступностьРеквизитов(Ложь);
КонецПроцедуры

#КонецОбласти

#Область Дополнительно

&НаСервере
Процедура УстановитьДоступностьРеквизитов(ОбновитьНаименование = Истина)
	ТУКонечная = Перечисления.ТипыУпаковокНоменклатуры.Конечная;
	ТУСоставная = Перечисления.ТипыУпаковокНоменклатуры.Составная;
	ТУРазупаковка = Перечисления.ТипыУпаковокНоменклатуры.Разупаковка;
	Если Объект.ТипУпаковки = ТУКонечная Тогда
		Элементы.ГруппаЧислитель.Доступность = Истина;
		Элементы.ГруппаКоличествоУпаковок.Доступность = Ложь;
		Элементы.ГруппаЗнаменатель.Доступность = Ложь;
		//
		Объект.КоличествоУпаковок = 0;
		Объект.Родитель = Неопределено;
		Объект.Знаменатель = 1;
	ИначеЕсли Объект.ТипУпаковки = ТУСоставная Тогда
		Элементы.ГруппаЧислитель.Доступность = Ложь;
		Элементы.ГруппаКоличествоУпаковок.Доступность = Истина;
		Элементы.ГруппаЗнаменатель.Доступность = Ложь;
		//
		Объект.Числитель = Объект.КоличествоУпаковок * Объект.Родитель.Числитель;
		Объект.Знаменатель = 1;
	ИначеЕсли Объект.ТипУпаковки = ТУРазупаковка Тогда	
		Элементы.ГруппаЧислитель.Доступность = Ложь;
		Элементы.ГруппаКоличествоУпаковок.Доступность = Ложь;
		Элементы.ГруппаЗнаменатель.Доступность = Истина;
		//
		Объект.Числитель = 1;
		Объект.КоличествоУпаковок = 0;
		Объект.Родитель = Неопределено;		
	КонецЕсли;
	//
	Эл = Элементы.ТипУпаковки1.СписокВыбора.НайтиПоЗначению(ТУКонечная);
	Эл.Представление = "1 " + СокрЛП(Объект.Единица) + " состоит из";
	Эл = Элементы.ТипУпаковки2.СписокВыбора.НайтиПоЗначению(ТУСоставная);
	Эл.Представление = "1 " + СокрЛП(Объект.Единица) + " состоит из";
	Эл = Элементы.ТипУпаковки3.СписокВыбора.НайтиПоЗначению(ТУРазупаковка);
	Эл.Представление = "1 " + СокрЛП(ЕдиницаВладельца) + " состоит из";
	// 
	Если ОбновитьНаименование Тогда
		Объект.Наименование = Справочники.УпаковкиЕдиницыИзмерения.СформироватьНаименование(Объект.ТипУпаковки, Объект.Единица, Объект.Числитель, Объект.Знаменатель, ЕдиницаВладельца);	
	КонецЕсли;
КонецПроцедуры	

#КонецОбласти
