
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Для Каждого Страна Из РегистрыСведений.ПроизводственныйКалендарь.СтраныКалендаря() Цикл
		Элементы.СтранаКалендаря.СписокВыбора.Добавить(Страна.Значение, Страна.Представление + " (" + Страна.Значение + ")");
	КонецЦикла;
	СтранаКалендаря = Константы.СтранаКалендаря.Получить();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВыбранныйГод = Год(ТекущаяДата());
	ОтобразитьКалендарьНаВыбранныйГод();
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура ВыбранныйГодПриИзменении(Элемент)
	ОтобразитьКалендарьНаВыбранныйГод();
КонецПроцедуры

&НаКлиенте
Процедура СтранаКалендаряПриИзменении(Элемент)
	ЗаписатьСтрануКалендаря();
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНовыеВыходныеДни();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоУмолчанию(Команда)
	ЗаполнитьВыходныеДниПоУмолчанию();
	Элементы.ДатыВыходных.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ДатыВыходныхВыбор(Элемент, ВыбраннаяДата)
	НайденнаяДата = СЗВыходные.НайтиПоЗначению(ВыбраннаяДата); 
	Если НайденнаяДата = Неопределено Тогда // Добавляем дату
		СЗВыходные.Добавить(ВыбраннаяДата);	
	Иначе // Удаляем дату
		СЗВыходные.Удалить(НайденнаяДата);
	КонецЕсли;
	Элементы.ДатыВыходных.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ДатыВыходныхПриВыводеПериода(Элемент, ОформлениеПериода)
	ЦветВыходногоДня = Новый Цвет(255, 0, 0); // Красный
	ЦветБудничногоДня = Новый Цвет(0, 0, 0); // Черный
	Для Каждого Стр Из ОформлениеПериода.Даты Цикл
		Если СЗВыходные.НайтиПоЗначению(Стр.Дата) = Неопределено Тогда
			Стр.ЦветТекста = ЦветБудничногоДня;				
		Иначе
			Стр.ЦветТекста = ЦветВыходногоДня;
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

#КонецОбласти

#Область Дополнительно

&НаКлиенте
Процедура ОтобразитьКалендарьНаВыбранныйГод()
	НачалоПериода = Дата(ВыбранныйГод, 1, 1);
	КонецПериода = Дата(ВыбранныйГод, 12, 31, 23, 59, 59);
	// Ограничиваем период отображения календаря	
	Элементы.ДатыВыходных.НачалоПериодаОтображения = НачалоПериода;
	Элементы.ДатыВыходных.КонецПериодаОтображения = КонецПериода;
	// Получаем выходные из регистра
	МасВыходные = ПолучитьСписокВыходныхДат(НачалоПериода, КонецПериода);
	СЗВыходные.ЗагрузитьЗначения(МасВыходные);
	Если СЗВыходные.Количество() = 0 Тогда
		ЗаполнитьВыходныеДниПоУмолчанию();	
	КонецЕсли;
	Элементы.ДатыВыходных.Обновить();
КонецПроцедуры	

&НаСервере
Функция ПолучитьСписокВыходныхДат(НачалоПериода, КонецПериода)
	Возврат РегистрыСведений.ПроизводственныйКалендарь.ПолучитьВыходные(НачалоПериода, КонецПериода);
КонецФункции	

&НаСервере
Процедура ЗаписатьНовыеВыходныеДни()
	РегистрыСведений.ПроизводственныйКалендарь.ПерезаписатьВыходные(СЗВыходные);	
КонецПроцедуры	

&НаСервере
Процедура ЗаписатьСтрануКалендаря()
	Константы.СтранаКалендаря.Установить(ВРег(СокрЛП(СтранаКалендаря)));
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВыходныеДниПоУмолчанию()
	СЗВыходные.Очистить();
	ВыбДата = Дата(ВыбранныйГод, 1, 1);
	// Прописываем субботы и воскресения
	Пока Год(ВыбДата) = ВыбранныйГод Цикл
		ТекДеньНедели = ДеньНедели(ВыбДата); 
		Если ТекДеньНедели = 6 Или ТекДеньНедели = 7 Тогда
			СЗВыходные.Добавить(ВыбДата);	
		КонецЕсли;
		ВыбДата = ВыбДата + 86400;
	КонецЦикла;
	// Прописываем праздники страны из общего макета ПраздничныеДни
	Праздники = РегистрыСведений.ПроизводственныйКалендарь.ПраздничныеДни(СтранаКалендаря, ВыбранныйГод);
	Для Каждого Праздник Из Праздники Цикл
		Если СЗВыходные.НайтиПоЗначению(Праздник.Значение) = Неопределено Тогда
			СЗВыходные.Добавить(Праздник.Значение, Праздник.Представление);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры	

#КонецОбласти
