
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьПривилегированныйРежим(Истина);
	СохранятьНаДиск = Константы.ХранитьФайлыНаДиске.Получить();
	Если Не ЗначениеЗаполнено(Запись.Объект) и Параметры.Свойство("Объект") Тогда
		Запись.Объект = Параметры.Объект;	
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Запись.ID) Тогда
		Запись.ID = Новый УникальныйИдентификатор;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ПрисоединённыеФайлыВызовСервера.ПоместитьФайлВХранилище(ТекущийОбъект, ПутьКФайлу);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ПрисоединённыеФайлыВызовСервера.УдалитьДанныеИзВременногоХранилища(ПутьКФайлу);
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Асинх Процедура ПрикрепитьФайл(Команда)
	ДВФ = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДВФ.Заголовок = "Выберите файл для прикрепления";
	Обещание = ДВФ.ВыбратьАсинх();
	МасФайлы = Ждать Обещание;
	Если МасФайлы = Неопределено Тогда Возврат КонецЕсли;
	ПутьКФайлу = МасФайлы[0];
	Файл = Новый Файл(ПутьКФайлу);		
	Запись.ИмяФайла = Файл.ИмяБезРасширения;
	Запись.Расширение = СтрЗаменить(НРег(Файл.Расширение), ".", "");
	Обещание = Файл.РазмерАсинх();
	Размер = Ждать Обещание;
	Запись.Размер = Размер / (1024 * 1024);
	Оповещение = Новый ОписаниеОповещения("ПослеПомещенияФайланаСервер", ЭтотОбъект);
	НачатьПомещениеФайлаНаСервер(Оповещение,,,, ПутьКФайлу, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайл(Команда)
	МасКлючи = Новый Массив;
	МасКлючи.Добавить(Новый Структура("Объект, Связь, ID", Запись.Объект, Запись.Связь, Запись.ID));
	ПрисоединённыеФайлыКлиент.СохранитьФайлы(МасКлючи, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайл(Команда)
	Если Модифицированность и ЭтоАдресВременногоХранилища(ПутьКФайлу) Тогда
		Записать();	
	КонецЕсли;
	ПрисоединённыеФайлыКлиент.ОткрытьФайл(Параметры.Ключ, ЭтаФорма);		
КонецПроцедуры

#КонецОбласти

#Область Оповещения

&НаКлиенте
Процедура ПослеПомещенияФайланаСервер(ОписаниеПомещенногоФайла, ДополнительныеПараметры) Экспорт
	Если ОписаниеПомещенногоФайла = Неопределено Тогда Возврат КонецЕсли;
	ПутьКФайлу = ОписаниеПомещенногоФайла.Адрес;
	Запись.Внешний = СохранятьНаДиск;
	Модифицированность = Истина;	
КонецПроцедуры

#КонецОбласти
