
#Область Оборудование

Процедура ПодключитьОборудование(УникальныйИдентификаторФормы, СканерШК = Ложь) Экспорт
	МасТипыОборудования = Новый Массив;
	Если СканерШК Тогда
		МасТипыОборудования.Добавить("СканерШтрихкода");
	КонецЕсли;
	Если МасТипыОборудования.Количество() = 0 Тогда Возврат КонецЕсли;
	Оп = Новый ОписаниеОповещения("ПослеПодключенияОборудования", ОперацииСПодключаемымОборудованиемКлиент); 
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПоТипу(Оп, УникальныйИдентификаторФормы, МасТипыОборудования);	
КонецПроцедуры	

Процедура ОтключитьОборудование(УникальныйИдентификаторФормы, СканерШК = Ложь) Экспорт
	МасТипыОборудования = Новый Массив;
	Если СканерШК Тогда
		МасТипыОборудования.Добавить("СканерШтрихкода");
	КонецЕсли;
	Если МасТипыОборудования.Количество() = 0 Тогда Возврат КонецЕсли;
	Оп = Новый ОписаниеОповещения("ПослеОтключенияОборудования", ОперацииСПодключаемымОборудованиемКлиент); 
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПоТипу(Оп, УникальныйИдентификаторФормы, МасТипыОборудования);	
КонецПроцедуры

#КонецОбласти

#Область Обработка_данных

Функция ПолучитьШтрихкод(ИмяСобытия, Параметр, Источник) Экспорт
	Результат = "";
	Если Источник = "ПодключаемоеОборудование" Тогда  
		Если ИмяСобытия = "ScanData" Тогда // Данные приходят в виде строки
			Результат = Параметр[0];
		ИначеЕсли ИмяСобытия = "ScanDataBase64" Тогда // Данные приходят закодированные в Base64 
			Результат = Base64Значение(Параметр[0]); 
		КонецЕсли;
	КонецЕсли;
	Возврат ОбщегоНазначенияКлиентСервер.УдалитьНедопустимыеСимволыXML(Результат);
КонецФункции	

#КонецОбласти

#Область Оповещения

Процедура ПослеПодключенияОборудования(РезультатВыполнения, Параметры) Экспорт 
   Если Не РезультатВыполнения.Результат Тогда
      ТекстСообщения = НСтр("fr = 'Une erreur s''est produite lors de la connexion du périphérique: ""%ОписаниеОшибки%"".'; ru = 'При подключении оборудования произошла ошибка:""%ОписаниеОшибки%"".'; en = 'An error occurred when connecting the equipment: ""%ОписаниеОшибки%"".'; es = 'Se produjo un error al conectar el hardware: ""%ОписаниеОшибки%"".'");
      ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%" , РезультатВыполнения.ОписаниеОшибки);
      Сообщить(ТекстСообщения);
   КонецЕсли;
КонецПроцедуры

Процедура ПослеОтключенияОборудования(РезультатВыполнения, Параметры) Экспорт   
   Если Не РезультатВыполнения.Результат Тогда
      ТекстСообщения = НСтр("fr = 'Une erreur s''est produite lors de la déconnexion du matériel: ""%ОписаниеОшибки%"".'; ru = 'При отключении оборудования произошла ошибка: ""%ОписаниеОшибки%"".'; es = 'Se produjo un error al desconectar el hardware: ""%ОписаниеОшибки%"".'");
      ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%" , РезультатВыполнения.ОписаниеОшибки);
      Сообщить(ТекстСообщения);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти