#Область ПеременныеМодуля

&НаКлиенте
Перем ЦветФонаСдачи;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоСимволовПослеЗапятой = 2;
	ПервыйВвод = Истина;
	
	Если Параметры.Свойство("ИтогПоЧеку") Тогда
		СуммаОплаты   = Параметры.ИтогПоЧеку;
		ИтогПоЧеку    = Параметры.ИтогПоЧеку;
		СуммаСдачи    = 0;
		ВводимоеЧисло = Формат(СуммаОплаты, "ЧЦ=15; ЧДЦ=2; ЧГ=3,0");
	КонецЕсли;
	
	Если Параметры.Свойство("АдресТаблицыЧеков")
		И ЗначениеЗаполнено(Параметры.АдресТаблицыЧеков) Тогда
		ТабличноеПолеЧеков.Загрузить(ПолучитьИзВременногоХранилища(Параметры.АдресТаблицыЧеков));
		
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
	Параметры.Свойство("ДисконтнаяКарта"  , ДисконтнаяКарта);
	ПечатьЧека = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьФорму();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Команда0(Команда)
	
	ДобавитьЦифру("0")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	
	ДобавитьЦифру("1")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда2(Команда)
	
	ДобавитьЦифру("2")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда3(Команда)
	
	ДобавитьЦифру("3")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда4(Команда)
	
	ДобавитьЦифру("4")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда5(Команда)
	
	ДобавитьЦифру("5")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда6(Команда)
	
	ДобавитьЦифру("6")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда7(Команда)
	
	ДобавитьЦифру("7")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда8(Команда)
	
	ДобавитьЦифру("8")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда9(Команда)
	
	ДобавитьЦифру("9")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда0ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("0")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда1ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("1")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда2ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("2")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда3ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("3")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда4ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("4")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда5ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("5")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда6ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("6")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда7ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("7")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда8ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("8")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда9ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("9")
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаТочка(Команда)
	
	Если ПервыйВвод Тогда
		ВводимоеЧисло = "";
		ПервыйВвод = Ложь;
	КонецЕсли;
	
	Если ВводимоеЧисло = "" Тогда
		ВводимоеЧисло = "0";
	КонецЕсли;
	
	ЧислоВхождений = СтрЧислоВхождений(ВводимоеЧисло, ",");
	
	Если Не ЧислоВхождений > 0 Тогда
		ВводимоеЧисло = ВводимоеЧисло + ",";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаСтереть(Команда)
	ВводимоеЧисло = "";
	ПервыйВвод = Ложь;
	
	СуммаОплаты = 0;
	СуммаСдачи  = ИтогПоЧеку;
	Элементы.КомандаEnterПраваяКлавиатура.Доступность = Ложь;
	Элементы.КомандаEnter.Доступность = Ложь;
	
	Элементы.КомандаEmail.Доступность = Ложь;
	Элементы.КомандаSMS.Доступность   = Ложь;
	
	ОбновитьФорму();
КонецПроцедуры

&НаКлиенте
Процедура КомандаEnter(Команда)
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("Действие"   , НСтр("en = 'Close the receipt'; fr = 'Fermer le chèque'; ru = 'Закрыть чек'; es = 'Cerrar cheque'"));
	
	СуммаОплатыЧисло = ПривестиСтрокуКЧислу(ВводимоеЧисло, Ложь);
	Для каждого СтрокаТабличноеПолеЧеков Из ТабличноеПолеЧеков Цикл
		СтрокаОплаты = Объект.Оплата.Добавить();
		СтрокаОплаты.ВидОплаты   = ПредопределенноеЗначение("Справочник.ВидыОплатЧекаККМ.Наличные");
		СтрокаОплаты.Организация = СтрокаТабличноеПолеЧеков.Организация;
		СтрокаОплаты.Сумма       = СтрокаТабличноеПолеЧеков.Сумма;
		СтрокаОплаты.КлючСвязиТПЧеков = СтрокаТабличноеПолеЧеков.КлючСвязиТПЧеков;
	КонецЦикла;
	
	Сдача = СуммаОплатыЧисло - Объект.Оплата.Итог("Сумма");
	Если Сдача > 0 Тогда
		СтрокаОплаты.Сумма = СтрокаОплаты.Сумма + Сдача;
	КонецЕсли;
	
	СтруктураОтвета.Вставить("АдресТаблицыОплата", АдресТаблицыОплата());
	
	Если ЗначениеЗаполнено(ДисконтнаяКарта) 
		И НЕ ОтказКлиентаОтСохраненияТелефонаEmail Тогда
		СтруктураОтвета.Вставить("СохранятьТелефонEmail");
	КонецЕсли;
	СтруктураОтвета.Вставить("Email"  , Email);
	СтруктураОтвета.Вставить("Телефон", Формат(Телефон, "ЧЦ=10; ЧДЦ=; ЧГ=0"));
	
	Закрыть(СтруктураОтвета);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ДобавитьЦифру(ВведеннаяЦифраСтрокой)
	
	Если ПервыйВвод Тогда
		Если ВведеннаяЦифраСтрокой = "0" Тогда
			Возврат;
		КонецЕсли;
		ВводимоеЧисло = "";
		ПервыйВвод = Ложь;
	КонецЕсли;
	
	Запятая = Сред(ВводимоеЧисло, СтрДлина(ВводимоеЧисло) - КоличествоСимволовПослеЗапятой, 1);
	
	Если НЕ Запятая = "," Тогда
		ВводимоеЧисло = ВводимоеЧисло + ВведеннаяЦифраСтрокой;
	КонецЕсли;
	
	СуммаОплаты = ПривестиСтрокуКЧислу(ВводимоеЧисло, Истина);
	
	ОбновитьФорму();
КонецПроцедуры

// Функция выполняет приведение строки к числу.
// Параметры:
//  ЧислоСтрокой           - Строка - Строка приводимая к числу.
//  ВозвращатьНеопределено - Булево - Если Истина и строка содержит некорректное значение, то возвращать Неопределено.
//
// Возвращаемое значение:
//  Число
//
&НаКлиенте
Функция ПривестиСтрокуКЧислу(ЧислоСтрокой, ВозвращатьНеопределено = Ложь)
	
	ОписаниеТипаЧисла = Новый ОписаниеТипов("Число");
	ЗначениеЧисла = ОписаниеТипаЧисла.ПривестиЗначение(ЧислоСтрокой);
	
	Если ВозвращатьНеопределено И (ЗначениеЧисла = 0) Тогда
		
		Стр = Строка(ЧислоСтрокой);
		Если Стр = "" Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Стр = СтрЗаменить(СокрЛП(Стр), "0", "");
		Если (Стр <> "") И (Стр <> ".") И (Стр <> ",") Тогда
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЗначениеЧисла;
	
КонецФункции

&НаСервере
Функция АдресТаблицыОплата()
	
	АдресТаблицыОплата = ПоместитьВоВременноеХранилище(Объект.Оплата.Выгрузить(), Новый УникальныйИдентификатор);
	
	Возврат АдресТаблицыОплата;
	
КонецФункции // АдресТаблицыОплата()

&НаКлиенте
Процедура ОбновитьФорму()
	
	Если СуммаОплаты >= ИтогПоЧеку Тогда
		СуммаСдачи = СуммаОплаты - ИтогПоЧеку;
		Элементы.КомандаEnterПраваяКлавиатура.Доступность = Истина;
		Элементы.КомандаEnter.Доступность = Истина;
		ЦветСдачи   = Новый Цвет(45, 115, 44);
		ЦветВнесено = Новый Цвет();
		ТекущийЭлемент = Элементы.КомандаEnter;
	Иначе
		СуммаСдачи = 0;
		Элементы.КомандаEnterПраваяКлавиатура.Доступность = Ложь;
		Элементы.КомандаEnter.Доступность = Ложь;
		ЦветСдачи   = Новый Цвет();
		ЦветВнесено =  Новый Цвет(190, 32, 80);
	КонецЕсли;
	
	Элементы.КомандаEmail.Доступность = ВозможностьЭлектронногоПлатежа;
	Элементы.КомандаSMS.Доступность   = ВозможностьЭлектронногоПлатежа;
	
	Элементы.СуммаСдачи.ЦветТекстаЗаголовка = ЦветСдачи;
	Элементы.СуммаСдачи.ЦветТекста          = ЦветСдачи;
	
	Элементы.ПолеВводимоеЧисло.ЦветТекстаЗаголовка = ЦветВнесено;
	Элементы.ПолеВводимоеЧисло.ЦветТекста          = ЦветВнесено;
	
	Если ЗначениеЗаполнено(ДанныеSMSИлиEmail)
		И ЗначениеЗаполнено(ДисконтнаяКарта) Тогда
		Если ОтказКлиентаОтСохраненияТелефонаEmail Тогда
			Элементы.ДекорацияОтказКлиентаОтСохраненияТелефонаEmail.Картинка = БиблиотекаКартинок.НеСохранять16;
		Иначе
			Элементы.ДекорацияОтказКлиентаОтСохраненияТелефонаEmail.Картинка = БиблиотекаКартинок.Сохранить16;
		КонецЕсли;
	Иначе
		Элементы.ДекорацияОтказКлиентаОтСохраненияТелефонаEmail.Картинка = БиблиотекаКартинок.Пустая;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
