#Область ПрограммныйИнтерфейс

// Перечисляет печатные формы объекта.
// См. ПечатныеФормы.НоваяКоллекцияКомандПечати
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - пополняемая коллекция команд печати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	Команда = КомандыПечати.Добавить();
	Команда.ИмяМакета = "Ведомость";
	Команда.Представление = НСтр("ru = 'Платёжная ведомость'; fr = 'Registre de paie';
		|en = 'Payroll register'; es = 'Registro de nóminas'");

	Команда = КомандыПечати.Добавить();
	Команда.ИмяМакета = "РасчетныйЛист";
	Команда.Представление = НСтр("ru = 'Расчётные листки'; fr = 'Bulletins de paie';
		|en = 'Pay slips'; es = 'Recibos de pago'");

КонецПроцедуры

// Формирует запрошенные печатные формы.
// См. ПечатныеФормы.СформироватьПечатныеФормы
//
// Параметры:
//  МассивОбъектов        - Массив          - печатаемые объекты
//  ПараметрыПечати       - Структура       - параметры команды печати
//  КоллекцияПечатныхФорм - ТаблицаЗначений - заполняемая коллекция печатных форм
//  ОбъектыПечати         - СписокЗначений  - соответствие объектов областям печати
//  ПараметрыВывода       - Структура       - параметры окна печати
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	Если ПечатныеФормы.НужноПечататьМакет(КоллекцияПечатныхФорм, "Ведомость") Тогда
		Таб = Новый ТабличныйДокумент;
		Для Каждого Док Из МассивОбъектов Цикл
			НомерСтрокиНачало = Таб.ВысотаТаблицы + 1;
			СформироватьВедомость(Док, Таб);
			ПечатныеФормы.ЗадатьОбластьПечати(Таб, НомерСтрокиНачало, ОбъектыПечати, Док);
		КонецЦикла;
		ПечатныеФормы.ВывестиТабличныйДокумент(КоллекцияПечатныхФорм, "Ведомость",
			НСтр("ru = 'Платёжная ведомость'; fr = 'Registre de paie';
			|en = 'Payroll register'; es = 'Registro de nóminas'"),
			Таб, "Документ.ВыплатаЗарплаты.Ведомость");
	КонецЕсли;

	Если ПечатныеФормы.НужноПечататьМакет(КоллекцияПечатныхФорм, "РасчетныйЛист") Тогда
		Таб = Новый ТабличныйДокумент;
		Для Каждого Док Из МассивОбъектов Цикл
			НомерСтрокиНачало = Таб.ВысотаТаблицы + 1;
			СформироватьРасчетныеЛистки(Док, Таб);
			ПечатныеФормы.ЗадатьОбластьПечати(Таб, НомерСтрокиНачало, ОбъектыПечати, Док);
		КонецЦикла;
		ПечатныеФормы.ВывестиТабличныйДокумент(КоллекцияПечатныхФорм, "РасчетныйЛист",
			НСтр("ru = 'Расчётные листки'; fr = 'Bulletins de paie';
			|en = 'Pay slips'; es = 'Recibos de pago'"),
			Таб, "Документ.ВыплатаЗарплаты.РасчетныйЛист");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

Процедура СформироватьВедомость(Док, Таб) Экспорт
	//////////////////////
	// Получаем области //
	//////////////////////	
	Таб.ТолькоПросмотр = Истина;
	Таб.ОтображатьСетку = Ложь;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.АвтоМасштаб = Истина;
	Макет = ПечатныеФормы.МакетПечатнойФормы("Документ.ВыплатаЗарплаты.Ведомость");
	оШапка = Макет.ПолучитьОбласть("Шапка");
	оСтрока = Макет.ПолучитьОбласть("Строка");
	оПодвал = Макет.ПолучитьОбласть("Подвал");
	////////////////////////////////////////////////////////
	// Получаем всех сотрудников из выбранных документов. // 
	// Это и будет основа для печати ведомости            //
	////////////////////////////////////////////////////////
	Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВыплатаЗПТабличнаяЧасть.Ссылка.Дата КАК Период,
	                      |	ВыплатаЗПТабличнаяЧасть.Ссылка.Дата КАК Дата,
	                      |	ВыплатаЗПТабличнаяЧасть.Ссылка.Номер КАК Номер,
	                      |	ВыплатаЗПТабличнаяЧасть.Сотрудник КАК Сотрудник,
	                      |	ВыплатаЗПТабличнаяЧасть.Сумма КАК Сумма
	                      |ИЗ
	                      |	Документ.ВыплатаЗарплаты.ТЧСотрудники КАК ВыплатаЗПТабличнаяЧасть
	                      |ГДЕ
	                      |	ВыплатаЗПТабличнаяЧасть.Ссылка В(&Документы)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВыплатаЗПТабличнаяЧасть.Сотрудник,
	                      |	ВыплатаЗПТабличнаяЧасть.Ссылка.Дата,
	                      |	ВыплатаЗПТабличнаяЧасть.Сумма,
	                      |	ВыплатаЗПТабличнаяЧасть.Ссылка.Номер,
	                      |	ВыплатаЗПТабличнаяЧасть.Ссылка.Дата
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Период,
	                      |	ВыплатаЗПТабличнаяЧасть.Сотрудник.Наименование");
	Запрос.УстановитьПараметр("Документы", Док);
	ТЗСотрудники = Запрос.Выполнить().Выгрузить();
	Ном = 1;
	ТЗСотрудники.Свернуть("Номер, Дата, Сотрудник", "Сумма");
	оШапка.Параметры.Заголовок = "Relevé de paie № " + ТЗСотрудники[0].Номер + " de " + Формат(ТЗСотрудники[0].Дата, "ДЛФ=DD");
	Таб.Вывести(оШапка);
	Для Каждого Стр Из ТЗСотрудники Цикл
		оСтрока.Параметры.Заполнить(Стр);
		оСтрока.Параметры.Ном = Ном;
		Таб.Вывести(оСтрока);
		Ном = Ном + 1;
	КонецЦикла;
	Сумма = ТЗСотрудники.Итог("Сумма");	
	оПодвал.Параметры.Сумма = Сумма;
	оПодвал.Параметры.СуммаПрописью = Формат(Сумма, "ЧДЦ=2") + " (" + Справочники.Валюты.СформироватьСуммуПрописью(Сумма,Валюта,Перечисления.Локализации.fr_CA) + ")";
	Таб.Вывести(оПодвал);		
	ИмяФайла = НСтр("ru = 'Платёжная ведомость'; fr = 'Relevé de paie'; en = 'Payroll statement'; es = 'Nómina'");
	Таб.ИспользуемоеИмяФайла = РаботаСДокументами.КраткоеПредставлениеДокумента(Док, ИмяФайла);
КонецПроцедуры

&НаСервере
Процедура СформироватьРасчетныеЛистки(Док, Таб) Экспорт
	//////////////////////
	// Получаем области //
	//////////////////////
	Макет = ПечатныеФормы.МакетПечатнойФормы("Документ.ВыплатаЗарплаты.РасчетныйЛист");
	оШапка = Макет.ПолучитьОбласть("Шапка");
	оНачУд = Макет.ПолучитьОбласть("НачУд");
	оНачУдВсего = Макет.ПолучитьОбласть("НачУдВсего");
	оАвансы = Макет.ПолучитьОбласть("Авансы");
	оПодвал = Макет.ПолучитьОбласть("Подвал");
	///////////////////////////////////////////////////////////////////////////////
	// Получаем всех сотрудников из выбранных документов с разбивкой по периоду. // 
	// Это и будет основа для печати расчетных листков                           //
	///////////////////////////////////////////////////////////////////////////////
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	НАЧАЛОПЕРИОДА(ВыплатаЗПТабличнаяЧасть.Ссылка.Дата, МЕСЯЦ) КАК Период,
	                      |	ВыплатаЗПТабличнаяЧасть.Ссылка.Дата КАК Дата,
	                      |	ВыплатаЗПТабличнаяЧасть.Сотрудник КАК Сотрудник,
	                      |	ЕСТЬNULL(ТарифныеСтавкиСрезПоследних.Должность, ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)) КАК Должность
	                      |ИЗ
	                      |	Документ.ВыплатаЗарплаты.ТЧСотрудники КАК ВыплатаЗПТабличнаяЧасть
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифныеСтавки.СрезПоследних(&Период, ) КАК ТарифныеСтавкиСрезПоследних
	                      |		ПО ВыплатаЗПТабличнаяЧасть.Сотрудник = ТарифныеСтавкиСрезПоследних.Сотрудник
	                      |ГДЕ
	                      |	ВыплатаЗПТабличнаяЧасть.Ссылка В(&Документы)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВыплатаЗПТабличнаяЧасть.Сотрудник,
	                      |	ВыплатаЗПТабличнаяЧасть.Ссылка.Дата,
	                      |	ВыплатаЗПТабличнаяЧасть.Сотрудник.Родитель,
	                      |	ТарифныеСтавкиСрезПоследних.Должность
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Период,
	                      |	ВыплатаЗПТабличнаяЧасть.Сотрудник.Наименование");
	Запрос.УстановитьПараметр("Документы", Док);
	Запрос.УстановитьПараметр("Период", КонецМесяца(Док.Дата));
	ТЗСотрудники = Запрос.Выполнить().Выгрузить();
	////////////////////
	// Выводим листки //
	////////////////////
	Для Каждого Стр Из ТЗСотрудники Цикл
		// Выводим шапку
		оШапка.Параметры.Заполнить(Стр);
		оШапка.Параметры.Период = Формат(Стр.Период, "ДФ='MMММ yyyy'");
		Таб.Вывести(оШапка);
		// Выводим начисления/удержания
		ТЗНачисленияУдержания = ПолучитьНачисленияУдержания(Стр.Период, Стр.Сотрудник);
		Для Каждого СтрНачУд Из ТЗНачисленияУдержания Цикл
			оНачУд.Параметры.Заполнить(СтрНачУд);
			Если СтрНачУд.ВидНачисления = Справочники.СтатьиДвиженияДенежныхСредств.НачислениеПоТабелю Тогда
				оНачУд.Параметры.Дни = РегистрыСведений.ОтработанноеВремяСотрудников.ПолучитьЗаМесяц(Стр.Период, Стр.Сотрудник).ВыходовФакт;
			Иначе
				оНачУд.Параметры.Дни = 0;
			КонецЕсли;	
			Таб.Вывести(оНачУд);
		КонецЦикла;
		ВсегоНачислено = ТЗНачисленияУдержания.Итог("СуммаНачисления");
		ВсегоУдержано = ТЗНачисленияУдержания.Итог("СуммаУдержания");
		оНачУдВсего.Параметры.ВсегоНачислено = ВсегоНачислено;
		оНачУдВсего.Параметры.ВсегоУдержано = ВсегоУдержано;
        Таб.Вывести(оНачУдВсего);
		// Выводим авансы
		Структура = ПолучитьОстаткиИАвансовыеДокументы(Стр.Период, Стр.Дата, Стр.Сотрудник);
		СуммаАвансов = 0;
		Для Каждого СтрАванс Из Структура.ТЗ Цикл
			оАвансы.Параметры.Заполнить(СтрАванс);
			Таб.Вывести(оАвансы);
			СуммаАвансов = СуммаАвансов + СтрАванс.СуммаАванса;
		КонецЦикла;
		ДолгКон = Структура.ДолгНач + ВсегоНачислено - ВсегоУдержано - СуммаАвансов;
		// Выводим подвал		
		оПодвал.Параметры.Заполнить(Структура);
		оПодвал.Параметры.СуммаАванса = СуммаАвансов;
		оПодвал.Параметры.ДолгКон = ДолгКон;
		Таб.Вывести(оПодвал);
		Таб.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЦикла;
	Таб.ИспользуемоеИмяФайла = НСтр("ru = 'Расчетные листки'; fr = 'Fiches de paie'; en = 'Pay slips'; es = 'Recibos de nómina'");
КонецПроцедуры

&НаСервере
Функция ПолучитьНачисленияУдержания(ПериодНачисления, Сотрудник)
	МасТипыНачислений = Новый Массив;
	МасТипыНачислений.Добавить(Тип("СправочникСсылка.СтатьиДвиженияДенежныхСредств"));
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ПериодНачисления", Новый ОписаниеТипов("Дата"));
	ТЗ.Колонки.Добавить("ПериодУдержания", Новый ОписаниеТипов("Дата"));
	ТЗ.Колонки.Добавить("ВидНачисления", Новый ОписаниеТипов(МасТипыНачислений));
	ТЗ.Колонки.Добавить("СуммаНачисления", Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("ВидУдержания", Новый ОписаниеТипов(МасТипыНачислений));
	ТЗ.Колонки.Добавить("СуммаУдержания", Новый ОписаниеТипов("Число"));	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	НАЧАЛОПЕРИОДА(Зарплата.Период, ДЕНЬ) КАК Период,
	                      |	Зарплата.Сотрудник КАК Сотрудник,
	                      |	Зарплата.СтатьяЗатрат КАК ВидНачисления,
	                      |	Зарплата.ВидДвижения КАК ВидДвижения,
	                      |	СУММА(Зарплата.Сумма) КАК Сумма
	                      |ИЗ
	                      |	РегистрНакопления.Зарплата КАК Зарплата
	                      |ГДЕ
	                      |	Зарплата.Сотрудник = &Сотрудник
	                      |	И НачалоПериода(Зарплата.Период,Месяц) = &ПериодНачисления
	                      |	И (Зарплата.Регистратор ССЫЛКА Документ.ПриказНаНачислениеУдержание
	                      |			ИЛИ Зарплата.Регистратор ССЫЛКА Документ.НачислениеЗарплаты)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	НАЧАЛОПЕРИОДА(Зарплата.Период, ДЕНЬ),
	                      |	Зарплата.Сотрудник,
	                      |	Зарплата.СтатьяЗатрат,
	                      |	Зарплата.ВидДвижения
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Период,
	                      |	Зарплата.СтатьяЗатрат.Наименование");
	Запрос.УстановитьПараметр("ПериодНачисления", ПериодНачисления);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	ТЗРез = Запрос.Выполнить().Выгрузить();
	Мас = ТЗРез.НайтиСтроки(Новый Структура("ВидДвижения", ВидДвиженияНакопления.Приход));
	Для Каждого Стр Из Мас Цикл
		НС = ТЗ.Добавить();
		НС.ПериодНачисления = Стр.Период;
		НС.ВидНачисления = Стр.ВидНачисления;
		НС.СуммаНачисления = Стр.Сумма;
	КонецЦикла;
	Мас = ТЗРез.НайтиСтроки(Новый Структура("ВидДвижения", ВидДвиженияНакопления.Расход));
	Для Каждого Стр Из Мас Цикл
		МасТЗ = ТЗ.НайтиСтроки(Новый Структура("ВидУдержания", Неопределено));
		Если МасТЗ.Количество() = 0 Тогда // Новая строка
			НС = ТЗ.Добавить();
			НС.ПериодУдержания = Стр.Период;
			НС.ВидУдержания = Стр.ВидНачисления;
			НС.СуммаУдержания = Стр.Сумма;			
		Иначе // Добавляем в строку с начислением
			НС = МасТЗ[0];
			НС.ПериодУдержания = Стр.Период;
			НС.ВидУдержания = Стр.ВидНачисления;
			НС.СуммаУдержания = Стр.Сумма;	
		КонецЕсли;			
	КонецЦикла;	
	Возврат ТЗ;
КонецФункции

&НаСервере
Функция ПолучитьОстаткиИАвансовыеДокументы(ПериодНачисления, ДатаДокумента, Сотрудник)
	Структура = Новый Структура("ДолгНач, ДолгКон, ТЗ", 0, 0, Новый ТаблицаЗначений);
	// Получим остатки
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗарплатаОстаткиИОбороты.Сотрудник КАК Сотрудник,
	                      |	ЗарплатаОстаткиИОбороты.СуммаНачальныйОстаток КАК НачальныйОстаток,
	                      |	ЗарплатаОстаткиИОбороты.СуммаКонечныйОстаток КАК КонечныйОстаток
	                      |ИЗ
	                      |	РегистрНакопления.Зарплата.ОстаткиИОбороты(
	                      |			&ДатаНач,
	                      |			&ДатаКон,
	                      |			,
	                      |			,
	                      |			Сотрудник = &Сотрудник) КАК ЗарплатаОстаткиИОбороты");
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(ПериодНачисления));
	Запрос.УстановитьПараметр("ДатаКон", ДатаДокумента - 1);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Выб = Запрос.Выполнить().Выбрать();
	Пока Выб.Следующий() Цикл
		Структура.ДолгНач = Выб.НачальныйОстаток;
		Структура.ДолгКон = Выб.КонечныйОстаток;
	КонецЦикла;
	// Получим аванс
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Зарплата.Период КАК ПериодАванса,
	                      |	Зарплата.Регистратор.Номер КАК Номер,
	                      |	Зарплата.Сумма КАК СуммаАванса,
	                      |	Зарплата.Регистратор КАК Регистратор
	                      |ИЗ
	                      |	РегистрНакопления.Зарплата КАК Зарплата
	                      |ГДЕ
	                      |	НачалоПериода(Зарплата.Период,Месяц) = &ПериодНачисления
	                      |	И Зарплата.Сотрудник = &Сотрудник
	                      |	И (Зарплата.Регистратор ССЫЛКА Документ.ПлатёжнаяВедомостьНаАванс
	                      |			ИЛИ Зарплата.Регистратор ССЫЛКА Документ.РасходныйКассовыйОрдер
	                      |			ИЛИ Зарплата.Регистратор ССЫЛКА Документ.СписаниеБезналичныхДенежныхСредств)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Зарплата.Период");
	Запрос.УстановитьПараметр("ПериодНачисления", ПериодНачисления);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	ТЗАвансы = Запрос.Выполнить().Выгрузить();
	ТЗАвансы.Колонки.Добавить("ДокАванс", Новый ОписаниеТипов("Строка"));
	Для Каждого Стр Из ТЗАвансы Цикл
		Стр.ДокАванс = Стр.Регистратор;	
	КонецЦикла;
	Структура.ТЗ = ТЗАвансы;
	Возврат Структура;
КонецФункции	
