
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(объект.АвторОбщий) Тогда иначе
		объект.АвторОбщий = ПараметрыСеанса.Пользователь;	
	КонецЕсли; 

	Объект.РежимРаботы = "Клиент-серверный"; 

	Если Параметры.Свойство("Шаблон") Тогда	
		объект.Шаблон = Параметры.Шаблон;
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УловнаяВидимостьПоРижимуРаботы();
КонецПроцедуры

&НаКлиенте
Процедура РежимРаботыПриИзменении(Элемент)
	УловнаяВидимостьПоРижимуРаботы();
КонецПроцедуры 

&НаКлиенте
Процедура УловнаяВидимостьПоРижимуРаботы()      
	
	Если Объект.РежимРаботы = "Клиент-серверный" Тогда
		элементы.Кластер.Видимость = Истина;
		элементы.ИмяБазы.Видимость = Истина;
		элементы.ПутьФайловой.Видимость = ложь;
	Иначе   
		элементы.ПутьФайловой.Видимость = Истина;
		элементы.Кластер.Видимость = ложь;
		элементы.ИмяБазы.Видимость = ложь;
	КонецЕсли;
		
КонецПроцедуры


&НаКлиенте
Процедура ПутьФайловойНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
  СтандартнаяОбработка = Ложь;
  Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога); 
  Диалог.Заголовок = "Выберите каталог базы"; 

  ОповещениеЗавершения = Новый ОписаниеОповещения("ПриВыбореКаталога", ЭтотОбъект);
  Диалог.Показать(ОповещениеЗавершения);  
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриВыбореКаталога(ВыбФайлы, ДополнительныеПараметры) Экспорт

  Если ВыбФайлы <> Неопределено Тогда
      объект.ПутьФайловой = ВыбФайлы[0];
  КонецЕсли;

КонецПроцедуры

