
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	ТипЦен = Справочники.ВидыЦен.Розничная;
	Если Параметры.Свойство("Контрагент") Тогда
		Если ЗначениеЗаполнено(параметры.Контрагент.ТипЦены) Тогда 
			ТипЦен = параметры.Контрагент.ТипЦены;
		КонецЕсли;
	КонецЕсли;
	LoadProducts();
	CreateButtons();
	FilterProductGroup = "__Tous1__";
	РазрешенныеПоля = СтрРазделить("Номенклатура,Артикул", ",", Ложь);
	УстановитьОграничениеДинамическогоСписка(ЭтаФорма.VT, РазрешенныеПоля);
EndProcedure

&AtServer
Procedure LoadProducts()
	If FilterProductGroup = "__Tous1__" Then 
		ProductFilter = Catalogs.Номенклатура.EmptyRef();
	Else 
		ProductFilter = Catalogs.Номенклатура.FindByCode(FilterProductGroup);
	EndIf;
	
	Query = New Query;
	Query.Text =
	"ВЫБРАТЬ
	|	СпрНоменклатура.Ссылка КАК Номенклатура,
	|	ЕСТЬNULL(StockBalance.КоличествоОстаток, 0) КАК Количество,
	|	ЕСТЬNULL(PrixDeProduitSliceLast.Цена, 0) КАК Цена,
	|	ЕСТЬNULL(PrixDeProduitSliceLast.Цена, 0) КАК ЦенаСНДС,
	|	ЕСТЬNULL(StockBalance.Серия, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК Серия
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВНаличии.Остатки(
	|				,
	|				МестоХранения = &МестоХранения
	|					И ВЫБОР
	|						КОГДА &Produit = ЗНАЧЕНИЕ(Catalog.Номенклатура.EmptyRef)
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ Номенклатура В ИЕРАРХИИ (&Produit)
	|					КОНЕЦ) КАК StockBalance
	|		ПО СпрНоменклатура.Ссылка = StockBalance.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ВидЦены = &PriceType) КАК PrixDeProduitSliceLast
	|		ПО СпрНоменклатура.Ссылка = PrixDeProduitSliceLast.Номенклатура
	|			И (PrixDeProduitSliceLast.Активность)
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &Produit = ЗНАЧЕНИЕ(Catalog.Номенклатура.EmptyRef)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ СпрНоменклатура.Ссылка В ИЕРАРХИИ (&Produit)
	|		КОНЕЦ
	|	И НЕ СпрНоменклатура.ЭтоГруппа";
	VT.Параметры.SetParameterValue("МестоХранения",РегистрыСведений.НастройкиПользователей.СкладПользователя());
	VT.Параметры.SetParameterValue("Produit",ProductFilter);
	VT.Параметры.SetParameterValue("PriceType",ТипЦен);
	//VT.Load(Query.Execute().Unload());
	//Элементы.VT.Обновить();
EndProcedure

&AtClient
Procedure VTSelection(Item, SelectedRow, Field, StandardProcessing)
	CurData = items.VT.CurrentData;
	If CurData <> Undefined Then
		Str = New Structure("Номенклатура,Количество,Цена",CurData.Номенклатура,1,CurData.Цена);
		Close(Str);
	EndIf;
EndProcedure

&AtClient
Procedure Choisir(Command)
	CurData = items.VT.CurrentData;
	If CurData <> Undefined Then
		Str = New Structure("Номенклатура,Серия,Количество,Цена",CurData.Номенклатура,CurData.Серия,1,CurData.Цена);
		Close(Str);
	EndIf;
EndProcedure

&AtServer
Procedure CreateButtons()
	Items.FilterProductGroup.ChoiceList.Clear();
	
	Items.FilterProductGroup.ChoiceList.Add("__Tous1__", "Tous");
	
	Query = New Query;
	Query.Text =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СпрНоменклатура.Ссылка КАК Produit
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|ГДЕ
	|	СпрНоменклатура.ЭтоГруппа
	|
	|СГРУППИРОВАТЬ ПО
	|	СпрНоменклатура.Ссылка
	|ИТОГИ ПО
	|	Produit ТОЛЬКО ИЕРАРХИЯ";
	
	Result = Query.Execute().Select(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);	
	
	While Result.Next() Do
		Items.FilterProductGroup.ChoiceList.Add(Result.Produit.Code, Result.Produit);  
	КонецЦикла;	
EndProcedure

&AtClient
Procedure FilterProductGroupOnChange(Item)
	LoadProducts();
EndProcedure

&AtClient
Procedure VTOnActivateRow(Item)
	//CurData = items.VT.CurrentData;
	//If CurData <> Undefined Then 
	//	ShowPicture(CurData.Номенклатура);
	//EndIf;
EndProcedure

&AtServer
Procedure ShowPicture(Produit)
	НЗ = РегистрыСведений.ПрисоединённыеФайлы.СоздатьНаборЗаписей();
	НЗ.Отбор.Объект.Установить(Produit);
	НЗ.Прочитать();
	Изображения.Загрузить(НЗ.Выгрузить());
	Изображения.Сортировать("ДатаДобавления убыв");
	Если Изображения.Количество()>0 Тогда 
		НомерКартинки = 1;
	КонецЕсли;
	ЗаполнитьИзображениеНаСервере(Produit);
EndProcedure

&НаСервере
Процедура ЗаполнитьИзображениеНаСервере(Produit)
	Если НомерКартинки > Изображения.Количество() Тогда
		НомерКартинки = Изображения.Количество();
	КонецЕсли;
	Если НомерКартинки = 0 Тогда
		FieldPhoto = "";
		УстановитьДоступностьКнопокКартинки();
		Возврат;
	КонецЕсли;
	ID = Изображения.Получить(НомерКартинки-1).ID;
	КлючЗаписиРег = РегистрыСведений.ПрисоединённыеФайлы.СоздатьКлючЗаписи(Новый Структура("Объект,ID", Produit.Ссылка,ID));
	Если Не КлючЗаписиРег.Пустой() Тогда
		FieldPhoto = ПолучитьНавигационнуюСсылку(КлючЗаписиРег, "Данные");
	КонецЕсли;
	УстановитьДоступностьКнопокКартинки();
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьКнопокКартинки()
	Если НомерКартинки = 0 Тогда 
		Элементы.ИзображениеВлево.Доступность = Ложь;
		Элементы.ИзображениеВправо.Доступность = Ложь;
	Иначе
		Элементы.ИзображениеВлево.Доступность = НомерКартинки > 1;
		Элементы.ИзображениеВправо.Доступность = НомерКартинки < Изображения.Количество();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИзображениеВправо(Команда)
	НомерКартинки = НомерКартинки + 1;
	CurData = items.VT.CurrentData;
	If CurData <> Undefined Then 
		ЗаполнитьИзображениеНаСервере(CurData.Номенклатура);
	EndIf;
КонецПроцедуры

&НаКлиенте
Процедура ИзображениеВлево(Команда)
	НомерКартинки = НомерКартинки - 1;
	CurData = items.VT.CurrentData;
	If CurData <> Undefined Then 
		ЗаполнитьИзображениеНаСервере(CurData.Номенклатура);
	EndIf;
КонецПроцедуры

// Устанавливает ограничения в динамическогм списке на отборы, сортировки и группировку на все поля списка
// для ускорения поиска по строке поиска и уменьшает количество ошибочных настроек пользователя
// убирает из ограничений поля указанные в отборах условного оформления, т.к. это ломает оформление
// Параметры:
//  Список           - ДинамическийСписок - Динамический список на который устанавливается отбор
//                 
//  РазрешенныеПоля  - Массив - состоящий из строк-имен полей по которым не устанавливаются ограничения
//
//
&НаСервере
Процедура УстановитьОграничениеДинамическогоСписка(Список, РазрешенныеПоля) Экспорт

	Для Каждого ЭлементНастроек Из Список.КомпоновщикНастроек.Настройки.УсловноеОформление.Элементы Цикл
		Для Каждого ЭлементОтбора Из ЭлементНастроек.Отбор.Элементы Цикл
			РазрешенныеПоля.Добавить(Строка(ЭлементОтбора.ЛевоеЗначение));
		КонецЦикла;
	КонецЦикла;
	МассивПолей = Новый Массив;
	Для Каждого ЭлементСписка Из Список.КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.Элементы Цикл
		Если РазрешенныеПоля.Найти(Строка(ЭлементСписка.Поле)) = Неопределено ИЛИ ЭлементСписка.Папка Тогда
			МассивПолей.Добавить(Строка(ЭлементСписка.Поле));
		КонецЕсли;
	КонецЦикла;
	
	Список.УстановитьОграниченияИспользованияВГруппировке(МассивПолей);
	Список.УстановитьОграниченияИспользованияВОтборе(МассивПолей);
	Список.УстановитьОграниченияИспользованияВПорядке(МассивПолей);
	
КонецПроцедуры // УстановитьОграничениеДинамическогоСписка()