
#Область Печать

Процедура ПечатьНакладнаяНаОприходованиеТоваров(Док, Таб) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Таб.ОтображатьСетку = Ложь;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	Таб.АвтоМасштаб = Истина;
	Таб.КлючПараметровПечати = "Параметры_печати_Документ_ОприходованиеТоваров_НакладнаяНаОприходованиеТоваров";
	Макет = Документы.ОприходованиеТоваров.ПолучитьМакет("НакладнаяНаОприходованиеТоваров");	
	оЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	оЗаголовок.Параметры.ТекстЗаголовка = РаботаСДокументами.КраткоеПредставлениеДокумента(Док, НСтр("fr = 'Entrée des marchandises'; ru = 'Оприходование товаров'; en = 'Registration of goods'; es = 'Compra de bienes'"));
	Таб.Вывести(оЗаголовок);
	оПолучатель = Макет.ПолучитьОбласть("Получатель");	
	оПолучатель.Параметры.ПредставлениеПолучателя = Док.Организация;
	Таб.Вывести(оПолучатель);
	Таб.Вывести(Макет.ПолучитьОбласть("Шапка"));
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТЧТовары.НомерСтроки КАК НомерСтроки,
	                      |	ТЧТовары.Номенклатура.Артикул КАК Артикул,
	                      |	ТЧТовары.Номенклатура КАК Номенклатура,
	                      |	ТЧТовары.Характеристика КАК Характеристика,
	                      |	ТЧТовары.КоличествоУпаковок КАК КоличествоМест,
	                      |	ВЫБОР
	                      |		КОГДА ТЧТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	                      |			ТОГДА ТЧТовары.Номенклатура.Единица
	                      |		ИНАЧЕ ТЧТовары.Упаковка
	                      |	КОНЕЦ КАК ЕдиницаИзмерения,
	                      |	ТЧТовары.Количество КАК Количество,
	                      |	ТЧТовары.Номенклатура.Единица КАК ЕдиницаХранения,
	                      |	ТЧТовары.Цена КАК Цена,
	                      |	ТЧТовары.Сумма КАК Сумма
	                      |ИЗ
	                      |	Документ.ОприходованиеТоваров.ТЧТовары КАК ТЧТовары
	                      |ГДЕ
	                      |	ТЧТовары.Ссылка = &Док");
	Запрос.УстановитьПараметр("Док", Док);
	ТЗ = Запрос.Выполнить().Выгрузить();
	оСтрока = Макет.ПолучитьОбласть("Строка"); 	
	Для Каждого Стр Из ТЗ Цикл
		оСтрока.Параметры.Заполнить(Стр);
		оСтрока.Параметры.Товар = ОбщегоНазначенияКлиентСервер.ПредставлениеНоменклатуры(Стр.Номенклатура, Стр.Характеристика);
		Таб.Вывести(оСтрока);
	КонецЦикла;
	оИтого = Макет.ПолучитьОбласть("Итого");
	СуммаОприходования = ТЗ.Итог("Сумма");
	оИтого.Параметры.Всего = СуммаОприходования;
	Таб.Вывести(оИтого);
	оСуммаПрописью = Макет.ПолучитьОбласть("СуммаПрописью");
	//оСуммаПрописью.Параметры.ИтоговаяСтрока = "Всего наименований " + СокрЛП(ТЗ.Количество()) + ", на сумму " + Формат(СуммаОприходования, "ЧЦ=12; ЧДЦ=2") + " руб.";
	оСуммаПрописью.Параметры.СуммаПрописью = Справочники.Валюты.СформироватьСуммуПрописью(СуммаОприходования, Справочники.Валюты.MoroccanDirham, Перечисления.Локализации.fr_CA);
	Таб.Вывести(оСуммаПрописью);
	Таб.Вывести(Макет.ПолучитьОбласть("Подписи"));
	Таб.ВывестиГоризонтальныйРазделительСтраниц();
КонецПроцедуры

#КонецОбласти
