
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Номенклатура = Параметры.Номенклатура;
	Единица = Номенклатура.Единица;	
	// Заполним дерево
	НС = ДЗУпаковки.ПолучитьЭлементы().Добавить();
	НС.Ссылка = Единица;
	Если Номенклатура.ИспользоватьУпаковки Тогда
		НС = ДЗУпаковки.ПолучитьЭлементы().Добавить();
		НС.Ссылка = "Упаковки";
		Если Номенклатура.НаборУпаковок = Справочники.НаборыУпаковок.ИндивидуальныйДляНоменклатуры Тогда
			ВладелецУпаковок = Номенклатура;
		Иначе
			ВладелецУпаковок = Номенклатура.НаборУпаковок;
		КонецЕсли;
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	УпаковкиЕдиницыИзмерения.Ссылка КАК Ссылка
		                      |ИЗ
		                      |	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
		                      |ГДЕ
		                      |	УпаковкиЕдиницыИзмерения.Владелец = &Владелец
		                      |	И УпаковкиЕдиницыИзмерения.ПометкаУдаления = ЛОЖЬ
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	УпаковкиЕдиницыИзмерения.Наименование");
		Запрос.УстановитьПараметр("Владелец", ВладелецУпаковок);
		Выб = Запрос.Выполнить().Выбрать();
		Пока Выб.Следующий() Цикл
			НСУпаковка = НС.ПолучитьЭлементы().Добавить();
			НСУпаковка.Ссылка = Выб.Ссылка;
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура Выбрать(Команда)
	ТекСтр = Элементы.ДЗУпаковки.ТекущаяСтрока;
	Если ТекСтр = Неопределено Тогда Возврат КонецЕсли;
	ВыполнитьВыбор(ТекСтр);
КонецПроцедуры

&НаКлиенте
Процедура ДЗУпаковкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыполнитьВыбор(ВыбраннаяСтрока);
КонецПроцедуры

#КонецОбласти

#Область Дополнительно

&НаКлиенте
Процедура ВыполнитьВыбор(Идентификатор)
	ТекСтр = ДЗУпаковки.НайтиПоИдентификатору(Идентификатор);
	Если ТипЗнч(ТекСтр.Ссылка) <> Тип("СправочникСсылка.УпаковкиЕдиницыИзмерения") Тогда Возврат КонецЕсли;
	Если Единица = ТекСтр.Ссылка Тогда
		ОповеститьОВыборе(ПредопределенноеЗначение("Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка"));
	Иначе
		ОповеститьОВыборе(ТекСтр.Ссылка);
	КонецЕсли;
КонецПроцедуры	

#КонецОбласти




