
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьПривилегированныйРежим(Истина);
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Объект.ИдентификаторПользователяИБ);
	ЕстьПраваАдминистратора = РольДоступна("Администратор");
	// Заполняем данные формы
	Для Каждого Стр Из Метаданные.Роли Цикл
		НС = СЗРоли.Добавить();
		НС.Значение = Стр.Имя;
		НС.Представление = Стр.Синоним;
	КонецЦикла;
	Для Каждого Стр Из Метаданные.Языки Цикл
		Элементы.Язык.СписокВыбора.Добавить(Стр.Имя);	
	КонецЦикла;	
	Если ПользовательИБ <> Неопределено Тогда
		АутентификацияOpenID = ПользовательИБ.АутентификацияOpenID;
		АутентификацияOpenIDConnect = ПользовательИБ.АутентификацияOpenIDConnect;
		АутентификацияОС = ПользовательИБ.АутентификацияОС;
		АутентификацияСтандартная = ПользовательИБ.АутентификацияСтандартная;   
		Если АутентификацияОС или АутентификацияСтандартная Тогда
			Объект.ВходВПрограммуРазрешен = Истина;	
		КонецЕсли;
		ЗапрещеноВосстанавливатьПароль = ПользовательИБ.ЗапрещеноВосстанавливатьПароль;
		АдресЭлектроннойПочты = ПользовательИБ.АдресЭлектроннойПочты;
		ЗапрещеноИзменятьПароль = ПользовательИБ.ЗапрещеноИзменятьПароль;
		ЗащитаОтОпасныхДействий = ПользовательИБ.ЗащитаОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях;
		Пароль = ПользовательИБ.СохраняемоеЗначениеПароля;
		ПоказыватьВСпискеВыбора = ПользовательИБ.ПоказыватьВСпискеВыбора;
		ПользовательОС = ПользовательИБ.ПользовательОС;
		Для Каждого Роль Из ПользовательИБ.Роли Цикл
			Эл = СЗРоли.НайтиПоЗначению(Роль.Имя);
			Если Эл <> Неопределено Тогда
				Эл.Пометка = Истина;	
			КонецЕсли;	
		КонецЦикла;
		Если ПользовательИБ.Язык <> Неопределено Тогда
			Язык = ПользовательИБ.Язык.Имя;
		КонецЕсли;
	Иначе
		ЗапрещеноВосстанавливатьПароль = Истина;
	КонецЕсли;
	ПарольИзменялся = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СформироватьЗаголовкиЭлементов();
	УстановитьДоступностьРеквизитов();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	УстановитьПривилегированныйРежим(Истина);
	// Получаем пользователя
	НовыйПользователь = Ложь;
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекущийОбъект.ИдентификаторПользователяИБ);
	Если ПользовательИБ = Неопределено Тогда
		ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
		НовыйПользователь = Истина;
		
	КонецЕсли;
	//Если НЕ НовыйПользователь Тогда
	//	Возврат;
	//КонецЕсли;
	// Сохраняем данные
	ПользовательИБ.АутентификацияOpenID = АутентификацияOpenID;
	ПользовательИБ.АутентификацияOpenIDConnect = АутентификацияOpenIDConnect; 
	ПользовательИБ.АутентификацияОС = АутентификацияОС; 
	ПользовательИБ.АутентификацияСтандартная = АутентификацияСтандартная;
	ПользовательИБ.ЗапрещеноВосстанавливатьПароль = ЗапрещеноВосстанавливатьПароль;
	ПользовательИБ.ЗапрещеноИзменятьПароль = ЗапрещеноИзменятьПароль;		
	ПользовательИБ.АдресЭлектроннойПочты = АдресЭлектроннойПочты;
	ПользовательИБ.ЗащитаОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях = ЗащитаОтОпасныхДействий;
	ПользовательИБ.Имя = ТекущийОбъект.Наименование;
	Если ПарольИзменялся Тогда
		ПользовательИБ.Пароль = Пароль;
	КонецЕсли;	
	ПользовательИБ.ПоказыватьВСпискеВыбора = ПоказыватьВСпискеВыбора;
	ПользовательИБ.ПолноеИмя = ТекущийОбъект.ПолноеИмя;
	ПользовательИБ.ПользовательОС = ПользовательОС;
	ПользовательИБ.Роли.Очистить();	
	Для Каждого Стр Из СЗРоли Цикл
		Если Не Стр.Пометка Тогда Продолжить КонецЕсли;
		Роль = Метаданные.Роли.Найти(Стр.Значение);
		Если Роль = Неопределено Тогда Продолжить КонецЕсли;
		Если Роль = Метаданные.Роли.Клиент Тогда 
			Стр.Пометка = Ложь;
			Продолжить;
		КонецЕсли;
		ПользовательИБ.Роли.Добавить(Роль);
	КонецЦикла;
	ПользовательИБ.Язык = ?(ЗначениеЗаполнено(Язык), Метаданные.Языки[Язык], Метаданные.ОсновнойЯзык);
	ПользовательИБ.Записать();
	ТекущийОбъект.ИдентификаторПользователяИБ = ПользовательИБ.УникальныйИдентификатор;	
	ТекущийОбъект.Роли = Справочники.Пользователи.СформироватьСписокРолей(ПользовательИБ);
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура ПользовательОСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОткрытьФорму("Справочник.Пользователи.Форма.ВыборПользователяОС",, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ЗапрещеноВосстанавливатьПарольПриИзменении(Элемент)
	УстановитьДоступностьРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура СменитьПароль(Команда)
	Оп = Новый ОписаниеОповещения("ПослеЗакрытияФормыУстановкиПароля", ЭтотОбъект);
	ОткрытьФорму("Справочник.Пользователи.Форма.УстановкаПароля",, ЭтаФорма,,,, Оп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти

#Область Оповещения

&НаКлиенте
Процедура ПослеЗакрытияФормыУстановкиПароля(Результат, ДополнительныеПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		Пароль = Результат;
		ПарольИзменялся = Истина;
	КонецЕсли;
	ЭтаФорма.Модифицированность = Истина;
	СформироватьЗаголовкиЭлементов();
КонецПроцедуры

#КонецОбласти

#Область Дополнительно

&НаКлиенте
Процедура УстановитьДоступностьРеквизитов()
	Элементы.ГруппаАутентификация1СПредприятияПараметры.Доступность = АутентификацияСтандартная;
	Элементы.ГруппаАутентификацияОСПользователь.Доступность = АутентификацияОС;
	Элементы.АдресЭлектроннойПочты.Доступность = Не ЗапрещеноВосстанавливатьПароль;
	Элементы.АдресЭлектроннойПочты.АвтоОтметкаНезаполненного = Не ЗапрещеноВосстанавливатьПароль;
КонецПроцедуры	

&НаКлиенте
Процедура СформироватьЗаголовкиЭлементов()
	Элементы.НадписьНаличиеПароля.Заголовок = ?(ЗначениеЗаполнено(Пароль), "Пароль установлен", "Без пароля");
	Элементы.СменитьПароль.Заголовок = ?(ЗначениеЗаполнено(Пароль), "Сменить пароль", "Установить пароль");	
КонецПроцедуры

#КонецОбласти
