
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	УстановитьПривилегированныйРежим(Истина);
	РаботаСДокументами.ЗаполнитьРеквизитыПоУмолчанию(ЭтотОбъект);
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		РаботаСДокументами.МожноСоздатьДокументНаОсновании(Метаданные.Документы.РеализацияТоваровУслуг, ДанныеЗаполнения);
		Дата = ТекущаяДатаСеанса();
		Основание = ДанныеЗаполнения;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Договор = ДанныеЗаполнения.Договор;
		Менеджер = ДанныеЗаполнения.Менеджер;
		//ЦенаВключаетНДС = ДанныеЗаполнения.ЦенаВключаетНДС;
		Комментарий = ДанныеЗаполнения.Комментарий;
		Организация = ДанныеЗаполнения.Организация;
		Рез = Документы.ЗаказПокупателя.ПолучитьТоварыПоГруппировкам(ДанныеЗаполнения);
		ВыбГруппа = Рез.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		Пока ВыбГруппа.Следующий() Цикл
			Выб = ВыбГруппа.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока Выб.Следующий() Цикл
	        	СтрОснование = ДанныеЗаполнения.ТЧТовары.Найти(Выб.КодСтроки, "КодСтроки");
				НС = ТЧТовары.Добавить();
				ЗаполнитьЗначенияСвойств(НС, СтрОснование);
			КонецЦикла;	
		КонецЦикла;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		Организация = ДанныеЗаполнения.Организация;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Договор = ОбщегоНазначенияВызовСервера.ПолучитьОсновнойДоговор(Контрагент, Организация, Истина); 
		МестоХранения = ДанныеЗаполнения.МестоХранения;
		Основание = ДанныеЗаполнения;		
		//ЦенаВключаетНДС = ДанныеЗаполнения.ЦенаВключаетНДС;
		ТЧТовары.Загрузить(ДанныеЗаполнения.ТЧТовары.Выгрузить());
		ТЧСерии.Загрузить(ДанныеЗаполнения.ТЧСерии.Выгрузить());
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Организация = ?(ДанныеЗаполнения.Организация.ОсновнойУчет,ДанныеЗаполнения.Организация,ДанныеЗаполнения.Организация.ВедущаяОрганизация);
		Контрагент = ДанныеЗаполнения.Контрагент;
		Договор = ДанныеЗаполнения.Договор; 
		МестоХранения = ?(ДанныеЗаполнения.Организация.ОсновнойУчет,ДанныеЗаполнения.МестоХранения,ДанныеЗаполнения.Организация.ВедущаяОрганизация.ОсновнойСклад);
		Основание = ДанныеЗаполнения;		
		//ЦенаВключаетНДС = ДанныеЗаполнения.ЦенаВключаетНДС;
		ТЧТовары.Загрузить(ДанныеЗаполнения.ТЧТовары.Выгрузить());
		ТЧСерии.Загрузить(ДанныеЗаполнения.ТЧСерии.Выгрузить());
		ТЗТовары = ТЧТовары.Выгрузить();
		ТЗТовары.ЗаполнитьЗначения(ДанныеЗаполнения,"ОтгрузкаТовара");
		ТЧТовары.Загрузить(ТЗТовары);
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	УстановитьПривилегированныйРежим(Истина);
	РаботаСДокументами.УстановитьЗаписьВсехРегистров(Движения);
	// Данные для проведения
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ТЗТоварыССериями", СерииИРазмещение.ОбъединитьТоварыССериями(ЭтотОбъект));
	// Блокировки
	Блокировка = Новый БлокировкаДанных;
	УправляемыеБлокировки.ТоварыВНаличии(Блокировка, ТЧТовары, МестоХранения);
	//УправляемыеБлокировки.ВзаиморасчётыСПокупателями(Блокировка, Контрагент);

	Блокировка.Заблокировать();
	// Формируем
	Отказ = Не РегистрыНакопления.ТоварыВНаличии.СформироватьДвижения(ЭтотОбъект);
	Если Отказ Тогда Возврат КонецЕсли;
	РегистрыНакопления.ДенежныеСредстваОрганизаций.СформироватьДвижения(ЭтотОбъект);
	РегистрыНакопления.ВзаиморасчётыСПокупателями.СформироватьДвижения(ЭтотОбъект);
	//РегистрыНакопления.ВзаиморасчётыСПоставщиками.СформироватьПоДопРасходам(ЭтотОбъект);
	//РегистрыНакопления.Продажи.СформироватьДвижения(ЭтотОбъект); // Рассчитывается на основании списанных партий и издержек
	// Записываем
	Движения.Записать();
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	РаботаСДокументами.МожноСоздатьДокументНаОсновании(Метаданные.Документы.РеализацияТоваровУслуг, Основание);
	Ответственный = ПараметрыСеанса.Пользователь;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	РаботаСДокументами.МожноРедактироватьДокумент(ЭтотОбъект, Отказ);
	Менеджер = РегистрыСведений.КураторыДоговоров.ПолучитьПоследнее(ЭтотОбъект.Дата, Новый Структура("Договор", ЭтотОбъект.Договор)).Куратор;
	//РаботаСДокументами.ПроверкаСоответствияВозвратовРеализации(ЭтотОбъект, РежимЗаписи, Отказ);
	ЭтотОбъект.ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	Если Не ЗначениеЗаполнено(ДатаИнвойса) Тогда 
		ДатаИнвойса = Дата;
	КонецЕсли;
КонецПроцедуры 

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
КонецПроцедуры
