
#Область Обработчики_событий_формы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Список.Параметры.УстановитьЗначениеПараметра("ДатаОст", Параметры.ДатаОстатков);
	Список.Параметры.УстановитьЗначениеПараметра("МестоХранения", Параметры.МестоХранения);
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура Выбрать(Команда)
	ТекСтр = Элементы.Список.ТекущиеДанные;
	Если ТекСтр = Неопределено Тогда Возврат КонецЕсли;
	ОбработатьВыбор(ТекСтр);
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОбработатьВыбор(Элемент.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыбор(ТекСтр)
	Структура = Новый Структура("Номенклатура, Количество", ТекСтр.Номенклатура, ТекСтр.Количество);
	Закрыть(Структура);	
КонецПроцедуры	

#КонецОбласти


