
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	РаботаСДокументами.ЗаполнитьРеквизитыПоУмолчанию(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	УстановитьПривилегированныйРежим(Истина);
	РаботаСДокументами.УстановитьЗаписьВсехРегистров(Движения);
	ТЗ = ТЧПравила.Выгрузить();
	ТЗ.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	ТЗ.ЗаполнитьЗначения(Дата, "Период");
	Движения.ПравилаЦенообразования.Загрузить(ТЗ);
	Движения.Записать();
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = ПараметрыСеанса.Пользователь;
КонецПроцедуры
