
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НастроитьФормуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Проверить(Команда)
	ДополнительнаяИнформация = "";
	ТекстСообщенияПользователю = ПроцедурыОбменаССайтом.ВыполнитьТестовоеПодключениеКСерверуHTTP(Объект.Ссылка, ДополнительнаяИнформация);
	
	Если Не ПустаяСтрока(ДополнительнаяИнформация) Тогда
		
		Сообщить(ДополнительнаяИнформация);
		
	КонецЕсли;
	
	ПоказатьПредупреждение(,ТекстСообщенияПользователю);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбмен(Команда)
	РаботаСДокументамиКлиент.ЗаписатьЕслиНовый(ЭтаФорма);
	Если Объект.Ссылка.Пустая() Тогда 
		Отказ = Истина;
	КонецЕсли;
	ВыполнитьОбменЕслиВозможно();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОбменЕслиВозможно()
	
	Если Модифицированность ИЛИ Объект.Ссылка.Пустая() Тогда
		
		ЭтаФорма.Записать();
		
	КонецЕсли; 
	
	ПроцедурыОбменаССайтом.ВыполнитьАвтообмен(Объект.Ссылка, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгружатьНаСайтПриИзменении(Элемент)
	ВыгружатьНаСайтПриИзмененииНаСервере()
КонецПроцедуры

&НаСервере
Процедура ВыгружатьНаСайтПриИзмененииНаСервере()
	ВыгружатьНаСайт = Объект.ВыгружатьНаСайт;
	Элементы.ОбменТоварами.Доступность = ВыгружатьНаСайт;
	Элементы.ОбменЗаказами.Доступность = ВыгружатьНаСайт;
	Элементы.ВыгружатьТолькоИзменения.Доступность = ВыгружатьНаСайт;
КонецПроцедуры

&НаКлиенте
Процедура ВыгружатьТолькоИзмененияПриИзменении(Элемент)
	ВыгружатьТолькоИзмененияПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыгружатьТолькоИзмененияПриИзмененииНаСервере()
	Элементы.ГруппаТолькоИзменения.Видимость = Объект.ВыгружатьТолькоИзменения;
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуНаСервере()
	ВыгружатьНаСайтПриИзмененииНаСервере();
	ВыгружатьТолькоИзмененияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УзелОбменаТоварамиПриИзменении(Элемент)
	Если Не ЗначениеЗаполнено(Объект.УзелОбменаТоварами) Тогда
		Возврат;
	КонецЕсли;
	Если ПроверитьУзелОбменаТоварамиНаСервере() Тогда
		Сообщить("Выбранный узел соответствует текущей информационной базе. Выберите другой узел или создайте новый.");
		Объект.УзелОбменаТоварами = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверитьУзелОбменаТоварамиНаСервере()
	Возврат Объект.УзелОбменаТоварами = ПланыОбмена.ОбменССайтомТоварами.ЭтотУзел()
КонецФункции

&НаКлиенте
Процедура УзелОбменаЗаказамиПриИзменении(Элемент)
	Если Не ЗначениеЗаполнено(Объект.УзелОбменаЗаказами) Тогда
		Возврат;
	КонецЕсли;
	Если ПроверитьУзелОбменаЗаказамиНаСервере() Тогда
		Сообщить("Выбранный узел соответствует текущей информационной базе. Выберите другой узел или создайте новый.");
		Объект.УзелОбменаЗаказами = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверитьУзелОбменаЗаказамиНаСервере()
	Возврат Объект.УзелОбменаЗаказами = ПланыОбмена.ОбменССайтомЗаказами.ЭтотУзел()
КонецФункции
