
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Период.ДатаНачала = Объект.НачалоПериода;
	Период.ДатаОкончания = Объект.КонецПериода;
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, Объект);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить(РаботаСДокументами.СвойствоЗаписьИзФормы(), Истина);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, ТекущийОбъект);
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура ТорговаяТочкаПриИзменении(Элемент)
	ДанныеКонтрагента = ОбщегоНазначенияВызовСервера.ПолучитьДанныеКонтрагента(Объект.Контрагент, Объект.Организация, Истина, Объект.Дата);
	ЗаполнитьЗначенияСвойств(Объект, ДанныеКонтрагента, "Контрагент, Договор");
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	Объект.НачалоПериода = Период.ДатаНачала;
	Объект.КонецПериода = Период.ДатаОкончания;
КонецПроцедуры

&НаКлиенте
Процедура ТЧПоДаннымОрганизацииПриИзменении(Элемент)
	Объект.КонечныйОстаток = Объект.НачальныйОстаток + Объект.ТЧПоДаннымОрганизации.Итог("Дебет") - Объект.ТЧПоДаннымОрганизации.Итог("Кредит");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДаннымОрганизации(Команда)
	Если Не ПроверитьЗаполнение() Тогда Возврат КонецЕсли;
	Если Не ПроверитьПравильностьДанных() Тогда Возврат КонецЕсли;
	ПолучитьОстаткиИОборотыПоКонтрагенту(Истина); 
	Для Каждого ТекСтр из Объект.ТЧПоДаннымОрганизации Цикл 
		ДанныеСуммы = РаботаСДокументамиВызовСервера.ПолучитьСуммуОснованияДляПлатёжногоДокумента(ТекСтр.ДокументРегистратор);
		ЗаполнитьЗначенияСвойств(ТекСтр, ДанныеСуммы);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДаннымКонтрагента(Команда)
	Если Не ПроверитьЗаполнение() Тогда Возврат КонецЕсли;
	Если Не ПроверитьПравильностьДанных() Тогда Возврат КонецЕсли;
	ПолучитьОстаткиИОборотыПоКонтрагенту(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ТЧПоДаннымОрганизацииДокументРегистраторПриИзменении(Элемент)
	ТекСтр = Элементы.ТЧОснования.ТекущиеДанные;
	ДанныеСуммы = РаботаСДокументамиВызовСервера.ПолучитьСуммуОснованияДляПлатёжногоДокумента(ТекСтр.ДокументРегистратор);
	ЗаполнитьЗначенияСвойств(ТекСтр, ДанныеСуммы);
КонецПроцедуры

&НаКлиенте
Процедура ТЧПоДаннымОрганизацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле = Элементы.ТЧПоДаннымОрганизацииСтавкаНДС Или Поле = Элементы.ТЧПоДаннымОрганизацииСуммаНДС Тогда
		ТекСтр = Объект.ТЧПоДаннымОрганизации.НайтиПоИдентификатору(ВыбраннаяСтрока);
		РаботаСДокументамиКлиент.РедактироватьСуммыНДСПлатёжногоДокумента(ТекСтр, ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область Оповещения

&НаКлиенте
Процедура ПослеЗакрытияФормыРедактированияНДСПлатёжногоДокумента(МасДанные, СтрОснованиеПлатежа) Экспорт
	Если МасДанные = Неопределено Тогда Возврат КонецЕсли;
	Модифицированность = Истина;
	РаботаСДокументамиКлиент.ЗаполнитьСуммыНДСПлатёжногоДокумента(СтрОснованиеПлатежа, МасДанные);
КонецПроцедуры

#КонецОбласти

#Область Дополнительно

&НаКлиенте
Функция ПроверитьПравильностьДанных()
	Результат = Истина;
	ТекстОшибки = "";
	Если Объект.НачалоПериода > Объект.КонецПериода Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(ТекстОшибки, Нстр("fr = 'Date de début de période > date de fin de période'; ru = 'Дата начала периода > даты окончания периода'; en = 'Period start date \u003e Period end dates'; es = 'Fecha de Inicio del período \u003e fechas de finalización del período'"));
		Результат = Ложь;
	КонецЕсли;
	Если Результат = Ложь Тогда
		ПоказатьПредупреждение(, ТекстОшибки,, "Внимание");	
	КонецЕсли;	
	Возврат Результат;
КонецФункции	

&НаСервере
Процедура ПолучитьОстаткиИОборотыПоКонтрагенту(ПоДаннымОрганизации)
	Об = РеквизитФормыВЗначение("Объект");
	Об.ПолучитьОстаткиИОборотыПоКонтрагенту(ПоДаннымОрганизации);
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры

#КонецОбласти  

