
#Область Интерфейс

// Учётная запись - Учётная запись электронной почты (Справочник)
// Получатели - Массив адресов (Строка)
Функция ОтправитьСообщение(УчётнаяЗапись, Получатели, Тема, ТекстПисьма = "", Вложения = Неопределено, ТипТекста = Неопределено) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Результат = Новый Структура("Отправлено, Описание", Истина, "E-Mail отправлен");
	// Обработаем получателей
	Если ТипЗнч(Получатели) = Тип("Строка") Тогда
		МасПолучатели = СтрРазделить(Получатели, ";", Ложь);
	ИначеЕсли ТипЗнч(Получатели) = Тип("Массив") Тогда
		МасПолучатели = Получатели;	
	Иначе
		МасПолучатели = Новый Массив;	
	КонецЕсли;
	// Обработаем вложения
	Если ТипЗнч(Вложения) = Тип("Строка") Тогда
		МасВложения = СтрРазделить(Вложения, ";", Ложь);
	ИначеЕсли ТипЗнч(Вложения) = Тип("Массив") Тогда
		МасВложения = Вложения;	
	Иначе
		МасВложения = Новый Массив;	
	КонецЕсли;
	// Формируем сообщение
	Письмо = Новый ИнтернетПочтовоеСообщение;
	Письмо.Тема = Тема;
	Письмо.Тексты.Добавить(ТекстПисьма, ?(ТипТекста = Неопределено, ТипТекстаПочтовогоСообщения.ПростойТекст, ТипТекста));	
	Письмо.Отправитель = СокрЛП(УчётнаяЗапись.АдресЭлектроннойПочты);
	Письмо.ИмяОтправителя = СокрЛП(УчётнаяЗапись.ИмяОтправителя);
	Для Каждого Адрес Из МасПолучатели Цикл
    	Письмо.Получатели.Добавить(ОбщегоНазначенияКлиентСервер.УдалитьНеиспользуемыеСимволы(Адрес));
	КонецЦикла;
	Для Каждого Стр Из МасВложения Цикл
		Если ТипЗнч(Стр) = Тип("Строка") Тогда
			Письмо.Вложения.Добавить(Стр);
		ИначеЕсли ТипЗнч(Стр) = Тип("Структура") Тогда
			Вложение = Письмо.Вложения.Добавить(Стр.Данные, Стр.ИмяФайла);
			Если Стр.Свойство("Имя") и ЗначениеЗаполнено(Стр.Имя) Тогда
				Вложение.Имя = Стр.Имя;	
			КонецЕсли;
			Если Стр.Свойство("Идентификатор") и ЗначениеЗаполнено(Стр.Идентификатор) Тогда
				Вложение.Идентификатор = Стр.Идентификатор;	
			КонецЕсли;
			Если Стр.Свойство("ТипСодержимого") и ЗначениеЗаполнено(Стр.ТипСодержимого) Тогда
				Вложение.ТипСодержимого = Стр.ТипСодержимого;	
			КонецЕсли;
			Если Стр.Свойство("Кодировка") и ЗначениеЗаполнено(Стр.Кодировка) Тогда
				Вложение.Кодировка = Стр.Кодировка;	
			КонецЕсли;
			Если Стр.Свойство("СпособКодирования") и ЗначениеЗаполнено(Стр.СпособКодирования) Тогда
				Вложение.СпособКодирования = Стр.СпособКодирования;	
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
	// Отправляем
	Подключение = Подключиться(УчётнаяЗапись);
	Если Подключение.Подключено Тогда
		Попытка
        	Подключение.Почта.Послать(Письмо, ОбработкаТекстаИнтернетПочтовогоСообщения.НеОбрабатывать);
			Подключение.Почта.Отключиться();
		Исключение
			Результат.Отправлено = Ложь;
			Результат.Описание = ОписаниеОшибки();
   		КонецПопытки;	
	Иначе	
		Результат.Отправлено = Ложь;
		Результат.Описание = Подключение.Описание;
	КонецЕсли;    
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Результат;
КонецФункции

Функция Подключиться(УчётнаяЗапись) Экспорт
	Результат = Новый Структура("Почта, Подключено, Описание", Новый ИнтернетПочта, Ложь, "");
	Профиль = СоздатьПочтовыйПрофиль(УчётнаяЗапись);
	Протокол = ?(УчётнаяЗапись.ПротоколВходящейПочты = "IMAP", ПротоколИнтернетПочты.IMAP, ПротоколИнтернетПочты.POP3);
	Попытка
		Результат.Почта.Подключиться(Профиль, Протокол);
		Результат.Подключено = Истина;
	Исключение
		Результат.Подключено = Ложь;
		Результат.Описание = ОписаниеОшибки();
	КонецПопытки;	
	Возврат Результат;
КонецФункции	

Функция СоздатьПочтовыйПрофиль(УчётнаяЗапись)
	Профиль = Новый ИнтернетПочтовыйПрофиль;
	Профиль.Пользователь = СокрЛП(УчётнаяЗапись.Пользователь);
	Профиль.Пароль = СокрЛП(УчётнаяЗапись.Пароль);
	// Исходящая
	Профиль.АдресСервераSMTP = СокрЛП(УчётнаяЗапись.СерверИсходящейПочты);
	Профиль.ПортSMTP = УчётнаяЗапись.ПортСервераИсходящейПочты;
	Профиль.ИспользоватьSSLSMTP = УчётнаяЗапись.ИспользоватьЗащищенноеСоединениеДляИсходящейПочты;
	Если УчётнаяЗапись.ОдинаковыеДанныеАутентификации Тогда
		Профиль.ПользовательSMTP = СокрЛП(УчётнаяЗапись.Пользователь);
		Профиль.ПарольSMTP = СокрЛП(УчётнаяЗапись.Пароль);	
	Иначе	
		Профиль.ПользовательSMTP = СокрЛП(УчётнаяЗапись.ПользовательSMTP);
		Профиль.ПарольSMTP = СокрЛП(УчётнаяЗапись.ПарольSMTP);
	КонецЕсли;
	Профиль.АутентификацияSMTP = СпособSMTPАутентификации.ПоУмолчанию;
	// Входящая
	Если УчётнаяЗапись.ПротоколВходящейПочты = "IMAP" Тогда
		Профиль.АдресСервераIMAP = СокрЛП(УчётнаяЗапись.СерверВходящейПочты);
	    Профиль.ПортIMAP = УчётнаяЗапись.ПортСервераВходящейПочты;
		Профиль.ИспользоватьSSLIMAP = УчётнаяЗапись.ИспользоватьЗащищенноеСоединениеДляВходящейПочты;
		Если УчётнаяЗапись.ОдинаковыеДанныеАутентификации Тогда
			Профиль.ПользовательIMAP = СокрЛП(УчётнаяЗапись.Пользователь);
			Профиль.ПарольIMAP = СокрЛП(УчётнаяЗапись.Пароль);	
		Иначе
			Профиль.ПользовательIMAP = СокрЛП(УчётнаяЗапись.ПользовательIMAP);
			Профиль.ПарольIMAP = СокрЛП(УчётнаяЗапись.ПарольIMAP);
		КонецЕсли;
	Иначе // POP3
		Профиль.АдресСервераPOP3 = СокрЛП(УчётнаяЗапись.СерверВходящейПочты);
	    Профиль.ПортPOP3 = УчётнаяЗапись.ПортСервераВходящейПочты;
		Профиль.ИспользоватьSSLPOP3 = УчётнаяЗапись.ИспользоватьЗащищенноеСоединениеДляВходящейПочты;
		Профиль.АутентификацияPOP3 = СпособPOP3Аутентификации.Обычная;
	КонецЕсли;    
	Возврат Профиль;
КонецФункции

#КонецОбласти




