
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Заголовок") Тогда
		ЭтаФорма.АвтоЗаголовок = Ложь;
		ЭтаФорма.Заголовок = Параметры.Заголовок;
	КонецЕсли;
	Если Параметры.Отбор.Свойство("Контрагент") Тогда
		Элементы.Контрагент.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура СделатьОсновным(Команда)
	СделатьОсновнымНаСервере(Элементы.Список.ТекущиеДанные.Ссылка);
	ОповеститьОбИзменении(Тип("СправочникСсылка.ДоговорыСКонтрагентами"));
КонецПроцедуры

#КонецОбласти

#Область Дополнительно

&НаСервере
Процедура СделатьОсновнымНаСервере(ОсновнойДоговор)
	НачатьТранзакцию();
	Попытка
		Договор = ОсновнойДоговор.ПолучитьОбъект();
		Договор.Основной = Не Договор.Основной;
		Договор.Записать();
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ДоговорыСКонтрагентами.Ссылка КАК Ссылка
		                      |ИЗ
		                      |	Справочник.ДоговорыСКонтрагентами КАК ДоговорыСКонтрагентами
		                      |ГДЕ
		                      |	ДоговорыСКонтрагентами.Контрагент = &Контрагент
		                      |	И ДоговорыСКонтрагентами.Организация = &Организация
		                      |	И ДоговорыСКонтрагентами.Ссылка <> &ОсновнойДоговор");
		Запрос.УстановитьПараметр("Контрагент", ОсновнойДоговор.Контрагент);
		Запрос.УстановитьПараметр("Организация", ОсновнойДоговор.Организация);
		Запрос.УстановитьПараметр("ОсновнойДоговор", ОсновнойДоговор);
		Выб = Запрос.Выполнить().Выбрать();
		Пока Выб.Следующий() Цикл
			Договор = Выб.Ссылка.ПолучитьОбъект();
			Договор.Основной = Ложь;
			Договор.Записать();
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Сообщить(Нстр("fr = 'Impossible de faire le principal'; ru = 'Не удалось сделать основным'; en = ""Couldn't make it basic""; es = 'No se puede hacer principal'"), СтатусСообщения.ОченьВажное);
		ВызватьИсключение;	
	КонецПопытки;
КонецПроцедуры

#КонецОбласти

