
#Область Обработчики_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.Сумма = Объект.ТЧСотрудники.Итог("Сумма");
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить(РаботаСДокументами.СвойствоЗаписьИзФормы(), Истина);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, ТекущийОбъект);
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	МасСотрудники = Новый Массив;
	Если ЗначениеЗаполнено(Объект.Основание) Тогда 
		МасСотрудники = Объект.Основание.ТЧСотрудники.ВыгрузитьКолонку("Сотрудник");
	КонецЕсли;
	ТЗ = РегистрыНакопления.Зарплата.ПолучитьОстаткиПоСотрудникам(Объект,МасСотрудники);
	Объект.ТЧСотрудники.Загрузить(ТЗ);
КонецПроцедуры	

#КонецОбласти



