
Функция ПолучитьПоСотруднику(Период, Сотрудник) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПлановыеПоказатели.Показатель КАК Показатель,
	                      |	ПлановыеПоказатели.Показатель.SMART КАК SMART,
	                      |	ПлановыеПоказатели.Показатель.Веса КАК Веса,
	                      |	ПлановыеПоказатели.План КАК План,
	                      |	ПлановыеПоказатели.Факт КАК Факт,
	                      |	ПлановыеПоказатели.Стоимость КАК Стоимость,
	                      |	ПлановыеПоказатели.Комментарий КАК Комментарий,
	                      |	ПлановыеПоказатели.ID КАК ID,
	                      |	ПлановыеПоказатели.IDРодитель КАК IDРодитель
	                      |ИЗ
	                      |	РегистрСведений.ПлановыеПоказатели КАК ПлановыеПоказатели
	                      |ГДЕ
	                      |	ПлановыеПоказатели.Период = &Период
	                      |	И ПлановыеПоказатели.Сотрудник = &Сотрудник");
	Запрос.УстановитьПараметр("Период", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);	
	Возврат Запрос.Выполнить().Выгрузить();	
КонецФункции	

	