
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Для Каждого Стр Из Параметры.РасшифровкаНДС Цикл
		НС = ТЗ.Добавить();
		НС.СтавкаНДС = Справочники.СтавкиНДС.НайтиПоРеквизиту("Ставка",Стр.СтавкаНДС);
		НС.СуммаНДС = Стр.СуммаНДС;
		НС.СуммаСНДС = Стр.СуммаСНДС;
	КонецЦикла;
	ТЗ.Сортировать("СтавкаНДС");
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура Подтвердить(Команда)
	Закрыть(КонвертироватьДанныеВМассив());
КонецПроцедуры

#КонецОбласти

#Область Разное

&НаСервере
Функция КонвертироватьДанныеВМассив()
	Возврат РаботаСДокументами.КонвертироватьНДСПлатёжногоДокументаВМассив(ТЗ);	
КонецФункции	

#КонецОбласти
