 
#Область Обработчики_событий_формы 
 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Таб = Параметры.Таб;
	Если Параметры.Свойство("ИмяФайла") Тогда
		ИмяФайла = Параметры.ИмяФайла;
	Иначе
		ИмяФайла = Таб.ИспользуемоеИмяФайла;	
	КонецЕсли;
	Заголовок = ?(ЗначениеЗаполнено(ИмяФайла), "Impression: " + ИмяФайла, "Aperçu");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПрисоединённыеФайлыКлиент.УстановитьПодключитьРасширениеРаботыСФайлами(Истина);
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура СохранитьPDF(Команда)
	Сохранить(ТипФайлаТабличногоДокумента.PDF);
КонецПроцедуры

&НаКлиенте
Процедура СохранитьXLSX(Команда)
	Сохранить(ТипФайлаТабличногоДокумента.XLSX);
КонецПроцедуры

&НаКлиенте
Асинх Процедура Сохранить(ТипФайла)
	ДВФ = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Обещание = ДВФ.ВыбратьАсинх();
	МасКаталоги = Ждать Обещание;
	Если МасКаталоги = Неопределено Тогда Возврат КонецЕсли;
	Если ТипФайла = ТипФайлаТабличногоДокумента.PDF Тогда
		Расширение = ".pdf";	
	ИначеЕсли ТипФайла = ТипФайлаТабличногоДокумента.XLSX Тогда
		Расширение = ".xlsx";
	КонецЕсли;	
	Обещание = Таб.ЗаписатьАсинх(МасКаталоги[0] + "\" + ИмяФайла + Расширение, ТипФайла);
	Результат = Ждать Обещание;
КонецПроцедуры	

#КонецОбласти
