     
#Область Формирование_назначения_платежа

Процедура СформироватьТекстНазначенияПлатежа(Объект) Экспорт
	Если РаботаСДокументамиКлиентСервер.ЕстьРеквизит(Объект, "ПроведеноБанком") и Объект.ПроведеноБанком Тогда Возврат КонецЕсли;
	ТекстНазначение = "";	
	Если ПустаяСтрока(ТекстНазначение) Тогда
		ТекстНазначение = НазначениеПлатежа(Объект);
	Иначе
		ТекстСумма = "Сумма " + Формат(Объект.Сумма, ФорматСуммы());
		ТЗОснования = РаботаСДокументами.РазвернутьНДСПлатёжногоДокумента(Объект.ТЧОснования.Выгрузить());
		ТекстСуммаНДС = ТекстСуммаНДСПлатежа(Объект.Организация, Константы.ВалютаРегламентированногоУчета.Получить(), ТЗОснования, Истина);
		ТекстНазначение = ТекстНазначение + Символы.ПС + ТекстСумма + Символы.ПС + ТекстСуммаНДС;
	КонецЕсли;	
	Объект.НазначениеПлатежа = ТекстНазначение;	
КонецПроцедуры

Функция НазначениеПлатежаСотрудникам(Объект)
	Результат = "";
	ТЗОснования = РаботаСДокументами.РазвернутьНДСПлатёжногоДокумента(Объект.ТЧОснования.Выгрузить());
	СуммаОснований = ТЗОснования.Итог("Сумма");
	СуммаАвансов = Объект.Сумма - СуммаОснований;
	ВалютаДляПечати = ПредставлениеВалюты(Константы.ВалютаРегламентированногоУчета.Получить());
	Если РаботаСДокументамиКлиентСервер.ЕстьРеквизит(Объект, "Контрагент") и ЗначениеЗаполнено(Объект.Контрагент) и ТипЗнч(Объект.Контрагент) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		Получатель = Объект.Контрагент;
		ПолучательПол = Получатель.Пол; 
	Иначе
		Получатель = "";
		ПолучательПол = Неопределено;
	КонецЕсли; 
	ТЗОснованияВрем = ТЗОснования.Скопировать();
	Если СуммаАвансов > 0 Тогда
		НС = ТЗОснованияВрем.Добавить();
		НС.Сумма = СуммаАвансов;
	КонецЕсли;	
	ТЗОснованияВрем.Свернуть("НазначениеПлатежа", "Сумма");
	ТЗОснованияВрем.Колонки.Добавить("ФИО", Метаданные.ОпределяемыеТипы.Комментарий.Тип);
	Для Каждого Стр Из ТЗОснованияВрем Цикл
		Если ПустаяСтрока(Стр.НазначениеПлатежа) Тогда 
			Стр.НазначениеПлатежа = "Для зачисления на счет";
			Падеж = ОбщегоНазначения.Падежи().Родительный;	
		Иначе
			Падеж = ОбщегоНазначения.Падежи().Дательный;	
		КонецЕсли;
		Стр.ФИО = ОбщегоНазначения.ПросклонятьСтроку(Строка(Получатель), Падеж, ПолучательПол);
	КонецЦикла;	
	Для Каждого Стр Из ТЗОснованияВрем Цикл
		НазначениеПлатежа = Стр.НазначениеПлатежа;
		ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(НазначениеПлатежа, Стр.ФИО, " ");
		ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(НазначениеПлатежа, "Сумма " + Формат(Стр.Сумма, ФорматСуммы()), " ");
		ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(НазначениеПлатежа, ВалютаДляПечати, " ");
		ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(Результат, НазначениеПлатежа, ", ");	
	КонецЦикла;	 
	// НДС	
	ТекстСуммаНДС = ТекстСуммаНДСПлатежа(Объект.Организация, ВалютаДляПечати, ТЗОснования, Истина);	
	РазместитьТекстСуммыНДС(Результат, ТекстСуммаНДС);	
	Возврат Результат;	
КонецФункции

Функция НазначениеПлатежа(Объект)	
	Результат = "";
	ТЗОснования = РаботаСДокументами.РазвернутьНДСПлатёжногоДокумента(Объект.ТЧОснования.Выгрузить());
	ТЗОснованияВрем = ТЗОснования.Скопировать();
	ТЗОснованияВрем.Свернуть("Основание, НазначениеПлатежа", "Сумма");
	СуммаОснований = ТЗОснования.Итог("Сумма"); 
	СуммаАвансов = Объект.Сумма - СуммаОснований;
	ВалютаДляПечати = ПредставлениеВалюты(Константы.ВалютаРегламентированногоУчета.Получить());	
	ПредставленияДокументов = ПолучитьПредставленияДокументов();	
	// Разделим строки назначений платежа
	МасБезОснований = Новый Массив;
	МасСОснованиями = Новый Массив;
	Для Каждого Стр Из ТЗОснованияВрем Цикл
		Если ПустаяСтрока(Стр.НазначениеПлатежа) Тогда
			МасСОснованиями.Добавить(Стр);
		Иначе	
			МасБезОснований.Добавить(Стр);		
		КонецЕсли;	
	КонецЦикла;
	// Сформируем назначение без оснований
	Для Каждого Стр Из МасБезОснований Цикл
		НазначениеПлатежа = Стр.НазначениеПлатежа;
		ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(НазначениеПлатежа, "Сумма " + Формат(Стр.Сумма, ФорматСуммы()), " ");
		ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(НазначениеПлатежа, ВалютаДляПечати, " ");
		ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(Результат, НазначениеПлатежа, ", ");	
	КонецЦикла;	
	// Сформируем назначения с основаниями
	РезультатНакладные = "";
	Для Каждого Стр Из МасСОснованиями Цикл
		НазначениеПлатежа = "";
		ДокОснование = Стр.Основание;
		Если ЗначениеЗаполнено(ДокОснование) Тогда
			ВидДокумента = "";
			ПредставленияДокументов.Свойство(ДокОснование.Метаданные().Имя, ВидДокумента);
			Если ЗначениеЗаполнено(ВидДокумента) Тогда  
				НазначениеПлатежа = ВидДокумента;
				Если ТипЗнч(ДокОснование) = Тип("ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств") Или ТипЗнч(ДокОснование) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
					НомерДокумента = ?(ЗначениеЗаполнено(ДокОснование.НомерВходящегоДокумента), ДокОснование.НомерВходящегоДокумента, РаботаСДокументами.СформироватьЦифровойНомер(ДокОснование.Номер));
					ДатаДокумента = ?(ЗначениеЗаполнено(ДокОснование.ДатаВходящегоДокумента), ДокОснование.ДатаВходящегоДокумента, ДокОснование.Дата);
				Иначе
					НомерДокумента = РаботаСДокументами.СформироватьЦифровойНомер(ДокОснование.Номер);
					ДатаДокумента = ДокОснование.Дата;
				КонецЕсли;
				ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(НазначениеПлатежа, НомерДокумента, " №");
				ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(НазначениеПлатежа, Формат(ДатаДокумента, "ДЛФ=D"), " от ");
			КонецЕсли;
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(НазначениеПлатежа, "Сумма " + Формат(Стр.Сумма, ФорматСуммы()), " ");
		ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(НазначениеПлатежа, ВалютаДляПечати, " ");
		ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(РезультатНакладные, НазначениеПлатежа, ", "); 
	КонецЦикла;
	Если Не ПустаяСтрока(РезультатНакладные) Тогда
		Результат = Результат + ?(ПустаяСтрока(Результат), "", " ") + "Оплата по " + РезультатНакладные;	
	КонецЕсли;
	Если СуммаАвансов > 0 Тогда		
		Если СуммаОснований > 0 Тогда 
			ТекстНераспределённого = "без указания назначения ";
		Иначе
			ТекстНераспределённого = "договору № " + Объект.Договор.Код + " от " + Формат(Объект.Договор.ДатаДоговора, "ДЛФ=D");	
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(Результат, ТекстНераспределённого + Формат(СуммаАвансов, ФорматСуммы()) + " " + ВалютаДляПечати, ", ");
	КонецЕсли;
	Если Прав(Результат, 1) <> "." Тогда
		Результат = Результат + ".";
	КонецЕсли;	
	ТекстСуммаНДС = ТекстСуммаНДСПлатежа(Объект.Организация, ВалютаДляПечати, ТЗОснования, Истина);	
	РазместитьТекстСуммыНДС(Результат, ТекстСуммаНДС);
	Возврат Результат;	
КонецФункции

Функция ТекстСуммаНДСПлатежа(Организация, ВалютаДляПечати, ТЗОснования, ДобавлятьТекстВТомЧисле) Экспорт
	Результат = "";
	ТЗНДС = ТЗОснования.Скопировать(, "СтавкаНДС, СуммаНДС");
	ТЗНДС.Свернуть("СтавкаНДС", "СуммаНДС");		
	Для Каждого Стр Из ТЗНДС Цикл
		Если Стр.СтавкаНДС.Ставка = 0 Или Не ЗначениеЗаполнено(Стр.СтавкаНДС) Тогда Продолжить КонецЕсли;
		СтрокаНДС = "НДС (" + Стр.СтавкаНДС + ") " + Формат(Стр.СуммаНДС, ФорматСуммы()) + " " + ВалютаДляПечати;
		ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(Результат, СтрокаНДС, ", ");
	КонецЦикла;
	Если ПустаяСтрока(Результат) Тогда
		Результат = "Без налога (НДС)";
	Иначе
		Если ДобавлятьТекстВТомЧисле Тогда
			Результат = "В т.ч." + " " + Результат;
		КонецЕсли;
	КонецЕсли;	
	Возврат Результат;	
КонецФункции

Функция ПолучитьПредставленияДокументов()
	Результат = Новый Структура;
	Результат.Вставить("ПоступлениеТоваровУслуг", "накладной");
	Результат.Вставить("ВозвратПоставщику", "возврату");
	Результат.Вставить("РеализацияТоваровУслуг", "накладной");
	Результат.Вставить("ВозвратОтПокупателя", "возврату");
   	Результат.Вставить("ПоступлениеБезналичныхДенежныхСредств", "платёжному поручению");
	Возврат Результат;	
КонецФункции

Процедура РазместитьТекстСуммыНДС(НазначениеПлатежа, ТекстСуммаНДС)
	ДлинаТекстаПолучателей = СтрДлина(НазначениеПлатежа);
	ДлинаТекстаНДС = СтрДлина(ТекстСуммаНДС);	
	Если ДлинаТекстаПолучателей + ДлинаТекстаНДС > 210 Тогда		
		ДлинаТекстаПолучателей = 207 - ДлинаТекстаНДС;
		НазначениеПлатежа = Лев(НазначениеПлатежа, ДлинаТекстаПолучателей);
		ТекстПоискаПоследнегоНазначения = НазначениеПлатежа;
		ПозицияПоследнейЗапятой = 0;
		ПозицияЗапятой = СтрНайти(ТекстПоискаПоследнегоНазначения, ",");		
		Пока Не ПозицияЗапятой = 0 Цикл			
			ПозицияПоследнейЗапятой = ПозицияПоследнейЗапятой + ПозицияЗапятой;
			ТекстПоискаПоследнегоНазначения = Сред(ТекстПоискаПоследнегоНазначения, ПозицияЗапятой + 1);
			ПозицияЗапятой = СтрНайти(ТекстПоискаПоследнегоНазначения, ",");			
		КонецЦикла;		
		НазначениеПлатежа = Лев(НазначениеПлатежа, ПозицияПоследнейЗапятой - 1) + "...";		
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(НазначениеПлатежа, ТекстСуммаНДС, Символы.ПС);	
КонецПроцедуры	

Функция ФорматСуммы()
	Возврат "ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ=";	
КонецФункции

Функция ПредставлениеВалюты(Валюта)
	Если Валюта.Код = "643" Тогда
		Возврат "руб.";
	Иначе
		Возврат СокрЛП(Валюта.Наименование);
	КонецЕсли;	
КонецФункции	

#КонецОбласти
