
#Область Интерфейс

Процедура ЗаполнитьПлатёжныеДокументы() Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Списание.Ссылка КАК Документ,
	                      |	Списание.Проведен КАК Проведен,
	                      |	ВЫБОР
	                      |		КОГДА Списание.Проведен
	                      |			ТОГДА 1
	                      |		ИНАЧЕ 0
	                      |	КОНЕЦ КАК СостояниеДокумента,
	                      |	ЗНАЧЕНИЕ(Перечисление.СостоянияБанковскихДокументов.Подготовлено) КАК Состояние,
	                      |	Списание.Номер КАК Номер,
	                      |	Списание.Дата КАК Дата,
	                      |	Списание.ВидПлатежа КАК ВидПлатежа,
	                      |	Списание.ПеречислениеВБюджет КАК ПеречислениеВБюджет,
	                      |	Списание.ОчередностьПлатежа КАК ОчередностьПлатежа,
	                      |	ВЫРАЗИТЬ(Списание.НазначениеПлатежа КАК СТРОКА(210)) КАК НазначениеПлатежа,
	                      |	Списание.Сумма КАК СуммаДокумента,
	                      |	Списание.ИННПлательщика КАК ИННПлательщика,
	                      |	Списание.КПППлательщика КАК КПППлательщика,
	                      |	Списание.ИННПолучателя КАК ИННПолучателя,
	                      |	Списание.КПППолучателя КАК КПППолучателя,
	                      |	Списание.КодБК КАК КодБК,
	                      |	Списание.КодОКТМО КАК КодОКАТО,
	                      |	Списание.ПоказательДаты КАК ПоказательДаты,
	                      |	Списание.ПоказательНомера КАК ПоказательНомера,
	                      |	Списание.ПоказательОснования КАК ПоказательОснования,
	                      |	Списание.ПоказательПериода КАК ПоказательПериода,
	                      |	Списание.ПоказательТипа КАК ПоказательТипа,
	                      |	Списание.СтатусСоставителя КАК СтатусСоставителя,
	                      |	Списание.Организация КАК Организация,
	                      |	Списание.БанковскийСчёт КАК БанковскийСчёт,
	                      |	Списание.Организация.Наименование КАК ОрганизацияКратко,
	                      |	Списание.Организация.НаименованиеПолное КАК ОрганизацияПеречислениеНалога,
	                      |	Списание.ИННПлательщика КАК ОрганизацияИНН,
	                      |	Списание.КПППлательщика КАК ОрганизацияКПП,
	                      |	Списание.БанковскийСчёт КАК ОрганизацияСчет,
	                      |	Списание.БанковскийСчёт.НомерСчёта КАК ОрганизацияНомерСчета,
	                      |	Списание.БанковскийСчёт.Банк.Код КАК ОрганизацияБИКБанка,
	                      |	Списание.БанковскийСчёт.Банк.Наименование КАК ОрганизацияБанк,
	                      |	Списание.БанковскийСчёт.Банк.КоррСчёт КАК ОрганизацияРасчСчет,
	                      |	Списание.БанковскийСчёт.Банк.Город КАК ОрганизацияГородБанка,
	                      |	Списание.БанковскийСчёт.БанкДляРасчётов.Наименование КАК ОрганизацияБанкДляРасчетов,
	                      |	Списание.БанковскийСчёт.БанкДляРасчётов.Город КАК ОрганизацияГородРЦБанка,
	                      |	Списание.БанковскийСчёт.БанкДляРасчётов.Код КАК ОрганизацияБИКРЦБанка,
	                      |	Списание.БанковскийСчёт.БанкДляРасчётов.КоррСчёт КАК ОрганизацияКоррСчетРЦБанка,
	                      |	Списание.БанковскийСчёт.ВыводитьСуммуБезКопеек КАК СуммаБезКопеек,
	                      |	Списание.Контрагент КАК Контрагент,
	                      |	Списание.Контрагент.Наименование КАК КонтрагентКратко,
	                      |	Списание.ИННПолучателя КАК КонтрагентИНН,
	                      |	Списание.КПППолучателя КАК КонтрагентКПП,
	                      |	Списание.БанковскийСчётКонтрагента КАК КонтрагентСчет,
	                      |	Списание.БанковскийСчётКонтрагента.НомерСчёта КАК КонтрагентНомерСчета,
	                      |	Списание.БанковскийСчётКонтрагента.Банк.Код КАК КонтрагентБИКБанка,
	                      |	Списание.БанковскийСчётКонтрагента.Банк.Наименование КАК КонтрагентБанк,
	                      |	Списание.БанковскийСчётКонтрагента.Банк.КоррСчёт КАК КонтрагентРасчСчет,
	                      |	Списание.БанковскийСчётКонтрагента.Банк.Город КАК КонтрагентГородБанка,
	                      |	Списание.БанковскийСчётКонтрагента.БанкДляРасчётов.Наименование КАК КонтрагентБанкДляРасчетов,
	                      |	Списание.БанковскийСчётКонтрагента.БанкДляРасчётов.Город КАК КонтрагентГородРЦБанка,
	                      |	Списание.БанковскийСчётКонтрагента.БанкДляРасчётов.Код КАК КонтрагентБИКРЦБанка,
	                      |	Списание.БанковскийСчётКонтрагента.БанкДляРасчётов.КоррСчёт КАК КонтрагентКоррСчетРЦБанка,
	                      |	Списание.БанковскийСчёт.БанкДляРасчётов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка) КАК НепрямыеРасчетыУПлательщика,
	                      |	Списание.ИдентификаторПлатежа КАК ИдентификаторПлатежа
	                      |ИЗ
	                      |	Документ.СписаниеБезналичныхДенежныхСредств КАК Списание
	                      |ГДЕ
	                      |	Списание.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	                      |	И НЕ Списание.ПометкаУдаления
	                      |	И Списание.БанковскийСчёт = &БанковскийСчёт
	                      |	И НЕ Списание.ПроведеноБанком
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	Поступление.Ссылка,
	                      |	Поступление.Проведен,
	                      |	ВЫБОР
	                      |		КОГДА Поступление.Проведен
	                      |			ТОГДА 1
	                      |		ИНАЧЕ 0
	                      |	КОНЕЦ,
	                      |	ЗНАЧЕНИЕ(Перечисление.СостоянияБанковскихДокументов.Подготовлено),
	                      |	Поступление.Номер,
	                      |	Поступление.Дата,
	                      |	"""",
	                      |	ЛОЖЬ,
	                      |	"""",
	                      |	ВЫРАЗИТЬ(Поступление.НазначениеПлатежа КАК СТРОКА(210)),
	                      |	Поступление.Сумма,
	                      |	Поступление.ИННПлательщика,
	                      |	Поступление.КПППлательщика,
	                      |	Поступление.ИННПолучателя,
	                      |	Поступление.КПППолучателя,
	                      |	"""",
	                      |	"""",
	                      |	"""",
	                      |	"""",
	                      |	"""",
	                      |	"""",
	                      |	"""",
	                      |	"""",
	                      |	Поступление.Организация,
	                      |	Поступление.БанковскийСчёт,
	                      |	Поступление.Организация.Наименование,
	                      |	Поступление.Организация.НаименованиеПолное,
	                      |	Поступление.ИННПолучателя,
	                      |	Поступление.КПППолучателя,
	                      |	Поступление.БанковскийСчёт,
	                      |	Поступление.БанковскийСчёт.НомерСчёта,
	                      |	Поступление.БанковскийСчёт.Банк.Код,
	                      |	Поступление.БанковскийСчёт.Банк.Наименование,
	                      |	Поступление.БанковскийСчёт.Банк.КоррСчёт,
	                      |	Поступление.БанковскийСчёт.Банк.Город,
	                      |	Поступление.БанковскийСчёт.БанкДляРасчётов.Наименование,
	                      |	Поступление.БанковскийСчёт.БанкДляРасчётов.Город,
	                      |	Поступление.БанковскийСчёт.БанкДляРасчётов.Код,
	                      |	Поступление.БанковскийСчёт.БанкДляРасчётов.КоррСчёт,
	                      |	Поступление.БанковскийСчёт.ВыводитьСуммуБезКопеек,
	                      |	Поступление.Контрагент,
	                      |	Поступление.Контрагент.Наименование,
	                      |	Поступление.ИННПлательщика,
	                      |	Поступление.КПППлательщика,
	                      |	Поступление.БанковскийСчётКонтрагента,
	                      |	Поступление.БанковскийСчётКонтрагента.НомерСчёта,
	                      |	Поступление.БанковскийСчётКонтрагента.Банк.Код,
	                      |	Поступление.БанковскийСчётКонтрагента.Банк.Наименование,
	                      |	Поступление.БанковскийСчётКонтрагента.Банк.КоррСчёт,
	                      |	Поступление.БанковскийСчётКонтрагента.Банк.Город,
	                      |	Поступление.БанковскийСчётКонтрагента.БанкДляРасчётов.Наименование,
	                      |	Поступление.БанковскийСчётКонтрагента.БанкДляРасчётов.Город,
	                      |	Поступление.БанковскийСчётКонтрагента.БанкДляРасчётов.Код,
	                      |	Поступление.БанковскийСчётКонтрагента.БанкДляРасчётов.КоррСчёт,
	                      |	Поступление.БанковскийСчёт.БанкДляРасчётов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка),
	                      |	Поступление.ИдентификаторПлатежа
	                      |ИЗ
	                      |	Документ.ПоступлениеБезналичныхДенежныхСредств КАК Поступление
	                      |ГДЕ
	                      |	Поступление.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	                      |	И НЕ Поступление.ПометкаУдаления
	                      |	И Поступление.БанковскийСчёт = &БанковскийСчёт
	                      |	И НЕ Поступление.ПроведеноБанком");		
	МасБанковскиеСчета = ТЧБанковскиеСчета.НайтиСтроки(Новый Структура("Пометка", Истина));
	ТЧДокументыКВыгрузке.Очистить();
	КоллекцияЭлементов = Метаданные.Обработки.КлиентБанк.ТабличныеЧасти.ТЧДокументыКВыгрузке.Реквизиты;
	Для Каждого МасСтр Из МасБанковскиеСчета Цикл
		Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(МасСтр.ВыгрузкаНачалоПериода));
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(МасСтр.ВыгрузкаКонецПериода));
		Запрос.УстановитьПараметр("БанковскийСчёт", МасСтр.БанковскийСчёт);	
		Выб = Запрос.Выполнить().Выбрать();		
		Пока Выб.Следующий() Цикл
			НС = ТЧДокументыКВыгрузке.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Выб);			
			НС.НомерВФорматеВыгрузки = РаботаСДокументами.СформироватьЦифровойНомер(НС.Номер);
			ПроверитьНаКорректностьИПустоеЗначениеЭкспорта(НС, КоллекцияЭлементов);		
			НС.Выгружать = ПустаяСтрока(НС.ОписаниеОшибок) И НС.Состояние = Перечисления.СостоянияБанковскихДокументов.Подготовлено;		
			Если НС.Готовность = 0 Тогда
				НС.ОписаниеОшибок = "Документ готов к выгрузке.";
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

Функция ВыгрузитьДокументы(КлючУникальности) Экспорт
	ДатаСегодня = ТекущаяДатаСеанса();
	МасОписаниеФайлов = Новый Массив;
	МасБанковскиеСчета = ТЧБанковскиеСчета.НайтиСтроки(Новый Структура("Пометка", Истина));
	Для Каждого МасСтрСчёт Из МасБанковскиеСчета Цикл
		ПотокВыгрузки = Новый ТекстовыйДокумент();			
		// Формируем заголовок
		ПотокВыгрузки.ДобавитьСтроку("1CClientBankExchange");
		ПотокВыгрузки.ДобавитьСтроку("ВерсияФормата=" + ?(ПустаяСтрока(ВерсияФормата), "1.03", ВерсияФормата));	
		ПотокВыгрузки.ДобавитьСтроку("Кодировка=" + Кодировка);
		ПотокВыгрузки.ДобавитьСтроку("Отправитель=" + Метаданные.Синоним);
		ПотокВыгрузки.ДобавитьСтроку("Получатель=" + Программа);
		ПотокВыгрузки.ДобавитьСтроку("ДатаСоздания=" + Формат(ДатаСегодня, "ДЛФ=Д"));
		ПотокВыгрузки.ДобавитьСтроку("ВремяСоздания=" + Формат(ДатаСегодня, "ДЛФ=В"));
		ПотокВыгрузки.ДобавитьСтроку("ДатаНачала=" + Формат(МасСтрСчёт.ВыгрузкаНачалоПериода, "ДЛФ=Д"));
		ПотокВыгрузки.ДобавитьСтроку("ДатаКонца=" + Формат(МасСтрСчёт.ВыгрузкаКонецПериода, "ДЛФ=Д"));	
		ПотокВыгрузки.ДобавитьСтроку("РасчСчет=" + МасСтрСчёт.НомерСчёта);
		// Выводим отмеченные документы
		МасДокументы = ТЧДокументыКВыгрузке.НайтиСтроки(Новый Структура("БанковскийСчёт, Выгружать", МасСтрСчёт.БанковскийСчёт, Истина));	
		Если МасДокументы.Количество() = 0 Тогда Продолжить КонецЕсли;
		Для Каждого Стр Из МасДокументы Цикл
			Буфер = ПолучитьСекциюДокумент(Стр);
			КоличествоСрокСекции = СтрЧислоСтрок(Буфер);
			Для Сч = 1 По КоличествоСрокСекции Цикл
				ПотокВыгрузки.ДобавитьСтроку(СтрПолучитьСтроку(Буфер, Сч));
			КонецЦикла;		
			Стр.Готовность = -1;
		КонецЦикла;		
		ПотокВыгрузки.ДобавитьСтроку("КонецФайла");	
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("txt");	
		ПотокВыгрузки.Записать(ИмяВременногоФайла, ?(Кодировка = "DOS", "cp866", "windows-1251"));
		ОписаниеФайла = Новый ОписаниеПередаваемогоФайла;
		ОписаниеФайла.Хранение = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяВременногоФайла), КлючУникальности);
		ОписаниеФайла.Имя = "1c_to_kl_" + МасСтрСчёт.НомерСчёта + ".txt";
       	МасОписаниеФайлов.Добавить(ОписаниеФайла);
	КонецЦикла;	
	Возврат МасОписаниеФайлов;	
КонецФункции

Процедура ЗагрузитьДокументы(МасАдреса) Экспорт
	ТЧДокументыКЗагрузке.Очистить();
	ТЧИнформация.Очистить();
	Для Каждого Адрес Из МасАдреса Цикл		
		Данные = Новый Структура;
		Данные.Вставить("БанковскиеСчета", Новый Массив);
		Данные.Вставить("Документы", Новый Массив);	
		// Получим данные из файла
		ЧтениеДанных = Новый ЧтениеДанных(ПолучитьИзВременногоХранилища(Адрес));
		ЧтениеТекста = Новый ЧтениеТекста(ЧтениеДанных.ИсходныйПоток());
		Стр = ЧтениеТекста.ПрочитатьСтроку();
		Если Стр <> "1CClientBankExchange" Тогда Продолжить КонецЕсли;
		НС = Неопределено;
		Пока Стр <> Неопределено Цикл
			Если ЗначениеЗаполнено(Стр) Тогда 			
				МасДанные = СтрРазделить(Стр, "=", Ложь);
				Если МасДанные[0] = "СекцияРасчСчет" Тогда
					НС = Новый Структура;			
					Данные.БанковскиеСчета.Добавить(НС);
				ИначеЕсли МасДанные[0] = "СекцияДокумент" Тогда
					НС = Новый Структура;
					Данные.Документы.Добавить(НС);	
				ИначеЕсли МасДанные[0] = "КонецРасчСчет" Или МасДанные[0] = "КонецДокумента" Тогда
					НС = Неопределено;
				КонецЕсли;
				Если НС <> Неопределено и МасДанные.Количество() >= 2 Тогда
					ЗначениеТэга = ""; // На случай, если в строке еще встречаются такие же разделители
					Для А = 1 По МасДанные.Количество() - 1 Цикл
						ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(ЗначениеТэга, МасДанные[А], " = ");	
					КонецЦикла;	
					НС.Вставить(МасДанные[0], ЗначениеТэга);
				КонецЕсли;
			КонецЕсли;
			Стр = ЧтениеТекста.ПрочитатьСтроку();
		КонецЦикла;
		ЧтениеТекста.Закрыть();
		ЧтениеДанных.Закрыть();
		// Теги
		ТегПлательщикРасчётныйСчёт = "";
		ТегПолучательРасчётныйСчёт = "";	
		Если Данные.Документы.Количество() > 0 Тогда
			Стр = Данные.Документы[0];
			Если Стр.Свойство("ПлательщикРасчСчет") Тогда
				ТегПлательщикРасчётныйСчёт = "ПлательщикРасчСчет";
			Иначе
				ТегПлательщикРасчётныйСчёт = "ПлательщикСчет";	
			КонецЕсли;	
			Если Стр.Свойство("ПолучательРасчСчет") Тогда
				ТегПолучательРасчётныйСчёт = "ПолучательРасчСчет";
			Иначе
				ТегПолучательРасчётныйСчёт = "ПолучательСчет";	
			КонецЕсли;
		КонецЕсли;
		// Обработаем расчётные счета
		Для Каждого Стр Из Данные.БанковскиеСчета Цикл
			СтрСчёт = ТЧБанковскиеСчета.Найти(Стр.РасчСчет, "НомерСчёта");
			Если СтрСчёт = Неопределено Тогда 
				// Получим БИК банка организации, для поиска счёта
				Если Данные.Документы[0][ТегПлательщикРасчётныйСчёт] = Стр.РасчСчет Тогда
					БИК = Данные.Документы[0].ПлательщикБИК;			
				ИначеЕсли Данные.Документы[0][ТегПолучательРасчётныйСчёт] = Стр.РасчСчет Тогда	
					БИК = Данные.Документы[0].ПолучательБИК;	
				Иначе
					Продолжить; // В файле ошибка, но такого быть не должно	
				КонецЕсли;					
				ДанныеБанковскогоСчёта = Справочники.БанковскиеСчета.ПолучитьПоНомеру(Стр.РасчСчет, БИК, Истина);				
				Если ДанныеБанковскогоСчёта.БанковскийСчёт = Неопределено Тогда 
					Продолжить; // Такого банковского счёта нет в базе, пропускаем, автоматически не создаём
				КонецЕсли;	
				СтрСчёт = ТЧБанковскиеСчета.Добавить(); 
				ЗаполнитьЗначенияСвойств(СтрСчёт, ДанныеБанковскогоСчёта, "Наименование, НомерСчёта, БанковскийСчёт, Банк");
				СтрСчёт.Организация = ДанныеБанковскогоСчёта.Владелец;
			КонецЕсли;
			СтрСчёт.ЗагрузкаНачалоПериода = КонвертироватьДату(Стр.ДатаНачала);
			СтрСчёт.ЗагрузкаКонецПериода = КонвертироватьДату(Стр.ДатаКонца);
			СтрСчёт.Пометка = Истина;
		КонецЦикла;
		// Обработаем документы
		Для Каждого Стр Из Данные.Документы Цикл
			Если Стр.Свойство("ДатаСписано") Тогда
				СтрСчёт = ТЧБанковскиеСчета.Найти(Стр[ТегПлательщикРасчётныйСчёт], "НомерСчёта");
				Если СтрСчёт = Неопределено Тогда
					ДобавитьИнформацию("Не найден расчётный счёт организации - " + Стр[ТегПлательщикРасчётныйСчёт], Стр);
					Продолжить; 
				КонецЕсли;
				НС = ТЧДокументыКЗагрузке.Добавить();
				ЗаполнитьЗначенияСвойств(НС, Стр);
				НС.ТегПлательщикРасчётныйСчёт = ТегПлательщикРасчётныйСчёт;
				НС.ТегПолучательРасчётныйСчёт = ТегПолучательРасчётныйСчёт;
				НС.ДатаСписано = КонвертироватьДату(Стр.ДатаСписано);
				НС.СуммаСписано = Число(Стр.Сумма);
				БанковскийСчётКонтрагента = Справочники.БанковскиеСчета.ПолучитьПоНомеру(Стр[ТегПолучательРасчётныйСчёт], Стр.ПолучательБИК, Истина);
				Если БанковскийСчётКонтрагента.Владелец = Неопределено Тогда 
					БанковскийСчётКонтрагента = Справочники.БанковскиеСчета.ПолучитьПоНомеру(Стр[ТегПолучательРасчётныйСчёт], Стр.ПолучательБИК, Ложь);
				КонецЕсли;
				НС.КонтрагентНаименование = ?(РаботаСДокументамиКлиентСервер.ЕстьРеквизит(Стр,"Получатель1"), Стр.Получатель1, Стр.Получатель);
			ИначеЕсли Стр.Свойство("ДатаПоступило") Тогда	
				СтрСчёт = ТЧБанковскиеСчета.Найти(Стр[ТегПолучательРасчётныйСчёт], "НомерСчёта");
				Если СтрСчёт = Неопределено Тогда
					ДобавитьИнформацию("Не найден расчётный счёт организации - " + Стр[ТегПолучательРасчётныйСчёт], Стр);
					Продолжить; 
				КонецЕсли;
				НС = ТЧДокументыКЗагрузке.Добавить();
				ЗаполнитьЗначенияСвойств(НС, Стр);
				НС.ТегПлательщикРасчётныйСчёт = ТегПлательщикРасчётныйСчёт;
				НС.ТегПолучательРасчётныйСчёт = ТегПолучательРасчётныйСчёт;
				НС.ДатаПоступило = КонвертироватьДату(Стр.ДатаПоступило);
				НС.СуммаПоступило = Число(Стр.Сумма);
				БанковскийСчётКонтрагента = Справочники.БанковскиеСчета.ПолучитьПоНомеру(Стр[ТегПлательщикРасчётныйСчёт], Стр.ПлательщикБИК, Истина);
				Если БанковскийСчётКонтрагента.Владелец = Неопределено Тогда
					БанковскийСчётКонтрагента = Справочники.БанковскиеСчета.ПолучитьПоНомеру(Стр[ТегПлательщикРасчётныйСчёт], Стр.ПлательщикБИК, Ложь);
				КонецЕсли;
				НС.КонтрагентНаименование = ?(РаботаСДокументамиКлиентСервер.ЕстьРеквизит(Стр,"Плательщик1"), Стр.Плательщик1, Стр.Плательщик);
			Иначе
				ДобавитьИнформацию("Не определено, входящий или исходящий документ", Стр);
				Продолжить;
			КонецЕсли;
			НС.Дата = КонвертироватьДату(Стр.Дата);
			Если Стр.Свойство("СрокПлатежа") Тогда
				НС.СрокПлатежа = КонвертироватьДату(Стр.СрокПлатежа);
			КонецЕсли;
			НС.Организация = СтрСчёт.Организация;
			НС.БанковскийСчёт = СтрСчёт.БанковскийСчёт;
			Если ЗначениеЗаполнено(БанковскийСчётКонтрагента.БанковскийСчёт) Тогда
				НС.Контрагент = БанковскийСчётКонтрагента.Владелец;
				НС.БанковскийСчётКонтрагента = БанковскийСчётКонтрагента.БанковскийСчёт;
			КонецЕсли;
			НС.Загружать = Истина;
		КонецЦикла;
	КонецЦикла;
	// Получим документы
	ТЗДокументы = ПолучитьДокументы();
	Для Каждого Стр Из ТЧДокументыКЗагрузке Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Организация", Стр.Организация);
		Отбор.Вставить("БанковскийСчёт", Стр.БанковскийСчёт);
		Отбор.Вставить("Контрагент", Стр.Контрагент);
		Отбор.Вставить("БанковскийСчётКонтрагента", Стр.БанковскийСчётКонтрагента);	
		Отбор.Вставить("Сумма", ?(ЗначениеЗаполнено(Стр.СуммаПоступило), Стр.СуммаПоступило, Стр.СуммаСписано));	
		Отбор.Вставить("Поступление", ЗначениеЗаполнено(Стр.СуммаПоступило));
		Отбор.Вставить("НомерВходящегоДокумента", Стр.Номер);
		Отбор.Вставить("ДатаВходящегоДокумента", Стр.Дата);					
		Мас = ТЗДокументы.НайтиСтроки(Отбор); // Ищем по уже загруженным
		Если Мас.Количество() = 0 Тогда // По загруженным не нашли, ищем по отправленым с нашим номером входящего документа
			Отбор.Удалить("НомерВходящегоДокумента");
			Отбор.Удалить("ДатаВходящегоДокумента");
			Отбор.Вставить("Номер", Стр.Номер);
			Мас = ТЗДокументы.НайтиСтроки(Отбор);
			Если Мас.Количество() = 0 Тогда // Ничего не нашли, наверное поменяли номер платёжного поручения в рабочем кабинете банка, ищем пустые 
				Отбор.Удалить("Номер");
				Отбор.Вставить("НомерВходящегоДокумента", "");
				Отбор.Вставить("ДатаВходящегоДокумента", Дата(1,1,1));
				Мас = ТЗДокументы.НайтиСтроки(Отбор);
				Если Мас.Количество() = 0 Тогда Продолжить КонецЕсли; 
			КонецЕсли;
		КонецЕсли;	
		Стр.Документ = Мас[0].Ссылка;
		Стр.Загружать = Не Стр.Документ.ПроведеноБанком;
	КонецЦикла;	
КонецПроцедуры

Процедура СоздатьДокументы() Экспорт
	Мас = ТЧДокументыКЗагрузке.НайтиСтроки(Новый Структура("Загружать", Истина));
	НачатьТранзакцию();
	Для Каждого Стр Из Мас Цикл
		Если Не ЗначениеЗаполнено(Стр.Контрагент) Тогда 
			БанковскийСчётКонтрагента = Новый Структура("Наименование, НомерСчёта, БанковскийСчёт, Владелец, Банк"); 
			Если ЗначениеЗаполнено(Стр.СуммаСписано) Тогда 
				БанковскийСчётКонтрагента.Банк = Стр.ПолучательБИК;
				БанковскийСчётКонтрагента.НомерСчёта = Стр[Стр.ТегПолучательРасчётныйСчёт];
				БанковскийСчётКонтрагента.Владелец = Новый Структура;
				БанковскийСчётКонтрагента.Владелец.Вставить("ИНН", Стр.ПолучательИНН);
				БанковскийСчётКонтрагента.Владелец.Вставить("КПП", ?(РаботаСДокументамиКлиентСервер.ЕстьРеквизит(Стр,"ПолучательКПП"), Стр.ПолучательКПП, ""));
				БанковскийСчётКонтрагента.Владелец.Вставить("Наименование", ?(РаботаСДокументамиКлиентСервер.ЕстьРеквизит(Стр,"Получатель1"), Стр.Получатель1, Стр.Получатель));
			Иначе
				БанковскийСчётКонтрагента.Банк = Стр.ПлательщикБИК;
				БанковскийСчётКонтрагента.НомерСчёта = Стр[Стр.ТегПлательщикРасчётныйСчёт];
				БанковскийСчётКонтрагента.Владелец = Новый Структура;
				БанковскийСчётКонтрагента.Владелец.Вставить("ИНН", Стр.ПлательщикИНН);
				БанковскийСчётКонтрагента.Владелец.Вставить("КПП", ?(РаботаСДокументамиКлиентСервер.ЕстьРеквизит(Стр,"ПлательщикКПП"), Стр.ПлательщикКПП, ""));
				БанковскийСчётКонтрагента.Владелец.Вставить("Наименование", ?(РаботаСДокументамиКлиентСервер.ЕстьРеквизит(Стр,"Плательщик1"), Стр.Плательщик1, Стр.Плательщик));
			КонецЕсли;
			СоздатьКонтрагентаИБанковскийСчёт(БанковскийСчётКонтрагента);
			Стр.Контрагент = БанковскийСчётКонтрагента.Владелец;
			Стр.БанковскийСчётКонтрагента = БанковскийСчётКонтрагента.БанковскийСчёт;
		КонецЕсли;	
		Если ЗначениеЗаполнено(Стр.Документ) Тогда
			Док = Стр.Документ.ПолучитьОбъект();
		Иначе
			Док = ?(ЗначениеЗаполнено(Стр.СуммаСписано), Документы.СписаниеБезналичныхДенежныхСредств.СоздатьДокумент(), Документы.ПоступлениеБезналичныхДенежныхСредств.СоздатьДокумент()); 	
			Док.Заполнить(Стр);	
		КонецЕсли;
		Док.НомерВходящегоДокумента = Стр.Номер;
		Док.ДатаВходящегоДокумента = Стр.Дата;	
		Док.ПроведеноБанком = Истина;
		Док.ДатаПроведенияБанком = ?(ЗначениеЗаполнено(Стр.ДатаСписано), Стр.ДатаСписано, Стр.ДатаПоступило); 
		Док.Записать(РежимЗаписиДокумента.Проведение);		
		Стр.Документ = Док.Ссылка;
		Стр.Загружать = Ложь;
	КонецЦикла;
	ЗафиксироватьТранзакцию();
КонецПроцедуры	

#КонецОбласти

#Область Дополнительно

Процедура ПроверитьНаКорректностьИПустоеЗначениеЭкспорта(СтрокаДокумента, КоллекцияЭлементов)
	ПеречислениеНалога = Ложь;
	НепрямыеРасчетыУПлательщика = Ложь;
	НепрямыеРасчетыУПолучателя = Ложь;	
	Если СтрокаДокумента.ВидДокумента = "ПлатежноеПоручение" Тогда
		ПеречислениеНалога = ЗначениеЗаполнено(СтрокаДокумента.СтатусСоставителя);
		НепрямыеРасчетыУПлательщика = ЗначениеЗаполнено(СтрокаДокумента.ОрганизацияБанкДляРасчетов);
		НепрямыеРасчетыУПолучателя = ЗначениеЗаполнено(СтрокаДокумента.КонтрагентБанкДляРасчетов);
		СтрокаДокумента.ТипДокумента = ?(ПеречислениеНалога, 1, 0) * 4 + ?(НепрямыеРасчетыУПолучателя, 1, 0) * 2 + ?(НепрямыеРасчетыУПлательщика, 1, 0) + 1;
		Плательщик = "Организация";
		Получатель = "Контрагент";
		ПлательщикИНН = "ИННПлательщика";
		ПолучательИНН = "ИННПолучателя";
	Иначе
		СтрокаДокумента.ТипДокумента = 0;
		Плательщик = "Контрагент";
		Получатель = "Организация";
		ПлательщикИНН = "КонтрагентИНН";
		ПолучательИНН = "ОрганизацияИНН";
	КонецЕсли;	
	// РеквизитыПлДокЭкс_Основные
	Экспорт_НеПустые = Новый Структура("Номер, Дата, СуммаДокумента");
	Экспорт_НеПустые.Вставить(ПлательщикИНН);
	Экспорт_НеПустые.Вставить(Плательщик);
	Экспорт_НеПустые.Вставить(Плательщик + "Счет");	
	Если НепрямыеРасчетыУПлательщика Тогда
		// РеквизитыПлДокЭкс_ПлательщикНПР
		Экспорт_НеПустые.Вставить(Плательщик + "РасчСчет");
		Экспорт_НеПустые.Вставить(Плательщик + "БанкДляРасчетов");
		Экспорт_НеПустые.Вставить(Плательщик + "ГородБанка");
		Экспорт_НеПустые.Вставить(Плательщик + "БИКРЦБанка");
	КонецЕсли;	
	// РеквизитыПлДокЭкс_Получатель
	Экспорт_НеПустые.Вставить(ПолучательИНН);
	Экспорт_НеПустые.Вставить(Получатель);
	Экспорт_НеПустые.Вставить(Получатель + "Счет");	
	Если НепрямыеРасчетыУПолучателя Тогда
		// РеквизитыПлДокЭкс_ПолучательНПР
		Экспорт_НеПустые.Вставить(Получатель + "РасчСчет");
		Экспорт_НеПустые.Вставить(Получатель + "БанкДляРасчетов");
		Экспорт_НеПустые.Вставить(Получатель + "ГородБанка");
		Экспорт_НеПустые.Вставить(Получатель + "БИКРЦБанка");
	КонецЕсли;	
	Для Каждого Свойство Из Экспорт_НеПустые Цикл
		Если ЗначениеЗаполнено(СтрокаДокумента[Свойство.Ключ]) Тогда Продолжить КонецЕсли;
		ДобавитьЗамечание(СтрокаДокумента, 4, "Не заполнено поле " + КоллекцияЭлементов.Найти(Свойство.Ключ).Синоним);
	КонецЦикла;	
КонецПроцедуры

Процедура ДобавитьЗамечание(СтрокаДокумента, НоваяГотовность, ТекстЗамечания) Экспорт
	Если СтрокаДокумента.Готовность < НоваяГотовность Тогда
		СтрокаДокумента.Готовность = НоваяГотовность;
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(СтрокаДокумента.ОписаниеОшибок, ТекстЗамечания);
	СтрокаДокумента.ЕстьОшибка = НоваяГотовность <> 0;	
КонецПроцедуры

Функция ПолучитьСекциюДокумент(СтруктураДокумента)
	Буфер = "";
	Секция = СформироватьСтруктуруЭкспорта(ВерсияФормата);
	#Область Заполнение_секции
	Если СтруктураДокумента.ВидДокумента = "ПлатежноеТребование" Тогда
		Плательщик = "Контрагент";
		Получатель = "Организация";
	Иначе
		Плательщик = "Организация";
		Получатель = "Контрагент";
	КонецЕсли;	
	Секция.Номер = СтруктураДокумента.НомерВФорматеВыгрузки;
	Секция.Дата = Формат(СтруктураДокумента.Дата, "ДЛФ=Д");
	Секция.Сумма = Формат(СтруктураДокумента.СуммаДокумента, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧРГ=' '; ЧГ=0");
	Секция.ПлательщикСчет = СтруктураДокумента[Плательщик + "НомерСчета"];
	Секция.ПолучательСчет = СтруктураДокумента[Получатель + "НомерСчета"];
	Секция.ВидПлатежа = СтруктураДокумента.ВидПлатежа;
	
	НепрямыеРасчетыУПлательщика = ЗначениеЗаполнено(СтруктураДокумента[Плательщик + "БанкДляРасчетов"]);
	НепрямыеРасчетыУПолучателя = ЗначениеЗаполнено(СтруктураДокумента[Получатель + "БанкДляРасчетов"]);
	
	//Секция.ВидОплаты = Перечисления.ТипыПлатежныхДокументов.ПолучитьВидОплаты(СтруктураДокумента.ВидДокумента);	
	
	//Плательщик
	Секция.Плательщик = "ИНН " + СтруктураДокумента.ИННПлательщика + " " + СтруктураДокумента.ТекстПлательщика;	
	Секция.ПлательщикИНН = СтруктураДокумента.ИННПлательщика;
	Секция.Плательщик1 = СтруктураДокумента[Плательщик + "Кратко"];
	
	//ПлательщикРасчСчет, ПлательщикБанк1, ПлательщикБанк2, ПлательщикБИК, ПлательщикКорсчет,Плательщик2, Плательщик3, Плательщик4
	Если НепрямыеРасчетыУПлательщика Тогда
		Секция.Плательщик2 = СтруктураДокумента[Плательщик + "НомерСчета"];
		Секция.Плательщик3 = СтруктураДокумента[Плательщик + "Банк"];
		Секция.Плательщик4 = СтруктураДокумента[Плательщик + "ГородБанка"];
		Секция.Плательщик = Секция.Плательщик + " р/с " + Секция.Плательщик2 + " в " + Секция.Плательщик3 + " " + Секция.Плательщик4;
		Секция.ПлательщикРасчСчет = СтруктураДокумента[Плательщик + "РасчСчет"];
		Секция.ПлательщикБанк1 = СтруктураДокумента[Плательщик + "БанкДляРасчетов"];
		Секция.ПлательщикБанк2 = СтруктураДокумента[Плательщик + "ГородРЦБанка"];
		Секция.ПлательщикБИК = СтруктураДокумента[Плательщик + "БИКРЦБанка"];
		Секция.ПлательщикКорсчет = СтруктураДокумента[Плательщик + "КоррСчетРЦБанка"];
	Иначе
		Секция.ПлательщикРасчСчет = СтруктураДокумента[Плательщик + "НомерСчета"];
		Секция.ПлательщикБанк1 = СтруктураДокумента[Плательщик + "Банк"];
		Секция.ПлательщикБанк2 = СтруктураДокумента[Плательщик + "ГородБанка"];
		Секция.ПлательщикБИК = СтруктураДокумента[Плательщик + "БИКБанка"];
		Секция.ПлательщикКорсчет = СтруктураДокумента[Плательщик + "РасчСчет"];
	КонецЕсли;	
	
	//Получатель
	Секция.Получатель = "ИНН " + СтруктураДокумента.ИННПолучателя + " " + СтруктураДокумента.ТекстПолучателя;	
	Секция.ПолучательИНН = СтруктураДокумента.ИННПолучателя;
	Секция.Получатель1 = СтруктураДокумента.ТекстПолучателя;
	
	//ПолучательРасчСчет, ПолучательБанк1, ПолучательБанк2, ПолучательБИК, ПолучательКорсчет, Получатель2, Получатель3, Получатель4
	Если НепрямыеРасчетыУПолучателя Тогда
		Секция.Получатель2 = СтруктураДокумента[Получатель + "НомерСчета"];
		Секция.Получатель3 = СтруктураДокумента[Получатель + "Банк"];
		Секция.Получатель4 = СтруктураДокумента[Получатель + "ГородБанка"];
		Секция.Получатель = Секция.Получатель + " р/с " + Секция.Получатель2 + " в " + Секция.Получатель3 + " " + Секция.Получатель4;
		Секция.ПолучательРасчСчет = СтруктураДокумента[Получатель + "РасчСчет"];
		Секция.ПолучательБанк1 = СтруктураДокумента[Получатель + "БанкДляРасчетов"];
		Секция.ПолучательБанк2 = СтруктураДокумента[Получатель + "ГородРЦБанка"];
		Секция.ПолучательБИК = СтруктураДокумента[Получатель + "БИКРЦБанка"];
		Секция.ПолучательКорсчет = СтруктураДокумента[Получатель + "КоррСчетРЦБанка"];
	Иначе
		Секция.ПолучательРасчСчет = СтруктураДокумента[Получатель + "НомерСчета"];
		Секция.ПолучательБанк1 = СтруктураДокумента[Получатель + "Банк"];
		Секция.ПолучательБанк2 = СтруктураДокумента[Получатель + "ГородБанка"];
		Секция.ПолучательБИК = СтруктураДокумента[Получатель + "БИКБанка"];
		Секция.ПолучательКорсчет = СтруктураДокумента[Получатель + "РасчСчет"];
	КонецЕсли;	
	
	// КПП
	Секция.ПлательщикКПП = СтруктураДокумента.КПППлательщика;
	Секция.ПолучательКПП = СтруктураДокумента.КПППолучателя;
	
	КодПредусмотренСтандартамиОбмена = Секция.Свойство("Код");
	Если КодПредусмотренСтандартамиОбмена Тогда
		Если Не ПустаяСтрока(СтруктураДокумента.ИдентификаторПлатежа) Тогда
			Секция.Код = СтруктураДокумента.ИдентификаторПлатежа;
		КонецЕсли;
	КонецЕсли;	
	//СтатусСоставителя, ПлательщикКПП ПолучательКПП ПоказательКБК ОКАТО/ОКТМО ПоказательОснования ПоказательПериода ПоказательНомера ПоказательДаты ПоказательТипа Код
	Если СтруктураДокумента.ПеречислениеВБюджет Тогда
		Секция.СтатусСоставителя = СтруктураДокумента.СтатусСоставителя;		
		
		Если Не ПустаяСтрока(СтруктураДокумента.КодБК) Тогда
			Секция.ПоказательКБК = СтруктураДокумента.КодБК;
		КонецЕсли;
		
		Если Не ПустаяСтрока(СтруктураДокумента.КодОКАТО) Тогда
			Секция.ОКАТО = СтруктураДокумента.КодОКАТО;
		КонецЕсли;
		
		Если Не ПустаяСтрока(СтруктураДокумента.ПоказательОснования) Тогда
			Секция.ПоказательОснования = СтруктураДокумента.ПоказательОснования;
		КонецЕсли;
		
		Если Не ПустаяСтрока(СтруктураДокумента.ПоказательПериода) И СтруктураДокумента.ПоказательПериода <> "  .  .    " Тогда
			Секция.ПоказательПериода = СтруктураДокумента.ПоказательПериода;
		КонецЕсли;
		
		Если Не ПустаяСтрока(СтруктураДокумента.ПоказательНомера) Тогда
			Секция.ПоказательНомера = СтруктураДокумента.ПоказательНомера;
		КонецЕсли;
		
		Если Не ПустаяСтрока(СтруктураДокумента.ПоказательДаты) Тогда
			Секция.ПоказательДаты = СтруктураДокумента.ПоказательДаты;
		КонецЕсли;
		
		ПоказательТипаПредусмотренСтандартамиОбмена = Секция.Свойство("ПоказательТипа");
		Если ПоказательТипаПредусмотренСтандартамиОбмена Тогда
			Секция.ПоказательТипа = "0";		
		КонецЕсли;
	КонецЕсли;
	
	//СрокАкцепта, ДатаОтсылкиДок, УсловиеОплаты1
	Если СтруктураДокумента.ВидДокумента = "Платежное требование" Тогда
		Секция.СрокАкцепта = СтруктураДокумента.СрокАкцепта;
		Секция.ДатаОтсылкиДок = СтруктураДокумента.ДатаОтсылкиДок;
		Секция.УсловиеОплаты1 = СтруктураДокумента.УсловиеОплаты1;
	КонецЕсли;
	
	//Очередность
	Секция.Очередность = "" + СтруктураДокумента.ОчередностьПлатежа;
	
	//НазначениеПлатежа, НазначениеПлатежа1 НазначениеПлатежа2 НазначениеПлатежа3 НазначениеПлатежа4 НазначениеПлатежа5 НазначениеПлатежа6
	Секция.НазначениеПлатежа = ОбщегоНазначенияКлиентСервер.УдалитьНеиспользуемыеСимволы(СтруктураДокумента.НазначениеПлатежа);
	КоличествоСтрокНП = СтрЧислоСтрок(СтруктураДокумента.НазначениеПлатежа);
	
	Если КоличествоСтрокНП > 6 Тогда
		КоличествоСтрокНП = 6;
	КонецЕсли;
	
	Для Сч = 1 По КоличествоСтрокНП Цикл
		Секция["НазначениеПлатежа" + Сч] = СтрПолучитьСтроку(СтруктураДокумента.НазначениеПлатежа, Сч);
	КонецЦикла;
	
	Для Сч = (КоличествоСтрокНП + 1) По 6 Цикл
		Секция["НазначениеПлатежа" + Сч] = "";
	КонецЦикла;
	#КонецОбласти
	ДобавитьВСтроку(Буфер, "СекцияДокумент=" + СтруктураДокумента.ВидДокумента);	
	Для Каждого Реквизит Из Секция Цикл		
		Значение = ПривестиЗначение(Реквизит.Значение);		
		Если ПустаяСтрока(Значение) Тогда Продолжить КонецЕсли;
		Если Реквизит.Ключ = "ПоказательТипа" Тогда
			ДобавитьВСтроку(Буфер, Реквизит.Ключ + "="); // Секция должна выгружаться пустой, потому что в банках может остаться ПО, которое ожидает такой ключ.
		КонецЕсли;
	КонецЦикла;	
	ДобавитьВСтроку(Буфер, "КонецДокумента");	
	Возврат Буфер;	
КонецФункции

Функция СформироватьСтруктуруЭкспорта(ВерсияФормата)
	СтруктураЭкспорта = Новый Структура;	
	СтруктураЭкспорта.Вставить("Выгружать",              ""); // "_"
	СтруктураЭкспорта.Вставить("Готовность",             ""); // "Готовность"
	
	СтруктураЭкспорта.Вставить("НомерДок",               ""); // "№ Документа"
	СтруктураЭкспорта.Вставить("Номер",                  ""); // "Номер"
	СтруктураЭкспорта.Вставить("Дата",                   ""); // "Дата"
	СтруктураЭкспорта.Вставить("Операция",               ""); // "Операция"
	СтруктураЭкспорта.Вставить("СчетОрганизации",        ""); // "Эл. Р/с организации"
	СтруктураЭкспорта.Вставить("НомерСчетаОрганизации",  ""); // "Р/с организации"
	СтруктураЭкспорта.Вставить("Сумма",                  ""); // "Сумма"
	
	СтруктураЭкспорта.Вставить("Контрагент",             ""); // "Контрагент"
	СтруктураЭкспорта.Вставить("СчетКонтрагента",        ""); // "Р/с контрагента"
	СтруктураЭкспорта.Вставить("НомерСчетаКонтрагента",  ""); // "Эл. Р/с контрагента"
	
	СтруктураЭкспорта.Вставить("КвитанцияДата",          ""); // "Дата форм. квитанции"
	СтруктураЭкспорта.Вставить("КвитанцияВремя",         ""); // "Время форм. квитанции"
	СтруктураЭкспорта.Вставить("КвитанцияСодержание",    ""); // "Содержание квитанции"
	
	СтруктураЭкспорта.Вставить("ПлательщикСчет",         ""); // "Расчетный счет плательщика"
	СтруктураЭкспорта.Вставить("Плательщик",             ""); // "Плательщик"
	СтруктураЭкспорта.Вставить("ПлательщикИНН",          ""); // "ИНН плательщика"
	СтруктураЭкспорта.Вставить("Плательщик1",            ""); // "Наименование плательщика"
	СтруктураЭкспорта.Вставить("Плательщик2",            ""); // "Расчетный счет плательщика"
	СтруктураЭкспорта.Вставить("Плательщик3",            ""); // "Банк плательщика"
	СтруктураЭкспорта.Вставить("Плательщик4",            ""); // "Город банка плательщика"
	СтруктураЭкспорта.Вставить("ПлательщикРасчСчет",     ""); // "Корсчет банка плательщика"
	СтруктураЭкспорта.Вставить("ПлательщикБанк1",        ""); // "РЦ банка плательщика"
	СтруктураЭкспорта.Вставить("ПлательщикБанк2",        ""); // "Город РЦ банка плательщика"
	СтруктураЭкспорта.Вставить("ПлательщикБИК",          ""); // "БИК РЦ банка плательщика"
	СтруктураЭкспорта.Вставить("ПлательщикКорсчет",      ""); // "Корсчет РЦ банка плат."
	
	СтруктураЭкспорта.Вставить("ПолучательСчет",         ""); // "Расчетный счет получателя"
	СтруктураЭкспорта.Вставить("Получатель",             ""); // "Получатель"
	СтруктураЭкспорта.Вставить("ПолучательИНН",          ""); // "ИНН получателя"
	СтруктураЭкспорта.Вставить("Получатель1",            ""); // "Наименование получателя"
	СтруктураЭкспорта.Вставить("Получатель2",            ""); // "Расчетный счет получателя"
	СтруктураЭкспорта.Вставить("Получатель3",            ""); // "Банк получателя"
	СтруктураЭкспорта.Вставить("Получатель4",            ""); // "Город банка получателя"
	СтруктураЭкспорта.Вставить("ПолучательРасчСчет",     ""); // "Корсчет банка получателя"
	СтруктураЭкспорта.Вставить("ПолучательБанк1",        ""); // "РЦ банка получателя"
	СтруктураЭкспорта.Вставить("ПолучательБанк2",        ""); // "Город РЦ банка получателя"
	СтруктураЭкспорта.Вставить("ПолучательБИК",          ""); // "БИК РЦ банка получателя"
	СтруктураЭкспорта.Вставить("ПолучательКорсчет",      ""); // "Корсчет РЦ банка пол."
	
	СтруктураЭкспорта.Вставить("ВидПлатежа",             ""); // "Вид платежа"
	СтруктураЭкспорта.Вставить("ВидОплаты",              ""); // "Вид оплаты"
	СтруктураЭкспорта.Вставить("ПеречислениеВБюджет",    ""); // "Перечисление в бюджет",
	СтруктураЭкспорта.Вставить("ВидПеречисленияВБюджет", ""); // "Вид перечисления в бюджет",
	
	СтруктураЭкспорта.Вставить("СтатусСоставителя",      ""); // "Статус составителя"
	СтруктураЭкспорта.Вставить("ПлательщикКПП",          ""); // "КПП плательщика"
	СтруктураЭкспорта.Вставить("ПолучательКПП",          ""); // "КПП получателя"
	СтруктураЭкспорта.Вставить("ПоказательКБК",          ""); // "Показатель КБК"
	СтруктураЭкспорта.Вставить("ОКАТО",                  ""); // "ОКАТО/ОКТМО"
	СтруктураЭкспорта.Вставить("ПоказательОснования",    ""); // "Пок. основания"
	СтруктураЭкспорта.Вставить("ПоказательПериода",      ""); // "Пок. нал. периода"
	СтруктураЭкспорта.Вставить("ПоказательНомера",       ""); // "Пок. номера док."
	СтруктураЭкспорта.Вставить("ПоказательДаты",         ""); // "Пок. даты док."
	
	Если ВерсияФормата < "1.03" Тогда // С 01.01.2015 не используется
		СтруктураЭкспорта.Вставить("ПоказательТипа",     ""); // "Пок. типа платежа"
	КонецЕсли;
	
	СтруктураЭкспорта.Вставить("СрокПлатежа",            ""); // "Срок действия аккредитива"
	СтруктураЭкспорта.Вставить("Очередность",            ""); // "Очередность платежа"
	
	СтруктураЭкспорта.Вставить("НазначениеПлатежа",      ""); // "Назначение платежа"
	СтруктураЭкспорта.Вставить("НазначениеПлатежа1",     ""); // "Назначение платежа, стр. 1"
	СтруктураЭкспорта.Вставить("НазначениеПлатежа2",     ""); // "Назначение платежа, стр. 2"
	СтруктураЭкспорта.Вставить("НазначениеПлатежа3",     ""); // "Назначение платежа, стр. 3"
	СтруктураЭкспорта.Вставить("НазначениеПлатежа4",     ""); // "Назначение платежа, стр. 4"
	СтруктураЭкспорта.Вставить("НазначениеПлатежа5",     ""); // "Назначение платежа, стр. 5"
	СтруктураЭкспорта.Вставить("НазначениеПлатежа6",     ""); // "Назначение платежа, стр. 6"
	
	СтруктураЭкспорта.Вставить("СрокАкцепта",            ""); // "Срок акцепта"
	СтруктураЭкспорта.Вставить("ВидАккредитива",         ""); // "Вид аккредитива"
	СтруктураЭкспорта.Вставить("УсловиеОплаты1",         ""); // "Условие оплаты, стр. 1"
	СтруктураЭкспорта.Вставить("УсловиеОплаты2",         ""); // "Условие оплаты, стр. 2"
	СтруктураЭкспорта.Вставить("УсловиеОплаты3",         ""); // "Условие оплаты, стр. 3"
	СтруктураЭкспорта.Вставить("ПлатежПоПредст",         ""); // "Платеж по представлению"
	СтруктураЭкспорта.Вставить("ДополнУсловия",          ""); // "Дополнительные условия"
	СтруктураЭкспорта.Вставить("НомерСчетаПоставщика",   ""); // "№ счета поставщика"
	СтруктураЭкспорта.Вставить("ДатаОтсылкиДок",         ""); // "Дата отсылки документов"
	
	СтруктураЭкспорта.Вставить("Документ",               ""); // "Источник"
	СтруктураЭкспорта.Вставить("СекцияДокумент",         ""); // "Выгрузка"
	
	СтруктураЭкспорта.Вставить("ОписаниеОшибок",         ""); // "Замечания"
	СтруктураЭкспорта.Вставить("ТипДокумента",           ""); // "Тип пл. документа"	
	Если ВерсияФормата >= "1.02" Тогда
		СтруктураЭкспорта.Вставить("Код", ""); // "Уникальный идентификатор платежа"
	КонецЕсли;	
	Возврат СтруктураЭкспорта;	
КонецФункции 

Процедура ДобавитьВСтроку(Буфер, НоваяСтрока, Разделитель = "")
	Если ПустаяСтрока(Буфер) Тогда
		Буфер = НоваяСтрока;
	Иначе
		ЕстьФразаОшибкаВФайле = СтрНайти(Буфер, "Ошибка в файле. ") > 0;
		Если ЕстьФразаОшибкаВФайле Тогда
			НоваяСтрока = СтрЗаменить(НоваяСтрока, "Ошибка в файле. ", "");
		КонецЕсли;
		Буфер = Буфер + ?(ПустаяСтрока(Разделитель), Символы.ПС, Разделитель) + НоваяСтрока;
	КонецЕсли;	
КонецПроцедуры

Функция ПривестиЗначение(Значение)
	Если ТипЗнч(Значение) = Тип("Строка") Тогда		
		Возврат СокрЛП(Значение);		
	ИначеЕсли ТипЗнч(Значение) = Тип("Число") Тогда		
		Возврат Формат(Значение, "ЧРД=.; ЧРГ=' '; ЧГ=0");		
	ИначеЕсли ТипЗнч(Значение) = Тип("Дата") Тогда		
		Возврат Формат(Значение, "ДФ=dd.MM.yyyy");		
	Иначе		
		Возврат "";		
	КонецЕсли;	
КонецФункции

Функция КонвертироватьДату(ДатаФайл)
	Возврат Дата(ДатаФайл + " 00:00:00");	
КонецФункции	

Функция ПолучитьДокументы()
	МасДатыВходящих = ТЧДокументыКЗагрузке.ВыгрузитьКолонку("Дата"); // Чтоб найти уже обработанные документы
	МасДатыВходящих.Добавить(Дата(1,1,1)); // Чтоб найти платёжные поручения для подтверждения, в них дата пустая		
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПоступлениеБезналичныхДенежныхСредств.Ссылка КАК Ссылка,
	                      |	ПоступлениеБезналичныхДенежныхСредств.Номер КАК Номер,
	                      |	ПоступлениеБезналичныхДенежныхСредств.Организация КАК Организация,
	                      |	ПоступлениеБезналичныхДенежныхСредств.БанковскийСчёт КАК БанковскийСчёт,
	                      |	ПоступлениеБезналичныхДенежныхСредств.Контрагент КАК Контрагент,
	                      |	ПоступлениеБезналичныхДенежныхСредств.БанковскийСчётКонтрагента КАК БанковскийСчётКонтрагента,
	                      |	ПоступлениеБезналичныхДенежныхСредств.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	                      |	ПоступлениеБезналичныхДенежныхСредств.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	                      |	ИСТИНА КАК Поступление,
	                      |	ПоступлениеБезналичныхДенежныхСредств.Сумма КАК Сумма
	                      |ИЗ
	                      |	Документ.ПоступлениеБезналичныхДенежныхСредств КАК ПоступлениеБезналичныхДенежныхСредств
	                      |ГДЕ
	                      |	ПоступлениеБезналичныхДенежныхСредств.Организация В(&Организация)
	                      |	И ПоступлениеБезналичныхДенежныхСредств.БанковскийСчёт В(&БанковскийСчёт)
	                      |	И ПоступлениеБезналичныхДенежныхСредств.ДатаВходящегоДокумента В(&МасДатыВходящих)
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	СписаниеБезналичныхДенежныхСредств.Ссылка,
	                      |	СписаниеБезналичныхДенежныхСредств.Номер,
	                      |	СписаниеБезналичныхДенежныхСредств.Организация,
	                      |	СписаниеБезналичныхДенежныхСредств.БанковскийСчёт,
	                      |	СписаниеБезналичныхДенежныхСредств.Контрагент,
	                      |	СписаниеБезналичныхДенежныхСредств.БанковскийСчётКонтрагента,
	                      |	СписаниеБезналичныхДенежныхСредств.НомерВходящегоДокумента,
	                      |	СписаниеБезналичныхДенежныхСредств.ДатаВходящегоДокумента,
	                      |	ЛОЖЬ,
	                      |	СписаниеБезналичныхДенежныхСредств.Сумма
	                      |ИЗ
	                      |	Документ.СписаниеБезналичныхДенежныхСредств КАК СписаниеБезналичныхДенежныхСредств
	                      |ГДЕ
	                      |	СписаниеБезналичныхДенежныхСредств.Организация В(&Организация)
	                      |	И СписаниеБезналичныхДенежныхСредств.БанковскийСчёт В(&БанковскийСчёт)
	                      |	И СписаниеБезналичныхДенежныхСредств.ДатаВходящегоДокумента В(&МасДатыВходящих)");
	Запрос.УстановитьПараметр("Организация", ТЧДокументыКЗагрузке.ВыгрузитьКолонку("Организация"));
	Запрос.УстановитьПараметр("БанковскийСчёт", ТЧДокументыКЗагрузке.ВыгрузитьКолонку("БанковскийСчёт"));
	Запрос.УстановитьПараметр("МасДатыВходящих", МасДатыВходящих);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Для Каждого Стр Из ТЗ Цикл
		Стр.Номер = РаботаСДокументами.СформироватьЦифровойНомер(Стр.Номер);	
	КонецЦикла;	
	Возврат ТЗ;
КонецФункции

Процедура СоздатьКонтрагентаИБанковскийСчёт(БанковскийСчётКонтрагента)
	// Получим контрагента
	Контрагент = РегистрыСведений.РеквизитыКонтрагентов.ПолучитьКонтрагентаПоИНН(БанковскийСчётКонтрагента.Владелец.NIF);
	СозданНовыйКонтрагент = Ложь;
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Контрагент = Справочники.Контрагенты.СоздатьЭлемент();
		Контрагент.Записать();
		Результат = РегистрыСведений.РеквизитыКонтрагентов.ЗаполнитьРеквизитыПоИНН(Контрагент.Ссылка, БанковскийСчётКонтрагента.Владелец.NIF);
		Если Результат.Установлены Тогда
			Контрагент.Наименование = Результат.Наименование;
			Контрагент.НаименованиеПолное = Результат.НаименованиеПолное;
			Контрагент.NIF = Результат.NIF;	
			Контрагент.RC = Результат.RC;
			Контрагент.ВидКонтрагента = Результат.ВидКонтрагента;
		Иначе
			Контрагент.Наименование = БанковскийСчётКонтрагента.Владелец.Наименование;
			Контрагент.НаименованиеПолное = Контрагент.Наименование;
			Контрагент.NIF = БанковскийСчётКонтрагента.Владелец.NIF;	
			Контрагент.RC = БанковскийСчётКонтрагента.Владелец.RC;
			РеквизитыКонтрагента = Новый Структура("NIF, RC", Контрагент.NIF, Контрагент.RC);
			РегистрыСведений.РеквизитыКонтрагентов.УстановитьРеквизиты(Контрагент.Ссылка, РеквизитыКонтрагента);
		КонецЕсли;
		Контрагент.Записать();
		ДобавитьИнформацию("Добавлен контрагент - " + Контрагент.Наименование,, Контрагент.Ссылка);
		СозданНовыйКонтрагент = Истина;
	КонецЕсли;
	БанковскийСчётКонтрагента.Владелец = Контрагент.Ссылка; 
	// Получим банковский счёт
	Если СозданНовыйКонтрагент Тогда
		СоздатьБанковскийСчёт(БанковскийСчётКонтрагента);		
	Иначе
		Результат = Справочники.БанковскиеСчета.ПолучитьПоНомеруДляВладельца(БанковскийСчётКонтрагента.НомерСчёта, БанковскийСчётКонтрагента.Владелец);
		Если ЗначениеЗаполнено(Результат.БанковскийСчёт) Тогда
			БанковскийСчёт = Результат.БанковскийСчёт.ПолучитьОбъект();
			БанковскийСчёт.Банк = Справочники.Банки.ПолучитьПоБИК(БанковскийСчётКонтрагента.Банк,, Истина);
			БанковскийСчёт.Записать();
			БанковскийСчётКонтрагента.БанковскийСчёт = БанковскийСчёт.Ссылка;
			БанковскийСчётКонтрагента.Наименование = БанковскийСчёт.Наименование;
			БанковскийСчётКонтрагента.Банк = БанковскийСчёт.Банк;
		Иначе
			СоздатьБанковскийСчёт(БанковскийСчётКонтрагента);	
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

Процедура СоздатьБанковскийСчёт(БанковскийСчётКонтрагента)
	БанковскийСчёт = Справочники.БанковскиеСчета.СоздатьЭлемент();
	БанковскийСчёт.Владелец = БанковскийСчётКонтрагента.Владелец;
	БанковскийСчёт.НомерСчёта = БанковскийСчётКонтрагента.НомерСчёта;
	Если Тип("СправочникСсылка.Банки") = ТипЗнч(БанковскийСчётКонтрагента.Банк) Тогда
		БанковскийСчёт.Банк = БанковскийСчётКонтрагента.Банк;
	иначе	
		БанковскийСчёт.Банк = Справочники.Банки.ПолучитьПоБИК(БанковскийСчётКонтрагента.Банк,, Истина);
	КонецЕсли;
	БанковскийСчёт.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	БанковскийСчёт.ТипСчёта = Перечисления.ТипыБанковскихСчетов.Расчетный;	
	БанковскийСчёт.Наименование = СокрЛП(БанковскийСчёт.Банк) + " (" + СокрЛП(БанковскийСчёт.ТипСчёта) + ")";
	БанковскийСчёт.Записать();
	БанковскийСчётКонтрагента.БанковскийСчёт = БанковскийСчёт.Ссылка;
	БанковскийСчётКонтрагента.Наименование = БанковскийСчёт.Наименование;
	БанковскийСчётКонтрагента.Банк = БанковскийСчёт.Банк;
	ДобавитьИнформацию("Добавлен банковский счёт для - " + СокрЛП(БанковскийСчётКонтрагента.Владелец),, БанковскийСчёт.Ссылка);
КонецПроцедуры

Процедура ДобавитьИнформацию(Описание, Знач Структура = Неопределено, Данные = Неопределено)
	Если Структура = Неопределено Тогда
		Структура = Новый Структура	
	КонецЕсли;	
	НС = ТЧИнформация.Добавить();
	НС.Описание = Описание;
	Если Структура.Свойство("Номер") Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(НС.Описание, СокрЛП(Структура.Номер), Символы.ПС + "№ п/п ");
		Если Структура.Свойство("Дата") Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(НС.Описание, СокрЛП(Структура.Дата), " от ");	
		КонецЕсли;
		Если Структура.Свойство("Сумма") Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(НС.Описание, СокрЛП(Структура.Сумма), ", Сумма ");	
		КонецЕсли;
	КонецЕсли;
	НС.Данные = Данные;
КонецПроцедуры	

#КонецОбласти 

