
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)	
	СтандартнаяОбработка = Ложь;
	
	// Получаем параметры
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	ДатаОтчёта = Настройки.ПараметрыДанных.Элементы.Найти("ДатаОтчёта").Значение;
	Организации = ОбработатьПараметр(Настройки.ПараметрыДанных.Элементы.Найти("Организации"));
	Контрагенты = ОбработатьПараметр(Настройки.ПараметрыДанных.Элементы.Найти("Контрагенты"));
	Менеджеры = ОбработатьПараметр(Настройки.ПараметрыДанных.Элементы.Найти("Менеджеры"));
	ВариантЗадолженности = Настройки.ПараметрыДанных.Элементы.Найти("ВариантЗадолженности").Значение;
	
	Отбор = Новый Структура("Организации, Контрагенты, Менеджеры, ВариантЗадолженности", Организации, Контрагенты, Менеджеры, ВариантЗадолженности);	
	ВнешнийНаборДанных = Новый Структура("ТЗ", РегистрыНакопления.ВзаиморасчётыСПокупателями.ПолучитьЗадолженностьКлиентовПоКлассификации(ДатаОтчёта, Отбор));

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешнийНаборДанных,ДанныеРасшифровки);
	
	ДокументРезультат.Очистить();
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);	
КонецПроцедуры

Функция ОбработатьПараметр(Знач Параметр)
	Если Параметр.Использование Тогда
		Параметр = Параметр.Значение;
		Параметр = ?(ЗначениеЗаполнено(Параметр), Параметр, Новый СписокЗначений); // Если неопределено, тогда пустой список
		Если ТипЗнч(Параметр) <> Тип("СписокЗначений") Тогда // Если не список, а элемент, создаём список с ним
			СЗ = Новый СписокЗначений;
			СЗ.Добавить(Параметр);
			Параметр = СЗ;
		КонецЕсли;
	Иначе
		Параметр = Новый СписокЗначений;	
	КонецЕсли;
	Возврат Параметр;
КонецФункции	

