
&НаКлиенте
Процедура ЗаполнитьИзКлассификатора(Команда)
	ЗаполнитьИзКлассификатораСервер();
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзКлассификатораСервер()
	ТЗКлассификатор = Справочники.СтраныМира.ТаблицаКлассификатора();
	Для Каждого Стр Из ТЗКлассификатор Цикл
		Если СокрЛП(Стр.Код) = "" Тогда Прервать КонецЕсли;
		Эл = Справочники.СтраныМира.НайтиПоКоду(Стр.Код);
		Об = ?(ЗначениеЗаполнено(Эл), Эл.ПолучитьОбъект(), Справочники.СтраныМира.СоздатьЭлемент());
		ЗаполнитьЗначенияСвойств(Об, Стр);
		Об.Записать();
	КонецЦикла;	
КонецПроцедуры	

	

