
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Изображение = ПолучитьНавигационнуюСсылку(ТекущийОбъект.Ссылка, "Изображение");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Не ЗначениеЗаполнено(Объект.НаименованиеПолное) Тогда
		Объект.НаименованиеПолное = Объект.Наименование;	
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
		Объект.Наименование = Объект.НаименованиеПолное;	
	КонецЕсли;
	//Объект.ECommerce = Истина;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ОбщегоНазначения.ЗаписатьДанныеВХранилищеЗначения(ТекущийОбъект, "Изображение", Изображение);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура ИзображениеНажатие(Элемент, СтандартнаяОбработка)
	ПрисоединённыеФайлыКлиент.ВыбратьИзображение(ЭтаФорма, "Изображение", СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьИзображение(Команда)
	ПрисоединённыеФайлыКлиент.УдалитьИзображение(ЭтаФорма, Изображение);
КонецПроцедуры

#КонецОбласти

#Область Дополнительно

&НаКлиенте
Процедура УстановитьВидимостьЭлементов()
	Элементы.Единица.Доступность = Истина;
КонецПроцедуры	

#КонецОбласти
