 
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	РаботаСДокументами.ЗаполнитьРеквизитыПоУмолчанию(ЭтотОбъект);
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ТабельУчётаРабочегоВремени") Тогда
		Дата = КонецМесяца(ДанныеЗаполнения.Дата);
		Основание = ДанныеЗаполнения;
		Для Каждого Стр Из ДанныеЗаполнения.ТЧТабель Цикл
			Сотрудник = Стр.Сотрудник;
			ДанныеЗарплаты = РегистрыНакопления.Зарплата.РассчитатьПоСотруднику(Сотрудник, Дата);
			НС = ТЧСотрудники.Добавить();
			НС.Сотрудник = Сотрудник;
			НС.Оклад = ДанныеЗарплаты.Оклад.Сумма;
			НС.Премия = ДанныеЗарплаты.Премия.Сумма;
			НС.Прочее = ДанныеЗарплаты.Прочее.ВсегоНачислено - ДанныеЗарплаты.Прочее.ВсегоУдержано;
			НС.Сумма = ДанныеЗарплаты.Итого;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	УстановитьПривилегированныйРежим(Истина);
	РаботаСДокументами.УстановитьЗаписьВсехРегистров(Движения);
	РегистрыНакопления.Зарплата.СформироватьДвижения(ЭтотОбъект);
	РегистрыНакопления.Убытки.СформироватьДвижения(ЭтотОбъект);
	Движения.Записать();
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = ПараметрыСеанса.Пользователь;
КонецПроцедуры


