
Процедура СформироватьДвижения(ДокОбъект) Экспорт
	Движения = ДокОбъект.Движения;
	СуммаДокумента = ДокОбъект.Сумма;
	Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПриходныйКассовыйОрдер") Тогда
		ТипДенежныхСредств = ДокОбъект.ТипОплаты;
		МестоХранения = ДокОбъект.Касса;
		ТипДвижения = Перечисления.ТипыДвиженияДенежныхСредств.Поступление;
		Период = ДокОбъект.Дата;
		Если ДокОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзКассы Тогда 
			НС = Движения.ДвиженияПоКассе.Добавить();
			НС.Период = Период;
			НС.Организация = ДокОбъект.Организация;
			НС.МестоХранения = ДокОбъект.КассаИз;
			НС.КассоваяСмена = ДокОбъект.КассоваяСмена;
			НС.ТипДвижения = Перечисления.ТипыДвиженияДенежныхСредств.Списание;
			НС.ТипДенежныхСредств = ТипДенежныхСредств;
			//НС.ДокументПродажи = Стр.Основание;
			//НС.ТипНоменклатуры = Стр.ТипНоменклатуры;
			НС.ХозяйственнаяОперация = ДокОбъект.ХозяйственнаяОперация;
			НС.Сумма = СуммаДокумента;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.РасходныйКассовыйОрдер") Тогда	
		ТипДенежныхСредств = ДокОбъект.ТипОплаты;
		МестоХранения = ДокОбъект.Касса;
		ТипДвижения = Перечисления.ТипыДвиженияДенежныхСредств.Списание;
		Период = ДокОбъект.Дата;
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПоступлениеБезналичныхДенежныхСредств") Тогда
		Если ДокОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОбналичиваниеЧека Тогда Возврат; КонецЕсли;
		ТипДенежныхСредств = ДокОбъект.ТипОплаты;
		МестоХранения = ДокОбъект.БанковскийСчёт;
		ТипДвижения = Перечисления.ТипыДвиженияДенежныхСредств.Поступление;
		Период = ДокОбъект.Дата;
		Если ДокОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.Инкассация Тогда 
			НС = Движения.ДвиженияПоКассе.Добавить();
			НС.Период = Период;
			НС.Организация = ДокОбъект.Организация;
			НС.МестоХранения = ДокОбъект.Касса;
			НС.КассоваяСмена = ДокОбъект.КассоваяСмена;
			НС.ТипДвижения = Перечисления.ТипыДвиженияДенежныхСредств.Списание;
			НС.ТипДенежныхСредств = Справочники.TypesDePayment.Cash;
			//НС.ДокументПродажи = Стр.Основание;
			//НС.ТипНоменклатуры = Стр.ТипНоменклатуры;
			НС.ХозяйственнаяОперация = ДокОбъект.ХозяйственнаяОперация;
			НС.Сумма = СуммаДокумента;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.СписаниеБезналичныхДенежныхСредств") Тогда	
		ТипДенежныхСредств = ДокОбъект.ТипОплаты;
		МестоХранения = ДокОбъект.БанковскийСчёт;
		ТипДвижения = Перечисления.ТипыДвиженияДенежныхСредств.Списание;
		Период = ДокОбъект.Дата;
	КонецЕсли;
	// ДвиженияПоКассе
	Для Каждого Стр из ДокОбъект.ТЧОснования Цикл
		Если Не ТипЗнч(Стр.Основание) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
			И Не ТипЗнч(Стр.Основание) = Тип("ДокументСсылка.НалоговаяНакладная")  
			И Не ТипЗнч(Стр.Основание) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг")  
			И Не ТипЗнч(Стр.Основание) = Тип("ДокументСсылка.НалоговаяНакладнаяПокупка") Тогда 
			Продолжить;
		КонецЕсли;
		ТЗОснование = ПолучитьТЗПоОснованию(Стр.Основание);
		Для Каждого СтрОснование из ТЗОснование Цикл 
			НС = Движения.ДвиженияПоКассе.Добавить();
			НС.Период = Период;
			НС.Организация = ДокОбъект.Организация;
			НС.МестоХранения = МестоХранения;
			НС.КассоваяСмена = ДокОбъект.КассоваяСмена;
			НС.ТипДвижения = ТипДвижения;
			НС.ТипДенежныхСредств = ТипДенежныхСредств;
			НС.ДокументПродажи = Стр.Основание;
			НС.ТипНоменклатуры = СтрОснование.ТипНоменклатуры;
			НС.ХозяйственнаяОперация = СтрОснование.ХозяйственнаяОперация;
			Если Стр.НомерСтроки = ДокОбъект.ТЧОснования.Количество() и ТЗОснование.Индекс(СтрОснование) = ТЗОснование.Количество()-1 Тогда 
				НС.Сумма = СуммаДокумента;
			Иначе
				НС.Сумма = Окр(стр.Сумма * СтрОснование.Сумма/Стр.Основание.Сумма,2);
			КонецЕсли;
			СуммаДокумента = СуммаДокумента - НС.Сумма;;
		КонецЦикла;
	КонецЦикла;
	Если Не СуммаДокумента = 0 Тогда 
		НС = Движения.ДвиженияПоКассе.Добавить();
		НС.Период = Период;
		НС.Организация = ДокОбъект.Организация;
		НС.МестоХранения = МестоХранения;
		НС.КассоваяСмена = ДокОбъект.КассоваяСмена;
		НС.ТипДвижения = ТипДвижения;
		НС.ТипДенежныхСредств = ТипДенежныхСредств;
		//НС.ДокументПродажи = Стр.Основание;
		//НС.ТипНоменклатуры = Стр.ТипНоменклатуры;
		НС.ХозяйственнаяОперация = ДокОбъект.ХозяйственнаяОперация;
		НС.Сумма = СуммаДокумента;
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьТЗПоОснованию(Док)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслугТЧТовары.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслугТЧТовары.Ссылка.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	РеализацияТоваровУслугТЧТовары.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	РеализацияТоваровУслугТЧТовары.Сумма КАК Сумма
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.ТЧТовары КАК РеализацияТоваровУслугТЧТовары
	|ГДЕ
	|	РеализацияТоваровУслугТЧТовары.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугТЧУслуги.Ссылка,
	|	РеализацияТоваровУслугТЧУслуги.Ссылка.ХозяйственнаяОперация,
	|	РеализацияТоваровУслугТЧУслуги.Номенклатура.ТипНоменклатуры,
	|	РеализацияТоваровУслугТЧУслуги.Сумма
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.ТЧУслуги КАК РеализацияТоваровУслугТЧУслуги
	|ГДЕ
	|	РеализацияТоваровУслугТЧУслуги.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НалоговаяНакладнаяТЧТовары.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту),
	|	НалоговаяНакладнаяТЧТовары.Номенклатура.ТипНоменклатуры,
	|	НалоговаяНакладнаяТЧТовары.Сумма
	|ИЗ
	|	Документ.НалоговаяНакладная.ТЧТовары КАК НалоговаяНакладнаяТЧТовары
	|ГДЕ
	|	НалоговаяНакладнаяТЧТовары.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НалоговаяНакладнаяТЧУслуги.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту),
	|	НалоговаяНакладнаяТЧУслуги.Номенклатура.ТипНоменклатуры,
	|	НалоговаяНакладнаяТЧУслуги.Сумма
	|ИЗ
	|	Документ.НалоговаяНакладная.ТЧУслуги КАК НалоговаяНакладнаяТЧУслуги
	|ГДЕ
	|	НалоговаяНакладнаяТЧУслуги.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслугТЧТовары.Ссылка,
	|	ПоступлениеТоваровУслугТЧТовары.Ссылка.ХозяйственнаяОперация,
	|	ПоступлениеТоваровУслугТЧТовары.Номенклатура.ТипНоменклатуры,
	|	ПоступлениеТоваровУслугТЧТовары.Сумма
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.ТЧТовары КАК ПоступлениеТоваровУслугТЧТовары
	|ГДЕ
	|	ПоступлениеТоваровУслугТЧТовары.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслугТЧУслуги.Ссылка,
	|	ПоступлениеТоваровУслугТЧУслуги.Ссылка.ХозяйственнаяОперация,
	|	ПоступлениеТоваровУслугТЧУслуги.Номенклатура.ТипНоменклатуры,
	|	ПоступлениеТоваровУслугТЧУслуги.Сумма
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.ТЧУслуги КАК ПоступлениеТоваровУслугТЧУслуги
	|ГДЕ
	|	ПоступлениеТоваровУслугТЧУслуги.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НалоговаяНакладнаяПокупкаТЧТовары.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщика),
	|	НалоговаяНакладнаяПокупкаТЧТовары.Номенклатура.ТипНоменклатуры,
	|	НалоговаяНакладнаяПокупкаТЧТовары.Сумма
	|ИЗ
	|	Документ.НалоговаяНакладнаяПокупка.ТЧТовары КАК НалоговаяНакладнаяПокупкаТЧТовары
	|ГДЕ
	|	НалоговаяНакладнаяПокупкаТЧТовары.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НалоговаяНакладнаяПокупкаТЧУслуги.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщика),
	|	НалоговаяНакладнаяПокупкаТЧУслуги.Номенклатура.ТипНоменклатуры,
	|	НалоговаяНакладнаяПокупкаТЧУслуги.Сумма
	|ИЗ
	|	Документ.НалоговаяНакладнаяПокупка.ТЧУслуги КАК НалоговаяНакладнаяПокупкаТЧУслуги
	|ГДЕ
	|	НалоговаяНакладнаяПокупкаТЧУслуги.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Ссылка КАК Ссылка,
	|	ВТ.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ВТ.ТипНоменклатуры КАК ТипНоменклатуры,
	|	СУММА(ВТ.Сумма) КАК Сумма
	|ИЗ
	|	ВТ КАК ВТ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.Ссылка,
	|	ВТ.ХозяйственнаяОперация,
	|	ВТ.ТипНоменклатуры";
	Запрос.УстановитьПараметр("Ссылка",Док);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
