
#Область Обработчики_элементов_формы

&НаКлиенте
Процедура ПодобратьИзКлассификатора(Команда)
	ПараметрыОтбора = Новый Массив;
	Для Каждого ЭлементОтбора Из Список.Отбор.Элементы Цикл
		Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТипИзмеряемойВеличины") И ЭлементОтбора.Использование Тогда
			Если ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно Тогда
				ПараметрыОтбора.Добавить(ЭлементОтбора.ПравоеЗначение);
			ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке Тогда 
				ПараметрыОтбора = ЭлементОтбора.ПравоеЗначение.ВыгрузитьЗначения();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	ПараметрыФормы = Новый Структура("Отбор", ПараметрыОтбора);
	Оп = Новый ОписаниеОповещения("ПослеЗакрытияФормыПодбораИзКлассификатора", ЭтотОбъект);	
	ОткрытьФорму("Справочник.УпаковкиЕдиницыИзмерения.Форма.КлассификаторЕдиницИзмерения", ПараметрыФормы,,,,, Оп);
КонецПроцедуры

#КонецОбласти

#Область Оповещения

&НаКлиенте
Процедура ПослеЗакрытияФормыПодбораИзКлассификатора(Результат, ДополнительныеПараметры) Экспорт	
	Элементы.Список.Обновить(); 	
КонецПроцедуры

#КонецОбласти


