
#Область Печать

Процедура ПечатьПоступлениеТоваров(Док, Таб) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Таб.ОтображатьСетку = Ложь;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	Таб.Автомасштаб = Истина;
	Таб.КлючПараметровПечати = "Параметры_печати_Документ_ПоступлениеТоваровУслуг_ПоступлениеТоваров";
	Макет = Документы.ПоступлениеТоваровУслуг.ПолучитьМакет("ПоступлениеТоваров");
	// Шапка
	оШапка = Макет.ПолучитьОбласть("Шапка");
	оШапка.Параметры.ТекстЗаголовка = РаботаСДокументами.КраткоеПредставлениеДокумента(Док, "Bon de réception");
	//оШапка.Параметры.Контрагент = Док.Контрагент;
	оШапка.Параметры.Организация = Док.Организация;
	Таб.Вывести(оШапка);
	// Строки
	оСтрока = Макет.ПолучитьОбласть("Строка");
	Для Каждого Стр Из Док.ТЧТовары Цикл
		оСтрока.Параметры.НомерСтроки = Стр.НомерСтроки;
		оСтрока.Параметры.Номенклатура = Стр.Номенклатура;
		оСтрока.Параметры.ID = Стр.Номенклатура.Артикул;
		//оСтрока.Параметры.Количество = Стр.Количество;
		оСтрока.Параметры.Единица = Стр.Номенклатура.Единица;
		Таб.Вывести(оСтрока);
	КонецЦикла;
	//// Итого
	//оИтого = Макет.ПолучитьОбласть("Итого");
	//оИтого.Параметры.Всего = Док.Сумма;
	//Таб.Вывести(оИтого);
	//// НДС
	//оНДС = Макет.ПолучитьОбласть("ИтогоНДС");
	//оНДС.Параметры.НДС = "TVA";
	//оНДС.Параметры.ВсегоНДС = Док.ТЧТовары.Итог("СуммаНДС");
	//Таб.Вывести(оНДС);
	//// Сумма прописью
	//Валюта = Справочники.Валюты.MoroccanDirham;
	//оСуммаПрописью = Макет.ПолучитьОбласть("СуммаПрописью");
	////оСуммаПрописью.Параметры.ИтоговаяСтрока = "Всего наименований " + СокрЛП(Док.ТЧТовары.Количество()) 
	////	+ ", на сумму " + Формат(Док.Сумма, "ЧЦ=12; ЧДЦ=2") + " руб.";
	//оСуммаПрописью.Параметры.СуммаПрописью = Справочники.Валюты.СформироватьСуммуПрописью(Док.Сумма, Валюта, Перечисления.Локализации.fr_CA);
	//Таб.Вывести(оСуммаПрописью);
	// Подписи
	Таб.Вывести(Макет.ПолучитьОбласть("Подписи"));
	Таб.ВывестиГоризонтальныйРазделительСтраниц();
КонецПроцедуры

Процедура ПечатьАктаОбОказанииУслуг(Док, Таб) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Таб.ОтображатьСетку = Ложь;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	Таб.АвтоМасштаб = Истина;
	Таб.КлючПараметровПечати = "Параметры_печати_Документ_ПоступлениеТоваровУслуг_АктОбОказанииУслуг";
	Макет = ПолучитьОбщийМакет("АктОбОказанииУслуг");	
	оЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	оЗаголовок.Параметры.ТекстЗаголовка = РаботаСДокументами.КраткоеПредставлениеДокумента(Док, "Акт");
	Таб.Вывести(оЗаголовок);
	оПоставщик = Макет.ПолучитьОбласть("Поставщик");	
	оПоставщик.Параметры.ПредставлениеПоставщика = Док.Контрагент;
	Таб.Вывести(оПоставщик);
	оПолучатель = Макет.ПолучитьОбласть("Получатель");	
	оПолучатель.Параметры.ПредставлениеПолучателя = Док.Организация;
	оПолучатель.Параметры.Основание = Док.Договор;
	Таб.Вывести(оПолучатель);
	Таб.Вывести(Макет.ПолучитьОбласть("ШапкаТаблицы"));
	ТЗ = Док.ТЧУслуги.Выгрузить();	
	Для Каждого Стр Из ТЗ Цикл
		оСтрока = Макет.ПолучитьОбласть("Строка"); 
		оСтрока.Параметры.Заполнить(Стр);
		оСтрока.Параметры.Номенклатура = ОбщегоНазначенияКлиентСервер.ПредставлениеНоменклатуры(Стр.Номенклатура, Стр.Содержание, , Истина);
		оСтрока.Параметры.ЕдиницаИзмерения = Стр.Номенклатура.Единица;
		Таб.Вывести(оСтрока);
	КонецЦикла;
	ОИтого = Макет.ПолучитьОбласть("Итого");
	ОИтого.Параметры.Всего = ТЗ.Итог("Сумма");
	Таб.Вывести(ОИтого);
	оИтогоНДС = Макет.ПолучитьОбласть("ИтогоНДС");
	оИтогоНДС.Параметры.НДС = "Сумма НДС";
	оИтогоНДС.Параметры.ВсегоНДС = ТЗ.Итог("СуммаНДС");
	Таб.Вывести(оИтогоНДС);
	ОСуммаПрописью = Макет.ПолучитьОбласть("СуммаПрописью");
	ОСуммаПрописью.Параметры.ИтоговаяСтрока = "Всего наименований " + ТЗ.Количество() 
	+ ", на сумму " + ТЗ.Итог("Сумма") + " руб.";
	ОСуммаПрописью.Параметры.СуммаПрописью = Справочники.Валюты.СформироватьСуммуПрописью(ТЗ.Итог("Сумма"),Константы.ВалютаРегламентированногоУчета.Получить(), Перечисления.Локализации.fr_CA);
	Таб.Вывести(ОСуммаПрописью);
	
	ОПодписи = Макет.ПолучитьОбласть("Подписи");
	ОПодписи.Параметры.НазваниеОрганизации = Док.Контрагент;
	ОПодписи.Параметры.НазваниеЗаказчика = Док.Организация;
	Таб.Вывести(ОПодписи);
	Таб.ВывестиГоризонтальныйРазделительСтраниц();
	Таб.ИспользуемоеИмяФайла = РаботаСДокументами.КраткоеПредставлениеДокумента(Док, "Акт");
КонецПроцедуры

#КонецОбласти 
