
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	РаботаСДокументами.ЗаполнитьРеквизитыПоУмолчанию(ЭтотОбъект);
	ТипЦеныПоТипуЦен = Константы.ВыводитьВЗакупкеТипЦен.Получить();
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		Организация = ДанныеЗаполнения.Организация;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Договор = ДанныеЗаполнения.Договор; 
		Основание = ДанныеЗаполнения;
		ЦенаВключаетНДС = ДанныеЗаполнения.ЦенаВключаетНДС; 
		ТЧТовары.Загрузить(ДанныеЗаполнения.ТЧТовары.Выгрузить());
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Организация = ДанныеЗаполнения.Организация;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Договор = ОбщегоНазначенияВызовСервера.ПолучитьОсновнойДоговор(Контрагент, Организация, Ложь);  
		МестоХранения = ДанныеЗаполнения.МестоХранения;
		Основание = ДанныеЗаполнения;		
		//ЦенаВключаетНДС = ДанныеЗаполнения.ЦенаВключаетНДС; 
		ТЧТовары.Загрузить(ДанныеЗаполнения.ТЧТовары.Выгрузить());
		ТЧСерии.Загрузить(ДанныеЗаполнения.ТЧСерии.Выгрузить());
	КонецЕсли;
	
	Номенклатура = ТЧТовары.Выгрузить().ВыгрузитьКолонку("Номенклатура");
	ТЗЦеныРозн = РегистрыСведений.ЦеныНоменклатуры.ПоследнийПрайс(ТекущаяДатаСеанса(),Справочники.ВидыЦен.Розничная,Номенклатура);
	ТЗЦеныМин = РегистрыСведений.ЦеныНоменклатуры.ПоследнийПрайс(ТекущаяДатаСеанса(),Справочники.ВидыЦен.МинимальнаяЦенаПродажи,Номенклатура);
	Если ЗначениеЗаполнено(ТипЦеныПоТипуЦен) Тогда 
		ТЗЦеныПоТипуЦен = РегистрыСведений.ЦеныНоменклатуры.ПоследнийПрайс(ТекущаяДатаСеанса(),ТипЦеныПоТипуЦен,Номенклатура);
	КонецЕсли;
	Для Каждого Стр из ТЧТовары Цикл
		СтрЦена = ТЗЦеныРозн.Найти(Стр.Номенклатура);
		Стр.ЦенаРозничная = ?(СтрЦена = Неопределено, 0, СтрЦена.Цена); 
		СтрЦена = ТЗЦеныМин.Найти(Стр.Номенклатура);
		Стр.ЦенаМинимальная = ?(СтрЦена = Неопределено, 0, СтрЦена.Цена); 
		Если ЗначениеЗаполнено(ТипЦеныПоТипуЦен) Тогда 
			СтрЦена = ТЗЦеныПоТипуЦен.Найти(Стр.Номенклатура);
			Стр.ЦенаПоТипуЦен = ?(СтрЦена = Неопределено, 0, СтрЦена.Цена);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ТЧТовары.Количество() > 0 Тогда
		ПроверяемыеРеквизиты.Добавить("МестоХранения");
	КонецЕсли;	
	//Если ТЧУслуги.Количество() > 0 Тогда
	//	ПроверяемыеРеквизиты.Добавить("ТЧУслуги.СтатьяДДС");	
	//КонецЕсли;
	Если Статус = Перечисления.СтатусыДокументов.ВРаботе Тогда 
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.найти("ТЧТовары.Цена"));
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.найти("ТЧТовары.Сумма"));
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.найти("ТЧТовары.СуммаСНДС"));
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	УстановитьПривилегированныйРежим(Истина);
	РаботаСДокументами.УстановитьЗаписьВсехРегистров(Движения);	
	// Данные для проведения
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ТЗТоварыССериями", СерииИРазмещение.ОбъединитьТоварыССериями(ЭтотОбъект));
	// Блокировки
	Блокировка = Новый БлокировкаДанных;
	УправляемыеБлокировки.ТоварыВНаличии(Блокировка, ТЧТовары, МестоХранения);
	УправляемыеБлокировки.ВзаиморасчётыСПоставщиками(Блокировка, Контрагент);
	Блокировка.Заблокировать();		
	// Формируем
	РегистрыНакопления.ТоварыВНаличии.СформироватьДвижения(ЭтотОбъект);
	РегистрыНакопления.ЗаказыПоставщикам.СформироватьДвижения(ЭтотОбъект);
	РегистрыНакопления.ВзаиморасчётыСПоставщиками.СформироватьДвижения(ЭтотОбъект);
	РегистрыНакопления.Убытки.СформироватьДвижения(ЭтотОбъект);
	РегистрыСведений.ЦеныНоменклатурыПоставщиков.СформироватьДвижения(ЭтотОбъект);
	РегистрыСведений.ЦеныНоменклатуры.СформироватьДвижения(ЭтотОбъект);
	// Записываем
	Движения.Записать();
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = ПараметрыСеанса.Пользователь;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	РаботаСДокументами.МожноРедактироватьДокумент(ЭтотОбъект, Отказ);
	ЭтотОбъект.ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство(РаботаСДокументами.СвойствоВыполняетсяФоновоеПерепроведение()) Тогда
		ЭтотОбъект.Сумма = ЭтотОбъект.ТЧТовары.Итог("СуммаСНДС") + ЭтотОбъект.ТЧУслуги.Итог("СуммаСНДС");
	КонецЕсли;	
КонецПроцедуры



