 
#Область Обработчики_формы 
 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Период.ДатаНачала = Дата(1,1,1) Тогда
		Период.Вариант = ВариантСтандартногоПериода.ЭтотМесяц;	
	КонецЕсли;
	Если ВариантОтображения = 0 Тогда
		ВариантОтображения = 3;	
	КонецЕсли;
	УстановитьПараметры();
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьПараметры();
	РассчитатьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ЗагруженаВыпискаИзБанка" Тогда
		УстановитьПараметры();
		РассчитатьИтоги();
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура ФильтрПриИзменении(Элемент)
	УстановитьПараметры();
	РассчитатьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура ОбменСБанком(Команда)
	ОткрытьФорму("Обработка.КлиентБанк.Форма");
КонецПроцедуры

#КонецОбласти

#Область Дополнительно

&НаСервере
Процедура УстановитьПараметры()
	//Список.Параметры.УстановитьЗначениеПараметра("НачалоПериода", Период.ДатаНачала);
	//Список.Параметры.УстановитьЗначениеПараметра("КонецПериода", Период.ДатаОкончания);
	//Список.Параметры.УстановитьЗначениеПараметра("ВариантОтображения", ВариантОтображения);
	Список.Параметры.УстановитьЗначениеПараметра("Организация", Организация);
	Список.Параметры.УстановитьЗначениеПараметра("БанковскийСчёт", БанковскийСчёт); 
КонецПроцедуры

&НаСервере
Процедура РассчитатьИтоги()
	УстановитьПривилегированныйРежим(Истина);
	ОстатокНаНачало = 0;
	Поступило = 0;
	Списано = 0;
	ОстатокНаКонец = 0;
	ОстатокНаСчёте = 0;
	КСписанию = 0;
	Доступно = 0;
	Если Не ЗначениеЗаполнено(БанковскийСчёт) Тогда Возврат КонецЕсли;	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ДенежныеСредстваОрганизацийОстаткиИОбороты.СуммаНачальныйОстаток КАК ОстатокНаНачало,
	                      |	ДенежныеСредстваОрганизацийОстаткиИОбороты.СуммаПриход КАК Поступило,
	                      |	ДенежныеСредстваОрганизацийОстаткиИОбороты.СуммаРасход КАК Списано,
	                      |	ДенежныеСредстваОрганизацийОстаткиИОбороты.СуммаКонечныйОстаток КАК ОстатокНаКонец,
	                      |	0 КАК ОстатокНаСчёте,
	                      |	0 КАК КСписанию
	                      |ИЗ
	                      |	РегистрНакопления.ДенежныеСредстваОрганизаций.ОстаткиИОбороты(
	                      |			&НачалоПериода,
	                      |			&КонецПериода,
	                      |			,
	                      |			,
	                      |			Организация = &Организация
	                      |				И МестоХранения = &БанковскийСчёт) КАК ДенежныеСредстваОрганизацийОстаткиИОбороты
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	0,
	                      |	0,
	                      |	0,
	                      |	0,
	                      |	ДенежныеСредстваОрганизацийОстатки.СуммаОстаток,
	                      |	0
	                      |ИЗ
	                      |	РегистрНакопления.ДенежныеСредстваОрганизаций.Остатки(
	                      |			,
	                      |			Организация = &Организация
	                      |				И МестоХранения = &БанковскийСчёт) КАК ДенежныеСредстваОрганизацийОстатки
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	0,
	                      |	0,
	                      |	0,
	                      |	0,
	                      |	0,
	                      |	СУММА(СписаниеБезналичныхДенежныхСредств.Сумма)
	                      |ИЗ
	                      |	Документ.СписаниеБезналичныхДенежныхСредств КАК СписаниеБезналичныхДенежныхСредств
	                      |ГДЕ
	                      |	СписаниеБезналичныхДенежныхСредств.Проведен
	                      |	И НЕ СписаниеБезналичныхДенежныхСредств.ПроведеноБанком
	                      |	И СписаниеБезналичныхДенежныхСредств.Организация = &Организация
	                      |	И СписаниеБезналичныхДенежныхСредств.БанковскийСчёт = &БанковскийСчёт");
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("БанковскийСчёт", БанковскийСчёт);
	ТЗ = Запрос.Выполнить().Выгрузить();
	ОстатокНаНачало = ТЗ.Итог("ОстатокНаНачало");
	Поступило = ТЗ.Итог("Поступило");
	Списано = ТЗ.Итог("Списано");
	ОстатокНаКонец = ТЗ.Итог("ОстатокНаКонец");
	ОстатокНаСчёте = ТЗ.Итог("ОстатокНаСчёте");
	КСписанию = ТЗ.Итог("КСписанию");
	Доступно = ОстатокНаСчёте - КСписанию;
КонецПроцедуры

#КонецОбласти 

