  
#Область Обработчики_событий_формы  
  
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	УстановитьВидимостьЭлементов();
	Элементы.Реквизит.Доступность = Не Запись.Реквизит.Служебный;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) 
	Если Не ТекущийОбъект.Реквизит.Периодический Тогда
		ТекущийОбъект.Период = РегистрыСведений.РеквизитыКонтрагентов.ДатаНепериодическогоРеквизита();	
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура ПредставдениеОчистка(Элемент, СтандартнаяОбработка) 
	Запись.Представление = "";
	Запись.Значение = ""; 
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если Не РаботаСАдресом Тогда Возврат КонецЕсли;
	// Если представление было изменено в поле и сразу нажата
	// кнопка выбора, то необходимо привести данные в соответствие
	// и сбросить внутренние поля для повторного репарсинга
	Если Элемент.ТекстРедактирования <> Запись.Представление Тогда
		Запись.Представление = Элемент.ТекстРедактирования;
		Запись.Значение = "";
	КонецЕсли;
	// Данные для редактирования
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
КонецПроцедуры

&НаКлиенте
Процедура ВидРеквизитаПриИзменении(Элемент)
	УстановитьВидимостьЭлементов();	
КонецПроцедуры

#КонецОбласти

#Область Дополнительно

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	РаботаСАдресом = СтрНайти(НРег(Запись.Реквизит), "адрес") > 0; 
	Элементы.Период.Видимость = Запись.Реквизит.Периодический;
	Элементы.Представление.КнопкаВыбора = РаботаСАдресом;
КонецПроцедуры	

#КонецОбласти

