
#Область Интерфейс

Асинх Процедура ПрисоединитьФайлы(Объект, Связь = Неопределено, Фильтр = Неопределено, ОповещениеОбъекта = Неопределено) Экспорт
	ДВФ = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДВФ.Заголовок = "Выберите файлы для прикрепления";
	ДВФ.МножественныйВыбор = Истина;
	ДВФ.ПредварительныйПросмотр = Ложь;
	Если Не Фильтр = Неопределено Тогда 
		ДВФ.Фильтр = Фильтр;
	КонецЕсли;
	Обещание = ДВФ.ВыбратьАсинх();
	МасФайлы = Ждать Обещание;
	Если МасФайлы = Неопределено Тогда Возврат КонецЕсли;
	МасОписанияФайлов = ПолучитьМассивОписанийПередаваемыхФайлов(МасФайлы);
	П = Новый Структура("Объект, Связь", Объект, Связь);
	Если Не ОповещениеОбъекта = Неопределено Тогда 
		П.Вставить("ОповещениеОбъекта",ОповещениеОбъекта);
	КонецЕсли;
	Оп = Новый ОписаниеОповещения("ПослеЗавершенияПомещенияФайловНаСервер", ПрисоединённыеФайлыКлиент, П); 
	НачатьПомещениеФайловНаСервер(Оп,,, МасОписанияФайлов);
КонецПроцедуры	

Асинх Процедура ОткрытьФайл(Ключ, Форма) Экспорт
	МасКлючи = Новый Массив;
	МасКлючи.Добавить(Ключ);
	МасОписанияФайлов = ПрисоединённыеФайлыВызовСервера.ПодготовитьФайлыДляПередачиНаКлиент(МасКлючи, Форма.УникальныйИдентификатор);	
	Обещание = КаталогВременныхФайловАсинх();
	КаталогФайлов = Ждать Обещание;	
	Обещание = ПолучитьФайлыССервераАсинх(МасОписанияФайлов, КаталогФайлов);
	МасФайлы = Ждать Обещание;
	Для Каждого ПереданныйФайл Из МасФайлы Цикл
		П = Новый Структура("ПолноеИмяФайла", ПереданныйФайл.ПолноеИмя);
		Оп = Новый ОписаниеОповещения("ПослеЗавершенияРаботыПриложения", ПрисоединённыеФайлыКлиент, П);
		НачатьЗапускПриложения(Оп, ПереданныйФайл.ПолноеИмя); 
	КонецЦикла;
	Если МасФайлы.Количество() = 0 Тогда
		ПоказатьПредупреждение(, Нстр("fr = 'Les fichiers ne sont pas joints'; ru = 'Файлы не присоединены'; en = 'Files are not attached'; es = 'Archivos no adjuntos'"));	
	КонецЕсли;	
КонецПроцедуры

Асинх Процедура НапечататьФайлы(Знач МасКлючи, Форма) Экспорт
	МасОписанияФайлов = ПрисоединённыеФайлыВызовСервера.ПодготовитьФайлыДляПередачиНаКлиент(МасКлючи, Форма.УникальныйИдентификатор);	
	Обещание = КаталогВременныхФайловАсинх();
	КаталогФайлов = Ждать Обещание;	
	Обещание = ПолучитьФайлыССервераАсинх(МасОписанияФайлов, КаталогФайлов);
	МасФайлы = Ждать Обещание;
	Shell = Новый COMОбъект("Shell.Application");
	Для Каждого ПереданныйФайл Из МасФайлы Цикл
		ИмяФайла = СтрЗаменить(ПереданныйФайл.ПолноеИмя, "/", "\");
		РасширенияИсключения = 
			" m3u, m4a, mid, midi, mp2, mp3, mpa, rmi, wav, wma, 
			| 3g2, 3gp, 3gp2, 3gpp, asf, asx, avi, m1v, m2t, m2ts, m2v, m4v, mkv, mov, mp2v, mp4, mp4v, mpe, mpeg, mts, vob, wm, wmv, wmx, wvx,
			| 7z, zip, rar, arc, arh, arj, ark, p7m, pak, package, 
			| app, com, exe, jar, dll, res, iso, isz, mdf, mds,
			| cf, dt, epf, erf";
		
		Расширение = НРег(Сред(ПереданныйФайл.Имя,СтрНайти(ПереданныйФайл.Имя,".",НаправлениеПоиска.СКонца)+1));
		
		Если СтрНайти(РасширенияИсключения, " " + Расширение + ",") > 0 Тогда
			ПоказатьПредупреждение(, НСтр("fr = 'Ce type de fichier ne peut pas être imprimé.'; ru = 'Печать файлов данного типа недоступна.'; en = 'Printing of this type of files is not available.'; es = 'Este tipo de archivo no se puede imprimir.'"));
			Продолжить;
		ИначеЕсли Расширение = "grs" Тогда
			Схема = Новый ГрафическаяСхема;
			Схема.Прочитать(ИмяФайла);
			Схема.Напечатать();
			Продолжить; 
		КонецЕсли;
		Попытка
			Shell.ShellExecute(ИмяФайла, "", "", "print", 1); 
		Исключение
			ПоказатьПредупреждение(, ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("fr = ""Impossible d'imprimer le fichier pour une raison:"
"%1""; ru = 'Не удалось распечатать файл по причине:"
"%1'; en = 'The file could not be printed due to:"
"%1'; es = 'No se pudo imprimir el archivo porque:"
"%1'"), КраткоеПредставлениеОшибки(ИнформацияОбОшибке()))); 
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

Асинх Процедура СохранитьФайлы(Знач МасКлючи, Форма) Экспорт
	ДВФ = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДВФ.Заголовок = "Выберите каталог для сохранения";
	Обещание = ДВФ.ВыбратьАсинх();
	МасФайлы = Ждать Обещание;
	Если МасФайлы = Неопределено Тогда Возврат КонецЕсли;
    МасОписанияФайлов = ПрисоединённыеФайлыВызовСервера.ПодготовитьФайлыДляПередачиНаКлиент(МасКлючи, Форма.УникальныйИдентификатор);
	Обещание = ПолучитьФайлыССервераАсинх(МасОписанияФайлов, МасФайлы[0]);
	МасФайлы = Ждать Обещание;
	Если МасФайлы.Количество() = 0 Тогда
		ПоказатьПредупреждение(, Нстр("fr = 'Les fichiers ne sont pas joints'; ru = 'Файлы не присоединены'; en = 'Files are not attached'; es = 'Archivos no adjuntos'"));	
	КонецЕсли;
КонецПроцедуры

Процедура ВыбратьИзображение(Форма, ИмяРеквизита, СтандартнаяОбработка) Экспорт
	СтандартнаяОбработка = Ложь;
	ДополнительныеПараметры = Новый Структура("Форма, ИмяРеквизита", Форма, ИмяРеквизита);
	ДВФ = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДВФ.Заголовок = "Выберите изображение";
	ДВФ.МножественныйВыбор = Ложь;
	ДВФ.ПредварительныйПросмотр = Истина;
    ДВФ.ПолноеИмяФайла = "";
	ДВФ.Фильтр = "Все картинки (*.bmp;*.dib;*.rle;*.jpg;*.jpeg;*.tif;*.png)|*.bmp;*.dib;*.rle;*.jpg;*.jpeg;*.tif;*.png|" 
				+ "BMP (*.bmp;*.dib;*.rle)|*.bmp;*.dib;*.rle|"
				+ "JPEG (*.jpg;*.jpeg)|*.jpg;*.jpeg|"
				+ "TIFF (*.tif)|*.tif|"
				+ "PNG (*.png)|*.png|";
	Оп = Новый ОписаниеОповещения("ПослеЗакрытияДиалогаВыбораИзображения", ПрисоединённыеФайлыКлиент, ДополнительныеПараметры);
	ДВФ.Показать(Оп);
КонецПроцедуры	

Процедура УдалитьИзображение(Форма, Реквизит) Экспорт
	Реквизит = "";
	Форма.Модифицированность = Истина;	
КонецПроцедуры

#КонецОбласти

#Область Оповещения

Асинх Процедура ПослеЗавершенияПомещенияФайловНаСервер(ПомещенныеФайлы, ДополнительныеПараметры) Экспорт
	Если ПомещенныеФайлы = Неопределено Тогда Возврат КонецЕсли;
	Мас = Новый Массив;
	Для Каждого Стр Из ПомещенныеФайлы Цикл
		Файл = Стр.СсылкаНаФайл.Файл;
		Структура = Новый Структура;
		Структура.Вставить("Адрес", Стр.Адрес);
		Структура.Вставить("ИмяФайла", Файл.ИмяБезРасширения);
		Структура.Вставить("Расширение", СтрЗаменить(НРег(Файл.Расширение), ".", ""));
		Обещание = Файл.РазмерАсинх();
		Размер = Ждать Обещание;		
		Структура.Вставить("Размер", Размер / (1024 * 1024));
		Мас.Добавить(Структура);
	КонецЦикла;	
	ПрисоединённыеФайлыВызовСервера.ЗаписатьДанныеПрикреплённыхФайлов(ДополнительныеПараметры.Объект, ДополнительныеПараметры.Связь, Мас);
	ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.ПрисоединённыеФайлы"));
	Если ДополнительныеПараметры.Свойство("ОповещениеОбъекта") Тогда 
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеОбъекта);
	КонецЕсли;
КонецПроцедуры

Асинх Процедура ПослеЗавершенияРаботыПриложения(КодВозврата, ДополнительныеПараметры) Экспорт
	Если КодВозврата = Неопределено Тогда Возврат КонецЕсли;
	Обещание = УдалитьФайлыАсинх(ДополнительныеПараметры.ПолноеИмяФайла);
	Ждать Обещание;
КонецПроцедуры

Процедура ПослеЗакрытияДиалогаВыбораИзображения(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	Если ВыбранныеФайлы = Неопределено Тогда Возврат КонецЕсли;
	Оп = Новый ОписаниеОповещения("ЗагрузитьИзображение", ПрисоединённыеФайлыКлиент, ДополнительныеПараметры);
	НачатьПомещениеФайлаНаСервер(Оп,,,, ВыбранныеФайлы[0], ДополнительныеПараметры.Форма.УникальныйИдентификатор);
КонецПроцедуры 

Процедура ЗагрузитьИзображение(ОписаниеПомещенногоФайла, ДополнительныеПараметры) Экспорт
	Если ОписаниеПомещенногоФайла.ПомещениеФайлаОтменено Тогда Возврат КонецЕсли;
	Форма = ДополнительныеПараметры.Форма;	
	Форма.Модифицированность = Истина;
	Форма[ДополнительныеПараметры.ИмяРеквизита] = ОписаниеПомещенногоФайла.Адрес;
	Если Форма.Объект.Свойство(ДополнительныеПараметры.ИмяРеквизита+"ИмяФайла") Тогда 
		Форма.Объект[ДополнительныеПараметры.ИмяРеквизита+"ИмяФайла"] = ОписаниеПомещенногоФайла.СсылкаНаФайл.Имя;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область Дополнительно

Функция ПолучитьМассивОписанийПередаваемыхФайлов(МасФайлы)
	Результат = Новый Массив;
	Для Каждого ПолноеИмяФайла Из МасФайлы Цикл
		Описание = Новый ОписаниеПередаваемогоФайла;
		Описание.Имя = ПолноеИмяФайла;
		Результат.Добавить(Описание);
	КонецЦикла;
	Возврат Результат;
КонецФункции	

Функция ПолучитьДанныеСвязи(Отбор) Экспорт
	Результат = Новый Структура("Объект, Связь", Неопределено, Неопределено);
	Для Каждого Стр Из Отбор.Элементы Цикл
		Если Стр.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект") Тогда
			Результат.Объект = Стр.ПравоеЗначение;	
		КонецЕсли;
		Если Стр.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Связь") Тогда
			Результат.Связь = Стр.ПравоеЗначение;	
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции 


#КонецОбласти

