
#Область Проценты

// Прямое вычитание процента из числа
Функция ВычестьПроцент(Сумма, Процент) Экспорт
	Возврат Сумма - Окр(Сумма / 100 * Процент, 4);	
КонецФункции

// Прямое добвление процента к числу
Функция ДобавитьПроцент(Сумма, Процент) Экспорт
	Возврат Сумма + Окр(Сумма / 100 * Процент, 4);	
КонецФункции

// Вычисляет из какого числа был вычтен указанный процент 
Функция ИсходноеЧислоПоПроценту(Сумма, Процент) Экспорт
	Возврат Сумма * 100 / (100 - Процент);	
КонецФункции	

// Вычисляет на сколько процентов полученное число больше/меньше исходного
// При обратном расчёте рассчитывает на сколько процентов исходное число больше/меньше полученного
Функция РазницаВПроцентах(ИсходноеЧисло, ПолученноеЧисло, ОбратныйРасчёт = Ложь) Экспорт
	Если ИсходноеЧисло = 0 Тогда
		Возврат 0;
	КонецЕсли;	
	Процент = Окр(100 * ПолученноеЧисло / ИсходноеЧисло, 4);
	Возврат ?(ОбратныйРасчёт, 100 - Процент, Процент - 100);
КонецФункции	

#КонецОбласти

#Область Даты

Функция СложитьДаты(Дата1, Дата2) Экспорт
	ПустаяДата = Дата(1,1,1);
	Возврат ПустаяДата + (Дата1 - ПустаяДата) + (Дата2 - ПустаяДата);
КонецФункции

Функция РазностьДатВДнях(Дата1, Дата2) Экспорт
	КоличествоСекунд = ?(Дата1 > Дата2, НачалоДня(Дата1) - НачалоДня(Дата2), НачалоДня(Дата2) - НачалоДня(Дата1));
	Возврат КоличествоСекунд / СекундВСутках();	
КонецФункции

Функция СекундВСутках()
	Возврат 86400;	
КонецФункции

#КонецОбласти

#Область Разное

Функция МодульЧисла(ИсходноеЧисло) Экспорт
	Возврат Макс(ИсходноеЧисло, -ИсходноеЧисло);	
КонецФункции	

Функция ОкрВверх(Знач ОкругляемоеЧисло, Разрядность = 0) Экспорт
	Знак = ?(ОкругляемоеЧисло < 0, -1, 1);
	ОкругляемоеЧисло = Макс(-ОкругляемоеЧисло, ОкругляемоеЧисло); // Получаем модуль числа	
	Если ОкругляемоеЧисло = Окр(ОкругляемоеЧисло, Разрядность) Тогда
		Возврат ОкругляемоеЧисло * Знак;		
	КонецЕсли;	
	ОкруглённоеЧисло = Окр(ОкругляемоеЧисло, Разрядность);
	Слагаемое = ?(Разрядность = 0, "0", "0.");
	Для А = 2 По Разрядность Цикл
		Слагаемое = Слагаемое + "0";	
	КонецЦикла;
	Слагаемое = Число(Слагаемое + "1"); 
	Результат = ?(ОкруглённоеЧисло < ОкругляемоеЧисло, ОкруглённоеЧисло + Слагаемое, ОкруглённоеЧисло);
	Возврат Результат * Знак;
КонецФункции

#КонецОбласти

