
#Область ПрограммныйИнтерфейс

// Обработчик события вызывается при получении имени кассира.
//
// Параметры:
//  ИмяКассира - Строка, Неопределено - Текст, используемый для заполнения документа
//  СтандартнаяОбработка - Булево
//
Процедура ОбработкаЗаполненияИмяКассира(ИмяКассира, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Обработчик события вызывается при получении ИНН кассира.
//
// Параметры:
//  ИННКассира - Строка, Неопределено - Текст, используемый для заполнения документа
//  СтандартнаяОбработка - Булево
//
Процедура ОбработкаЗаполненияИННКассира(ИННКассира, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Обработчик события вызывается при заполнения наименования рабочего места.
//
// Параметры:
//  Наименование - Строка - Наименование рабочего места.
//  ИмяПользователя - Строка - Имя пользователя информационной базы.
//  СтандартнаяОбработка - Булево
//
Процедура ОбработкаЗаполненияНаименованияРабочегоМеста(Наименование, ИмяПользователя, СтандартнаяОбработка)  Экспорт
	
КонецПроцедуры

// Обработчик события получения идентификатора клиента для рабочегоМеста.
//
// Параметры:
//  ИдентификаторКлиента - Строка, Неопределено - Идентификатор клиента
//  СтандартнаяОбработка - Булево
//
Процедура ИдентификаторКлиентаДляРабочегоМеста(ИдентификаторКлиента, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

#КонецОбласти