
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ДатаРегистрации = ТекущаяДатаСеанса();
	//Наименование = НСтр("fr = 'Nouveau'; ru = 'Новый'; en = 'New'; es = 'Nuevo'");
	Категория = Константы.КатегорияКлиентаПоУмолчанию.Получить();
	ТипЦены = Константы.ТипЦенПоУмолчанию.Получить();
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПользовательСсылка = Справочники.Пользователи.ПустаяСсылка();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Контрагент = &Контрагент";
	
	Запрос.УстановитьПараметр("Контрагент", ЭтотОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПользовательСсылка = ВыборкаДетальныеЗаписи.Ссылка;		
	КонецЦикла;
	
	Если ЭтотОбъект.ЛичныйКабинетПартнера Тогда  
		Если ПользовательСсылка.Пустая() Тогда  
			//создаем пользователя      
			
			Если СокрЛП(ЭтотОбъект.Логин) <> "" Тогда
		    	НовыйПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
		        НовыйПользователь.Имя = ЭтотОбъект.Логин;
		        НовыйПользователь.Пароль = ЭтотОбъект.Пароль;
		        НовыйПользователь.ПолноеИмя = ЭтотОбъект.Наименование; 
				НовыйПользователь.Роли.Добавить(Метаданные.Роли.ЛичныйКабинет);      
		        НовыйПользователь.ПоказыватьВСпискеВыбора = Ложь;   
		        НовыйПользователь.Записать();
				
				СпрПол = Справочники.Пользователи.СоздатьЭлемент();    
				СпрПол.ИдентификаторПользователяИБ = НовыйПользователь.УникальныйИдентификатор;
				СпрПол.Наименование = ЭтотОбъект.Логин;
				СпрПол.Контрагент = ЭтотОбъект.Ссылка;
				СпрПол.ВходВПрограммуРазрешен = Истина;
				СпрПол.ПолноеИмя = ЭтотОбъект.Наименование;
				СпрПол.Роли = "ЛичныйКабинет";
				СпрПол.Записать();    
			КонецЕсли;
			
		Иначе
			//обновляем пользователя              
			Если СокрЛП(ЭтотОбъект.Логин) <> "" Тогда
		    	НовыйПользователь=ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ПользовательСсылка.ИдентификаторПользователяИБ);
		        НовыйПользователь.Имя = ЭтотОбъект.Логин;    
				Если СокрЛП(ЭтотОбъект.Пароль) <> "" Тогда
		        	НовыйПользователь.Пароль = ЭтотОбъект.Пароль; 
				КонецЕсли;
		  	    НовыйПользователь.Записать();	
			КонецЕсли;
					
			СпрПол = ПользовательСсылка.ПолучитьОбъект(); 
	        СпрПол.ВходВПрограммуРазрешен = Истина; 
			СпрПол.Записать();			
		КонецЕсли;           
	Иначе	
		Если НЕ ПользовательСсылка.Пустая() Тогда  
			//обновляем пользователя  
			Если СокрЛП(ЭтотОбъект.Логин) <> "" Тогда
	    		НовыйПользователь=ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ПользовательСсылка.ИдентификаторПользователяИБ);
		        НовыйПользователь.Имя = ЭтотОбъект.Логин;       
				Если СокрЛП(ЭтотОбъект.Пароль) <> "" Тогда
		        	НовыйПользователь.Пароль = ЭтотОбъект.Пароль;
				КонецЕсли;
		  	    НовыйПользователь.Записать();	
			КонецЕсли;
						
			СпрПол = ПользовательСсылка.ПолучитьОбъект();  
	        СпрПол.ВходВПрограммуРазрешен = Ложь; 
			СпрПол.Записать();
		КонецЕсли;           		
	КонецЕсли;                                   
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если ЭтоНовый() Тогда 
		Автор = ПараметрыСеанса.Пользователь;   
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	//Если Не ВидКонтрагента = Перечисления.ВидыКонтрагентов.ЧастноеЛицо Тогда 
	//	ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("CIN"));
	//КонецЕсли;
	Если Не ВидКонтрагента = Перечисления.ВидыКонтрагентов.ЮридическоеЛицо Тогда 
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ICE"));
	КонецЕсли; 
КонецПроцедуры
