
Процедура ПередЗаписью(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если Не ЗначениеЗаполнено(Запись.ДатаДобавления) Тогда
			Запись.ДатаДобавления = ТекущаяДатаСеанса();	
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры 

Процедура ПриЗаписи(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	РегистрыСведений.ПрисоединённыеФайлыНаличие.ОбновитьНаличиеФайлов(ЭтотОбъект.Отбор.Объект.Значение);
КонецПроцедуры






