
&НаКлиенте
Перем ЗакрытиеФормы;

#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	РаботаСДокументами.МожноРедактироватьДокументВФорме(Объект.Ссылка, ЭтаФорма); 
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыФункциональныхОпций(ЭтаФорма);
	УстановитьВидЦеныПоДоговору();
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Отказ = РаботаСДокументамиКлиент.КлиентуЗапрещеноОтгружать(Объект);
	Если Отказ Тогда Возврат; КонецЕсли;
	Отказ = Не СерииИРазмещениеКлиент.ПроверитьСоответствиеСерийТоварам(ЭтаФорма, Объект.ТЧТовары, Объект.ТЧСерии, ПараметрыЗаписи);
	РаботаСДокументамиКлиент.ПроверитьСуммуАвансовТоварногоДокумента(Объект, Отказ);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить(РаботаСДокументами.СвойствоЗаписьИзФормы(), Истина);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, ТекущийОбъект);
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	РаботаСДокументамиКлиент.ЗаполнитьДанныеПоТорговойТочке(Объект, ВидЦены, Элементы.ТЧТоварыВидЦены);	
	УстановитьЦеныНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыФункциональныхОпций(ЭтаФорма);
	Объект.Договор = ОбщегоНазначенияВызовСервера.ПолучитьОсновнойДоговор(Объект.Контрагент, Объект.Организация, Истина);
	Объект.Менеджер = РаботаСДокументамиВызовСервера.ПолучитьКуратораДоговора(Объект.Договор, Объект.Дата).Менеджер;
	УстановитьВидЦеныПоДоговору();
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	Объект.Менеджер = РаботаСДокументамиВызовСервера.ПолучитьКуратораДоговора(Объект.Договор, Объект.Дата).Менеджер;
	УстановитьВидЦеныПоДоговору();
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьЦены(Команда)
	УстановитьЦеныНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьЦеныПоЗаказу(Команда)
	ПерезаполнитьЦеныПоЗаказуНаСервере();
	Для Каждого Стр Из Объект.ТЧТовары Цикл
		РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Стр, Объект.ЦенаВключаетНДС);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УказатьСерии(Команда)
	СерииИРазмещениеКлиент.УказатьСерии(Элементы.ТЧТовары.ТекущиеДанные, Объект);
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьСерии(Команда)
	ЗаполнитьСерииНаСервере();
КонецПроцедуры  

&НаКлиенте
Процедура МестоХраненияПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыФункциональныхОпций(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвансыПоСуммеДокумента(Команда)
	ЗаполнитьПоОстаткамНаСервере(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвансыВсеНезакрытые(Команда)
	ЗаполнитьПоОстаткамНаСервере(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ТЧЗачётАвансовОснованиеПриИзменении(Элемент)
	ТекСтр = Элементы.ТЧЗачётАвансов.ТекущиеДанные;
	ДанныеСуммы = РаботаСДокументамиВызовСервера.ПолучитьСуммуОснованияДляПлатёжногоДокумента(ТекСтр.Основание);
	ЗаполнитьЗначенияСвойств(ТекСтр, ДанныеСуммы);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекСтр = Элемент.ТекущиеДанные;
		ТекСтр.КодСтроки = РаботаСДокументамиКлиентСервер.ПолучитьСледующийКодСтроки(Объект.ТЧТовары);
		ТекСтр.ВидЦены = ВидЦены;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	РаботаСДокументамиКлиент.ПроверитьКратностьЕдиницы(Элемент.ТекущиеДанные, Объект, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПередУдалением(Элемент, Отказ)
	Для Каждого Инд Из Элементы.ТЧТовары.ВыделенныеСтроки Цикл
		Стр = Объект.ТЧТовары.НайтиПоИдентификатору(Инд);
		РаботаСДокументамиКлиентСервер.УдалитьСвязанныеСтроки(Объект, "ТЧСерии", Стр.КодСтроки);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПриАктивизацииЯчейки(Элемент)
	ТекСтр = Элемент.ТекущиеДанные;
	Если ТекСтр = Неопределено Тогда Возврат КонецЕсли;
	Если Элемент.ТекущийЭлемент = Элементы.ТЧТоварыКоличество Тогда
		Элемент.ТекущийЭлемент.ТолькоПросмотр = Не ЗначениеЗаполнено(ТекСтр.Упаковка);	
	КонецЕсли; 
	Если Элемент.ТекущийЭлемент = Элементы.ТЧТоварыЦена Или Элемент.ТекущийЭлемент = Элементы.ТЧТоварыСумма Тогда
		Элемент.ТекущийЭлемент.ТолькоПросмотр = ЗначениеЗаполнено(ТекСтр.ВидЦены);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект);
КонецПроцедуры 

&НаКлиенте
Процедура ТЧТоварыНоменклатураАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ПараметрыАвтоподбора = РаботаСДокументамиКлиент.ПараметрыАвтободбораНоменклатуры();
	ПараметрыАвтоподбора.ВидЦены = ВидЦены;
	ПараметрыАвтоподбора.ИсключитьХарактеристикиДляВнутреннегоИспользования = Истина;
	РаботаСДокументамиКлиент.АвтоподборНоменклатуры(ДанныеВыбора, ПараметрыПолученияДанных, Объект, СтандартнаяОбработка, ПараметрыАвтоподбора);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	РаботаСДокументамиКлиент.ОбрабокаВыбораПриАвтоподбореНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, ВыбранноеЗначение, Объект, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыХарактеристикаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыУпаковкаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСерияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекСтр = Элементы.ТЧТовары.ТекущиеДанные;
	ДанныеОтбора = Новый Структура("МестоХранения, Номенклатура, Характеристика, Клиент", Объект.МестоХранения, ТекСтр.Номенклатура, ТекСтр.Характеристика, Объект.Контрагент); 
	СерииИРазмещениеКлиент.ВыбратьСериюПоОстаткам(РаботаСДокументамиВызовСервера.ПолучитьГраницуДокумента(Объект), ДанныеОтбора,, ТекСтр);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыКоличествоУпаковокПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыКоличествоПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС, "Количество");
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыВидЦеныПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьЦенуНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыЦенаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС, "Цена");
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСуммаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС, "Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПроцентСкидкиПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСуммаСкидкиПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС, "Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСтавкаНДСПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСуммаНДСПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС, "СуммаНДС");
КонецПроцедуры

&НаКлиенте
Процедура ТЧУслугиКоличествоПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧУслуги.ТекущиеДанные, Объект.ЦенаВключаетНДС);
КонецПроцедуры

&НаКлиенте
Процедура ТЧУслугиЦенаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧУслуги.ТекущиеДанные, Объект.ЦенаВключаетНДС, "Цена");
КонецПроцедуры

&НаКлиенте
Процедура ТЧУслугиСуммаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧУслуги.ТекущиеДанные, Объект.ЦенаВключаетНДС, "Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ТЧУслугиСтавкаНДСПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧУслуги.ТекущиеДанные, Объект.ЦенаВключаетНДС);
КонецПроцедуры

&НаКлиенте
Процедура ТЧУслугиСуммаНДСПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС, "СуммаНДС");
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	РаботаСДокументамиКлиент.ЗаполнитьДанныеПоТорговойТочке(Объект, ВидЦены, Элементы.ТЧТоварыВидЦены);	
	УстановитьЦеныНаСервере();
КонецПроцедуры

#КонецОбласти

#Область Оповещения

&НаКлиенте
Процедура ПослеЗакрытияФормыРедактированияДовоза(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если РезультатЗакрытия = Неопределено Тогда Возврат КонецЕсли;
	Если РезультатЗакрытия.Идентификатор = Неопределено Тогда
		Стр = Объект.ТЧТовары.Добавить();
		Стр.КодСтроки = РаботаСДокументамиКлиентСервер.ПолучитьСледующийКодСтроки(Объект.ТЧТовары);
	Иначе
		Стр = Объект.ТЧТовары.НайтиПоИдентификатору(РезультатЗакрытия.Идентификатор);
		РаботаСДокументамиКлиентСервер.УдалитьСвязанныеСтроки(Объект, "ТЧСерии", Стр.КодСтроки);
	КонецЕсли;	
	ЗаполнитьЗначенияСвойств(Стр, РезультатЗакрытия,, "КодСтроки");
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Стр, Объект.ЦенаВключаетНДС);
КонецПроцедуры	

#КонецОбласти

#Область Дополнительно  

&НаСервере
Процедура УстановитьЦеныНаСервере()
	РаботаСДокументами.УстановитьЦеныВТабличнойЧасти(Объект.ТЧТовары, ВидЦены, Объект.Дата, Объект.ЦенаВключаетНДС);	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьЦеныПоЗаказуНаСервере()
	Если Не ЗначениеЗаполнено(Объект.Основание) Тогда Возврат КонецЕсли;
	ТЗЗаказ = Объект.Основание.ТЧТовары.Выгрузить();
	Для Каждого Стр Из Объект.ТЧТовары Цикл
		СтрЗаказ = ТЗЗаказ.Найти(Стр.КодСтроки, "КодСтроки");
		Если СтрЗаказ = Неопределено Тогда
			Стр.ВидЦены = Неопределено;
			Стр.Цена = 0;
			Стр.ЦенаSKU = 0;
		Иначе	
			Стр.ВидЦены = СтрЗаказ.ВидЦены;
			Стр.Цена = СтрЗаказ.Цена;
			Стр.ЦенаSKU = СтрЗаказ.ЦенаSKU;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСерииНаСервере()
	СерииИРазмещение.ЗаполнитьСерииПоОстаткам(Объект,Объект.Контрагент);	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоОстаткамНаСервере(ВсеНеоплаченные)
	РаботаСДокументами.ПолучитьАвансыДляЗакрытия(Объект, Истина, ВсеНеоплаченные);		
КонецПроцедуры

&НаСервере
Процедура УстановитьВидЦеныПоДоговору()
	ВидЦены = Объект.Договор.ВидЦены;
	РаботаСДокументамиКлиентСервер.ЗаполнитьСписокВыбораВидовЦен(ВидЦены, Элементы.ТЧТоварыВидЦены);
КонецПроцедуры

#КонецОбласти



