 
#Область Обработчики_событий_формы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Контрагент", Объект.Ссылка));
	//ЗначениеВРеквизитФормы(РегистрыСведений.РеквизитыКонтрагентов.ПолучитьДеревоРеквизитовКонтрагента(Объект.Ссылка), "ДЗРеквизиты");
	Если Не Объект.Ссылка.Пустая() Тогда 
		ЗаполнитьКонтактнуюИнформацию();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщегоНазначенияКлиент.РазвернутьДеревоЗначений(ДЗРеквизиты, Элементы.ДЗРеквизиты);
	УстановитьДоступностьЭлементов();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//РеквизитыКонтрагентов.ПередЗаписьюНаСервере(ТекущийОбъект, РеквизитФормыВЗначение("ДЗРеквизиты"), Отказ);
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//РеквизитыКонтрагентов.ПриЗаписиНаСервере(ТекущийОбъект, РеквизитФормыВЗначение("ДЗРеквизиты"));
	СохранитьКонтактнуюИнформацию();
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура ЗаполнитьПоИНН(Команда)
	РаботаСДокументамиКлиент.ЗаписатьЕслиНовый(ЭтаФорма);
	РеквизитыКонтрагентовКлиент.ОбработатьРезультатЗаполненияРеквизитовПоИНН(ЭтаФорма, ЗаполнитьПоИНННаСервере()); 
КонецПроцедуры

&НаКлиенте
Процедура ПокупательПриИзменении(Элемент)
	УстановитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ВидКонтрагентаПриИзменении(Элемент)
	УстановитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРеквизит(Команда)
	РеквизитыКонтрагентовКлиент.СформироватьМенюВыбораВидаРеквизита(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура КомментарийРеквизита(Команда)
	РеквизитыКонтрагентовКлиент.ОткрытьФормуВводаДополнительныхДанных(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьВФактическийАдрес(Команда)
	РеквизитыКонтрагентовКлиент.Скопировать(ЭтаФорма, ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.АдресФактический"));
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьВАдресДоставки(Команда)
	РеквизитыКонтрагентовКлиент.Скопировать(ЭтаФорма, ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.АдресДоставки"));
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьВАдресПроживания(Команда)
	РеквизитыКонтрагентовКлиент.Скопировать(ЭтаФорма, ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.АдресПроживания"));
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьВАдресПоПрописке(Команда)
	РеквизитыКонтрагентовКлиент.Скопировать(ЭтаФорма, ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.АдресПоПрописке"));
КонецПроцедуры

&НаКлиенте
Процедура ДЗРеквизитыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	РеквизитыКонтрагентовКлиент.ВыборТаблицаФормы(ЭтаФорма, ВыбраннаяСтрока, СтандартнаяОбработка);	
КонецПроцедуры

&НаКлиенте
Процедура ДЗРеквизитыПриАктивизацииСтроки(Элемент)
	РеквизитыКонтрагентовКлиент.ПриАктивацииСтроки(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ДЗРеквизитыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	РеквизитыКонтрагентовКлиент.ОбработкаВыбораТаблицаФормы(ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка); 
КонецПроцедуры

&НаКлиенте
Процедура ДЗРеквизитыПередНачаломИзменения(Элемент, Отказ)
	РеквизитыКонтрагентовКлиент.ПередНачаломИзменения(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаДоставка Тогда 
		ЗаполнитьСтраницуДоставка();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область Дополнительно

&НаСервере
Функция ЗаполнитьПоИНННаСервере()
	Возврат РеквизитыКонтрагентов.ЗаполнитьРеквизитыПоИННВФорме(ЭтаФорма);
КонецФункции

&НаКлиенте
Процедура УстановитьДоступностьЭлементов()
	//Элементы.СтраницаДоставка.Видимость = Объект.Покупатель;
КонецПроцедуры	

Процедура ЗаполнитьСтраницуДоставка()
	//Если Не Объект.ТЧГрафикДоставок.Количество() = 0 тогда Возврат; КонецЕсли;
	//Для ДеньНедели = 1 по 7 Цикл 
	//	Стр = Объект.ТЧГрафикДоставок.Добавить();
	//	Стр.ДеньНедели = Перечисления.ДниНедели.Получить(ДеньНедели-1);
	//КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьКонтактнуюИнформацию()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СправочникКонтрагенты.Ссылка КАК Ссылка,
	|	ЕстьNull(Телефон.Представление,"""") КАК Телефон,
	|	ЕстьNull(EMail.Представление,"""") КАК EMail
	|ИЗ
	|	Справочник.Контрагенты КАК СправочникКонтрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыКонтрагентов КАК Телефон
	|		ПО СправочникКонтрагенты.Ссылка = Телефон.Контрагент
	|			И (Телефон.Реквизит = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.Телефон))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыКонтрагентов КАК EMail
	|		ПО СправочникКонтрагенты.Ссылка = EMail.Контрагент
	|			И (EMail.Реквизит = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.EMail))
	|ГДЕ
	|	СправочникКонтрагенты.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		НомерТелефона = Выборка.Телефон;
		EMail = Выборка.EMail;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьКонтактнуюИнформацию()
	НЗ = РегистрыСведений.РеквизитыКонтрагентов.СоздатьНаборЗаписей();
	НЗ.Отбор.Контрагент.Установить(Объект.Ссылка);
	
	НС = НЗ.Добавить();
	НС.Контрагент = Объект.Ссылка;
	НС.Реквизит = ПланыВидовХарактеристик.ВидыРеквизитовКонтрагентов.Телефон;
	НС.Представление = НомерТелефона;
	//НС.Значение = НомерТелефона;
	
	НС = НЗ.Добавить();
	НС.Контрагент = Объект.Ссылка;
	НС.Реквизит = ПланыВидовХарактеристик.ВидыРеквизитовКонтрагентов.EMail;
	НС.Представление = EMail;
	НЗ.Записать(Истина);		
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ЗаполнитьКонтактнуюИнформацию();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//Объект.ECommerce = Истина;
	Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ЧастноеЛицо");
	Объект.Покупатель = Истина;
КонецПроцедуры

#КонецОбласти
