
Функция ЭтоФоновоеЗадание() Экспорт
	Сеанс = ПолучитьТекущийСеансИнформационнойБазы();
	Возврат Сеанс.ПолучитьФоновоеЗадание() <> Неопределено;
КонецФункции	 

Функция ПодключитьКомпонентуГенерацииИзображенияШтрихкода() Экспорт
	УстановитьОтключениеБезопасногоРежима(Истина);
	Результат = ОбщегоНазначения.ПодключитьКомпонентуПоИдентификатору("Barcode", "ОбщийМакет.КомпонентаПечатиШтрихкодов");
	Если Результат.Подключено Тогда
		ВнешняяКомпонента = Результат.ПодключаемыйМодуль;
	Иначе
		Возврат Неопределено;	
	КонецЕсли;	
	Если ВнешняяКомпонента.НайтиШрифт("Tahoma") Тогда
		ВнешняяКомпонента.Шрифт = "Tahoma";
	Иначе
		Для Сч = 0 По ВнешняяКомпонента.КоличествоШрифтов - 1 Цикл
			ТекущийШрифт = ВнешняяКомпонента.ШрифтПоИндексу(Сч);
			Если ТекущийШрифт <> Неопределено Тогда
				ВнешняяКомпонента.Шрифт = ТекущийШрифт;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	ВнешняяКомпонента.РазмерШрифта = 12;
	Возврат ВнешняяКомпонента;
КонецФункции

Функция СтруктураДанныхСубконто() Экспорт
	Результат = Новый Структура;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВидыСубконтоХозрасчетные.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
	                      |	ВидыСубконтоХозрасчетные.ТипЗначения КАК ТипЗначения
	                      |ИЗ
	                      |	ПланВидовХарактеристик.ВидыСубконтоХозрасчетные КАК ВидыСубконтоХозрасчетные
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ИмяПредопределенныхДанных");
	Выб = Запрос.Выполнить().Выбрать();
	Пока Выб.Следующий() Цикл
		Результат.Вставить(Выб.ИмяПредопределенныхДанных, Выб.ТипЗначения.ПривестиЗначение());	
	КонецЦикла;	
	Возврат Результат;
КонецФункции
