
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПолучитьГраницу();
	ПолучитьПоследовательность();
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ПолучитьПоследовательность();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПерепроведение(Команда) 
	ЗаблокироватьФорму(Истина); 
	ВсегоДокументов = 0;
	ПроведеноДокументов = -1;
	ТекущаяДатаПроведения = Объект.Период.ДатаНачала;
	ПровестиДокументы();
	ПодключитьОбработчикОжидания("ОбновлениеСостояния", 1); // Получаем данные фонового задания
	ПодключитьОбработчикОжидания("ПроверкаСостояния", 0.2, Истина); // Выводим прогресс 
КонецПроцедуры

&НаКлиенте
Процедура ТЧПоследовательностьВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекСтр = Объект.ТЧПоследовательность.НайтиПоИдентификатору(ВыбраннаяСтрока);
	ПоказатьЗначение(, ТекСтр.Документ); 
КонецПроцедуры

#КонецОбласти

#Область Оповещения

&НаКлиенте
Процедура ОбновлениеСостояния() Экспорт
	Если ФоновоеЗаданиеЗавершено(ИдентификаторФоновогоЗадания, ВсегоДокументов, ПроведеноДокументов, ТекущаяДатаПроведения) Тогда
    	ОтключитьОбработчикОжидания("ОбновлениеСостояния");
		ПроведеноДокументов = ВсегоДокументов;
		ПоказатьПредупреждение(, Нстр("fr = 'Documents reportés'; ru = 'Документы перепроведены'; en = 'Documents have been rechecked'; es = 'Documentos reevaluados'"));
	  	ЗаблокироватьФорму(Ложь);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаСостояния() Экспорт
	Прогресс = Окр(?(ВсегоДокументов = 0, 0, ПроведеноДокументов / ВсегоДокументов * 100));
	Пояснение = "Проведено " + Формат(ПроведеноДокументов, "ЧГ=0") + " из " + Формат(ВсегоДокументов, "ЧГ=0") + " - " + Формат(ТекущаяДатаПроведения, "ДЛФ=DD");		
	Состояние("Перепроведение документов", Прогресс, Пояснение);
	Если ПроведеноДокументов < ВсегоДокументов Тогда 
		ПодключитьОбработчикОжидания("ПроверкаСостояния", 0.2, Истина);
	КонецЕсли;
КонецПроцедуры	

#КонецОбласти

#Область Дополнительно

&НаСервере
Процедура ПолучитьГраницу()
	Момент = Последовательности.Основная.ПолучитьГраницу();
	Граница = Момент.Ссылка;
	Объект.Период.ДатаНачала = НачалоДня(Момент.Дата);
	Объект.Период.ДатаОкончания = ТекущаяДатаСеанса();	
КонецПроцедуры

&НаСервере
Процедура ПолучитьПоследовательность() Экспорт
	Объект.ТЧПоследовательность.Загрузить(РаботаСДокументами.ПолучитьПоследовательность(Объект.Период.ДатаНачала, Объект.Период.ДатаОкончания));
КонецПроцедуры

&НаСервереБезКонтекста
Функция ФоновоеЗаданиеЗавершено(ИдентификаторФоновогоЗадания, ВсегоДокументов, ПроведеноДокументов, ТекущаяДатаПроведения)
	ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторФоновогоЗадания);
	Сообщения = ФоновоеЗадание.ПолучитьСообщенияПользователю(Истина);
	Если Сообщения.Количество() > 0 Тогда
		МасДанные = СтрРазделить(Сообщения.Получить(Сообщения.Количество() - 1).Текст, ";", Ложь);
		ВсегоДокументов = Число(МасДанные[0]);
		ПроведеноДокументов = Число(МасДанные[1]);
		ТекущаяДатаПроведения = Дата(МасДанные[2]);
	КонецЕсли;
	// Проверим на ошибку
	Если ФоновоеЗадание.Состояние <> СостояниеФоновогоЗадания.Активно и ФоновоеЗадание.Состояние <> СостояниеФоновогоЗадания.Завершено Тогда
		Сообщить(ФоновоеЗадание.ИнформацияОбОшибке.Описание);			
	КонецЕсли; 
	Возврат ФоновоеЗадание.Состояние <> СостояниеФоновогоЗадания.Активно;
КонецФункции

&НаКлиенте
Процедура ЗаблокироватьФорму(Заблокировать)
	ЭтаФорма.Доступность = Не Заблокировать;
	Элементы.ФормаВыполнитьПерепроведение.Доступность = Не Заблокировать;
КонецПроцедуры	

&НаСервере
Процедура ПровестиДокументы()
	МасПараметры = Новый Массив;
	МасПараметры.Добавить(Объект.ТЧПоследовательность.Выгрузить());
	ФоновоеЗадание = ФоновыеЗадания.Выполнить("ПроцедурыРегламентныхЗаданий.ПерепроведениеДокументов", МасПараметры);
	ИдентификаторФоновогоЗадания = ФоновоеЗадание.УникальныйИдентификатор;
КонецПроцедуры

#КонецОбласти
