
#Область Формирование_движений

Процедура СформироватьДвижения(ДокОбъект) Экспорт
	Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.НалоговаяНакладнаяПокупка") Тогда
		ТипОперации = Перечисления.ВидыОперацийНалоговые.Накладная;
		Описание = "" + ТипОперации + " " + ДокОбъект.НомерВходящегоДокумента;
		Движение(ДокОбъект.Движения, ДокОбъект.Дата, ДокОбъект.Организация, ДокОбъект.Контрагент, ТипОперации, Описание, ДокОбъект.Сумма, Истина, ДокОбъект.Ссылка);
		РучнаяКорректировка = ДокОбъект.РучнаяКорректировка И Не ДокОбъект.ТЧСпособыОплаты.Количество() = 0;
		Если РучнаяКорректировка Тогда
			ТЗОплат = ДокОбъект.ТЧСпособыОплаты.Выгрузить();
		Иначе
			ТЗОплат = РегистрыНакопления.ДенежныеСредстваОрганизаций.ПолучитьОплаты(ДокОбъект,Истина);
		КонецЕсли;
		Для Каждого СтрОплат из ТЗОплат Цикл 
			Если СтрОплат.ТипДенежныхСредств = Справочники.TypesDePayment.Cheque Тогда 
				ТипОперации = Перечисления.ВидыОперацийНалоговые.Чек;
				Чек = ?(РучнаяКорректировка, СтрОплат.Чек, СтрОплат.Регистратор.Чек);
				Описание = "" + ТипОперации + " №" + Чек.Наименование + ", " + Чек.Банк +  " de " + Формат(Чек.ДатаЧека,"ДЛФ=D");
			ИначеЕсли СтрОплат.ТипДенежныхСредств = Справочники.TypesDePayment.Cash Тогда 
				ТипОперации = Перечисления.ВидыОперацийНалоговые.Наличные;
				Описание = "" + ТипОперации;
			Иначе 
				ТипОперации = Перечисления.ВидыОперацийНалоговые.БанковскийПеревод;
				Описание = "" + ТипОперации;
			КонецЕсли;
			ТипДвижения = ?(РучнаяКорректировка, Перечисления.ТипыДвиженияДенежныхСредств.Поступление,СтрОплат.ТипДвижения);
			Приход = ?(ТипДвижения = Перечисления.ТипыДвиженияДенежныхСредств.Поступление, Истина, Ложь);
			ДокРегистратор = ?(РучнаяКорректировка, ДокОбъект.Ссылка, СтрОплат.Регистратор);
			Движение(ДокОбъект.Движения, СтрОплат.Период, ДокОбъект.Организация, ДокОбъект.Контрагент, ТипОперации, Описание, СтрОплат.Сумма,Приход, ДокРегистратор);
			//КонецЕсли;
		КонецЦикла;
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ВозвратПоставщикуНалоговый") Тогда
		ТипОперации = Перечисления.ВидыОперацийНалоговые.Возврат;
		Описание = "" + ТипОперации + " " + ДокОбъект.Номер;
		Движение(ДокОбъект.Движения, ДокОбъект.Дата, ДокОбъект.Организация, ДокОбъект.Контрагент, ТипОперации, Описание, ДокОбъект.Сумма, Ложь, ДокОбъект.Ссылка);
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПриходныйКассовыйОрдер")
		Или ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.РасходныйКассовыйОрдер")
		Или ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПоступлениеБезналичныхДенежныхСредств")
		Или ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.СписаниеБезналичныхДенежныхСредств") Тогда
		Если Не ДокОбъект.Организация.ОсновнойУчет Тогда Возврат; КонецЕсли;
		Если РаботаСДокументамиКлиентСервер.ЕстьРеквизит(ДокОбъект,"ХозяйственнаяОперация") Тогда 
			Если Не ОбщегоНазначенияВызовСервераПовтИсп.ЭтоРасчётыСПоставщиками(ДокОбъект.ХозяйственнаяОперация) Тогда Возврат КонецЕсли;
		КонецЕсли;
		СуммаОплаты = ДокОбъект.Сумма;
		Если ДокОбъект.ТипОплаты = Справочники.TypesDePayment.Cheque Тогда 
			ТипОперации = Перечисления.ВидыОперацийНалоговые.Чек;
			Чек = ДокОбъект.Чек;
			Описание = "" + ТипОперации + " №" + Чек.Наименование + ", " + Чек.Банк +  " de " + Формат(Чек.ДатаЧека,"ДЛФ=D");
		ИначеЕсли ДокОбъект.ТипОплаты = Справочники.TypesDePayment.Cash Тогда 
			ТипОперации = Перечисления.ВидыОперацийНалоговые.Наличные;
			Описание = "" + ТипОперации;
		Иначе 
			ТипОперации = Перечисления.ВидыОперацийНалоговые.БанковскийПеревод;
			Описание = "" + ТипОперации;
		КонецЕсли;
		Приход = ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПриходныйКассовыйОрдер");
		Для Каждого Стр Из ДокОбъект.ТЧОснования Цикл
			//Если Не ЗначениеЗаполнено(Стр.Основание) Тогда 
				СуммаОплаты = СуммаОплаты - Стр.Сумма;
			//КонецЕсли;
		КонецЦикла;
		Движение(ДокОбъект.Движения, ДокОбъект.Дата, ДокОбъект.Организация, ДокОбъект.Контрагент, ТипОперации, Описание, СуммаОплаты, Приход, ДокОбъект.Ссылка);
	КонецЕсли;
КонецПроцедуры

Процедура Движение(Движения, ДатаДвижения, Организация, Контрагент, ТипОперации, Описание, Сумма, Приход = Истина, ДокументДвижения)
	Если Сумма = 0 Тогда Возврат КонецЕсли;
	НС = Движения.ВзаиморасчётыСПоcтавщикамиНалоговый.Добавить();
	НС.ВидДвижения = ?(Приход, ВидДвиженияНакопления.Приход, ВидДвиженияНакопления.Расход);
	НС.Период = ДатаДвижения;
	НС.Организация = Организация;
	НС.Контрагент = Контрагент;
	НС.ВидОперации = ТипОперации;
	НС.Описание = Описание;
	НС.ДокументДвижения = ДокументДвижения;
	НС.ОбъектРасчётов = ДокументДвижения;
	НС.Сумма = Сумма;	
КонецПроцедуры

#КонецОбласти
