
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	БухгалтерскиеОтчетыВызовСервера.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ОбновитьТекстЗаголовка(ЭтаФорма);
	
	БухгалтерскиеОтчетыКлиент.ПриОткрытии(ЭтаФорма, Отказ);

	ЗаполнитьРеквизитыОбъектаИзНастроек();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

	БухгалтерскиеОтчетыКлиент.ПередЗакрытием(ЭтаФорма, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка, Отчет.РежимРасшифровки);

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)

	БухгалтерскиеОтчетыКлиент.ПриЗакрытии(ЭтаФорма, ЗавершениеРаботы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
КонецПроцедуры


&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)

	//БухгалтерскиеОтчетыВызовСервера.ПриСохраненииПользовательскихНастроекНаСервере(ЭтаФорма, Настройки);

КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки, ИспользуютсяСтандартныеНастройки)
	
	Если ИспользуютсяСтандартныеНастройки Тогда
		Возврат;
	КонецЕсли;

	Если Не КомпоновщикИнициализирован Тогда
		ПользовательскиеНастройки = ПоместитьВоВременноеХранилище(Настройки, УникальныйИдентификатор);
	КонецЕсли;
	
	БухгалтерскиеОтчетыВызовСервера.ПриЗагрузкеПользовательскихНастроекНаСервере(ЭтаФорма, Настройки);
	
	ОбновитьТекстЗаголовка(ЭтаФорма);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
    ЗаполнитьРеквизитыОбъектаИзНастроек();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#Область Организация

&НаКлиенте
Процедура ПолеОрганизацияПриИзменении(Элемент)
	
	ОбновитьТекстЗаголовка(ЭтаФорма);
	
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	
	БухгалтерскиеОтчетыКлиент.ОрганизацияПриИзменении(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	БухгалтерскиеОтчетыКлиент.ПолеОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка, 
		СоответствиеОрганизаций, Отчет.Организация, Отчет.ВключатьОбособленныеПодразделения);
	
КонецПроцедуры

#КонецОбласти

#Область Результат

&НаКлиенте
Процедура РезультатПриАктивизации(Элемент)
	
	ПодключитьОбработчикОжидания("РассчитатьПоказателиДинамически", 0.2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)

	БухгалтерскиеОтчетыКлиент.ОбработкаРасшифровкиСтандартногоОтчета(ЭтаФорма, Элемент, Расшифровка, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаДополнительнойРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)

	// Не будем обрабатывать нажатие на правую кнопку мыши.
	// Покажем стандартное контекстное меню ячейки табличного документа.
	Расшифровка = Неопределено;

КонецПроцедуры

&НаКлиенте
Процедура РезультатПриИзменении(Элемент)
	
	РучнаяКорректировка = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПосчитатьСуммуВыделенных(Команда)
	РассчитатьПоказателиДинамически();
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	Перем ОтказПроверкиЗаполнения;

	ОчиститьСообщения();
	
	РезультатВыполнения = СформироватьОтчетНаСервере();
	РезультатВыполнения.Свойство("ОтказПроверкиЗаполнения", ОтказПроверкиЗаполнения);
	Если Не РезультатВыполнения.ЗаданиеВыполнено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "ФормированиеОтчета");
	КонецЕсли;
	
	РучнаяКорректировка = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыОбъектаИзНастроек()
	ПараметрПериод = Новый ПараметрКомпоновкиДанных("Период");
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Новый ПараметрКомпоновкиДанных("Организация"));	
	МассивПараметров.Добавить(Новый ПараметрКомпоновкиДанных("ПоСубсчетам"));	
	МассивПараметров.Добавить(Новый ПараметрКомпоновкиДанных("ВыводитьЗабалансовыеСчета"));	
	Отчет.Группировка.Очистить();
	Для Каждого ЭлементНастройки из Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл 
		Если ТипЗнч(ЭлементНастройки) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") И ЭлементНастройки.Параметр = ПараметрПериод Тогда
			Отчет.НачалоПериода = ЭлементНастройки.Значение.ДатаНачала;
			Отчет.КонецПериода = ЭлементНастройки.Значение.ДатаОкончания;
		КонецЕсли; 
		Если ТипЗнч(ЭлементНастройки) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") И Не МассивПараметров.Найти(ЭлементНастройки.Параметр) = Неопределено Тогда
			Отчет[СокрЛП(ЭлементНастройки.Параметр)] = ?(ЭлементНастройки.Использование,ЭлементНастройки.Значение,Неопределено);
		КонецЕсли;
	КонецЦикла;
	
	ОбновитьТекстЗаголовка(ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстЗаголовка(Форма)

	Отчет = Форма.Отчет;

	ЗаголовокОтчета = ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("fr = 'Balance générale%1'; ru = 'Оборотно-сальдовая ведомость%1'; en = 'Balance sheet %1'; es = 'Saldo de ventas%1'"),
		БухгалтерскиеОтчетыКлиентСервер.ПолучитьПредставлениеПериода(Отчет.НачалоПериода, Отчет.КонецПериода));

	Если ЗначениеЗаполнено(Отчет.Организация) Тогда
		ЗаголовокОтчета = ЗаголовокОтчета + " " + Отчет.Организация;
	КонецЕсли;

	Форма.Заголовок = ЗаголовокОтчета;

КонецПроцедуры

&НаКлиенте
Функция ПолучитьЗапрещенныеПоля(Режим = "") Экспорт

	СписокПолей = Новый Массив;

	СписокПолей.Добавить("UserFields");
	СписокПолей.Добавить("DataParameters");
	СписокПолей.Добавить("SystemFields");
	СписокПолей.Добавить("Показатели");
	СписокПолей.Добавить("Период");

	Если Режим = "Выбор" Тогда
		Для Каждого ДоступноеПоле Из Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.Элементы Цикл
			Если ДоступноеПоле.Ресурс Тогда
				СписокПолей.Добавить(Строка(ДоступноеПоле.Поле));
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Если Режим = "Выбор" Тогда
		СписокПолей.Добавить("СальдоНаНачалоПериода");
		СписокПолей.Добавить("ОборотыЗаПериод");
		СписокПолей.Добавить("СальдоНаКонецПериода");
	ИначеЕсли Режим = "Отбор" Тогда
		БухгалтерскиеОтчетыКлиент.ДобавитьПоляРесурсовВЗапрещенныеПоля(ЭтаФорма, СписокПолей);
	КонецЕсли;

	Возврат Новый ФиксированныйМассив(СписокПолей);

КонецФункции

&НаСервере
Функция СформироватьОтчетНаСервере() Экспорт
	
	РезультатВыполнения = Новый Структура;
	РезультатВыполнения.Вставить("ЗаданиеВыполнено", Истина);
	РезультатВыполнения.Вставить("ОтказПроверкиЗаполнения", Ложь);
	
	Если Не ПроверитьЗаполнение() Тогда
		
		РезультатВыполнения.ОтказПроверкиЗаполнения = Истина;
		Возврат РезультатВыполнения;
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеИспользовать");
	
	Если Не КомпоновщикИнициализирован Тогда
		ИнициализацияКомпоновщикаНастроек();
	КонецЕсли;
	
	Настройки = Отчет.КомпоновщикНастроек.Настройки;
	Настройки.Отбор.ИдентификаторПользовательскойНастройки              = "";
	Настройки.Порядок.ИдентификаторПользовательскойНастройки            = "";
	Настройки.УсловноеОформление.ИдентификаторПользовательскойНастройки = "";
	
	ПараметрыОтчета = Отчеты.ОборотноСальдоваяВедомость.ПустыеПараметрыКомпоновкиОтчета();
	Отчеты.ОборотноСальдоваяВедомость.ЗаполнитьПараметрыИзФормы(ПараметрыОтчета, ЭтотОбъект);
	
	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	БухгалтерскиеОтчетыВызовСервера.СформироватьОтчет(ПараметрыОтчета, АдресХранилища);
		
	ЗагрузитьПодготовленныеДанные();
	
	Возврат РезультатВыполнения;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьНастройкамиПоУмолчанию(ЗаполняемыеНастройки) Экспорт
	
	Перем ЗаполнятьКоллекцию;
	
	Если ЗаполняемыеНастройки.Свойство("Показатели", ЗаполнятьКоллекцию) И ЗаполнятьКоллекцию Тогда
		// Управление показателями.
		Отчет.ПоказательБУ            = Истина;
		Отчет.ПоказательВалютнаяСумма = Ложь;
		БухгалтерскиеОтчетыПереопределяемый.ДополнительноеУправлениеПоказателями(Отчет);

	КонецЕсли;
	
	Если ЗаполняемыеНастройки.Свойство("Группировка", ЗаполнятьКоллекцию) И ЗаполнятьКоллекцию Тогда
		
		Отчет.ПоСубсчетам = Ложь;
		
		Отчет.Группировка.Очистить();
		
		// Сч 51 по банковским счетам.
		ЗаполнитьСтрокуНастроек(Отчет.Группировка.Добавить(),
								БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ПланыСчетов.Хозрасчетный.РасчетныеСчета),
								Ложь,
								Новый Структура("Субконто1, Субконто2, Субконто3", Истина, Ложь, Ложь));
		// Сч 68 по субсчетам.
		ЗаполнитьСтрокуНастроек(Отчет.Группировка.Добавить(),
								БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ПланыСчетов.Хозрасчетный.РасчетыПоНалогам));
		
		// Сч 76 по субсчетам.
		ЗаполнитьСтрокуНастроек(Отчет.Группировка.Добавить(),
								БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ПланыСчетов.Хозрасчетный.РасчетыСРазнымиДебиторамиИКредиторами));
		
		// Сч 90 по субсчетам.
		ЗаполнитьСтрокуНастроек(Отчет.Группировка.Добавить(),
								БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ПланыСчетов.Хозрасчетный.Продажи));
		
		// Сч 91 по субсчетам.
		ЗаполнитьСтрокуНастроек(Отчет.Группировка.Добавить(),
								БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ПланыСчетов.Хозрасчетный.ПрочиеДоходыИРасходы));
		
		
		// Сч 91.01 по субконто "Прочие доходы и расходы".
		ЗаполнитьСтрокуНастроек(Отчет.Группировка.Добавить(),
								БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ПланыСчетов.Хозрасчетный.ПрочиеДоходы),
								Ложь,
								Новый Структура("Субконто1, Субконто2, Субконто3", Истина, Ложь, Ложь));
		
		// Сч 91.02 по субконто "Прочие доходы и расходы".
		ЗаполнитьСтрокуНастроек(Отчет.Группировка.Добавить(),
								БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ПланыСчетов.Хозрасчетный.ПрочиеРасходы),
								Ложь,
								Новый Структура("Субконто1, Субконто2, Субконто3", Истина, Ложь, Ложь));
		
		// Сч 99 по субсчетам.
		ЗаполнитьСтрокуНастроек(Отчет.Группировка.Добавить(),
							БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ПланыСчетов.Хозрасчетный.ПрибылиИУбытки));
		
	КонецЕсли;
	
	Если ЗаполняемыеНастройки.Свойство("РазвернутоеСальдо", ЗаполнятьКоллекцию) И ЗаполнятьКоллекцию Тогда
		
		Отчет.РазвернутоеСальдо.Очистить();
		
		// Сч 60 по субконто "Контрагенты и договоры".
		
		ЗаполнитьСтрокуНастроек(Отчет.РазвернутоеСальдо.Добавить(),
								БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ПланыСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками),
								Ложь,
								Новый Структура("Субконто1, Субконто2, Субконто3", Истина, Истина, Ложь));
		
		// Сч 62 по субконто "Контрагенты и договоры".
		ЗаполнитьСтрокуНастроек(Отчет.РазвернутоеСальдо.Добавить(),
								БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ПланыСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками),
								Ложь,
								Новый Структура("Субконто1, Субконто2, Субконто3", Истина, Истина, Ложь));
		
		// Сч 68 по субконто "Виды платежей в бюджет (фонды)".
		ЗаполнитьСтрокуНастроек(Отчет.РазвернутоеСальдо.Добавить(),
								БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ПланыСчетов.Хозрасчетный.РасчетыПоНалогам),
								Истина,
								Новый Структура("Субконто1, Субконто2, Субконто3", Истина, Ложь, Ложь));
		
		// Сч 68.04.1 по субконто "Виды платежей в бюджет (фонды), Уровни бюджетов".
		ЗаполнитьСтрокуНастроек(Отчет.РазвернутоеСальдо.Добавить(),
								БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ПланыСчетов.Хозрасчетный.РасчетыСБюджетом),
								Ложь,
								Новый Структура("Субконто1, Субконто2, Субконто3", Истина, Истина, Ложь));
		
		// Сч 68.10 по субконто "Виды платежей в бюджет (фонды), Уровни бюджетов".
		ЗаполнитьСтрокуНастроек(Отчет.РазвернутоеСальдо.Добавить(),
								БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ПланыСчетов.Хозрасчетный.ПрочиеНалогиИСборы),
								Ложь,
								Новый Структура("Субконто1, Субконто2, Субконто3", Истина, Истина, Ложь));
		
		// Сч 69 по субконто "Виды платежей в бюджет (фонды)".
		ЗаполнитьСтрокуНастроек(Отчет.РазвернутоеСальдо.Добавить(),
								БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ПланыСчетов.Хозрасчетный.РасчетыПоСоциальномуСтрахованию),
								Ложь,
								Новый Структура("Субконто1, Субконто2, Субконто3", Истина, Ложь, Ложь));
		
		// Сч 71 по субконто "Работники организаций".
		ЗаполнитьСтрокуНастроек(Отчет.РазвернутоеСальдо.Добавить(),
								БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ПланыСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицами_),
								Ложь,
								Новый Структура("Субконто1, Субконто2, Субконто3", Истина, Ложь, Ложь));
		
		// Сч 73.03 по субконто "Работники организаций".
		ЗаполнитьСтрокуНастроек(Отчет.РазвернутоеСальдо.Добавить(),
								БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ПланыСчетов.Хозрасчетный.РасчетыПоПрочимОперациям),
								Ложь,
								Новый Структура("Субконто1, Субконто2, Субконто3", Истина, Ложь, Ложь));
		
		// Сч 76 по субконто "Контрагенты и договоры".
		ЗаполнитьСтрокуНастроек(Отчет.РазвернутоеСальдо.Добавить(),
								БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ПланыСчетов.Хозрасчетный.РасчетыСРазнымиДебиторамиИКредиторами),
								Ложь,
								Новый Структура("Субконто1, Субконто2, Субконто3", Истина, Истина, Ложь));
		
		// Сч 76.01.1 по субконто "Контрагенты".
		ЗаполнитьСтрокуНастроек(Отчет.РазвернутоеСальдо.Добавить(),
								БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ПланыСчетов.Хозрасчетный.РасчетыПоИмущественномуИЛичномуСтрахованию),
								Ложь,
								Новый Структура("Субконто1, Субконто2, Субконто3", Истина, Ложь, Ложь));
		
		// Сч 76.01.2 по субконто "Контрагенты".
		ЗаполнитьСтрокуНастроек(Отчет.РазвернутоеСальдо.Добавить(),
								БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ПланыСчетов.Хозрасчетный.ПлатежиПоДобровольномуСтрахованиюРаботников),
								Ложь,
								Новый Структура("Субконто1, Субконто2, Субконто3", Истина, Ложь, Ложь));
		
		// Сч 76.01.9 по субконто "Контрагенты".
		ЗаполнитьСтрокуНастроек(Отчет.РазвернутоеСальдо.Добавить(),
								БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ПланыСчетов.Хозрасчетный.ПлатежиПоПрочимВидамСтрахования),
								Ложь,
								Новый Структура("Субконто1, Субконто2, Субконто3", Истина, Ложь, Ложь));
		
		// Сч 76.03 по субконто "Контрагенты и договоры".
		ЗаполнитьСтрокуНастроек(Отчет.РазвернутоеСальдо.Добавить(),
								БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ПланыСчетов.Хозрасчетный.РасчетыПоПричитающимсяДивидендам),
								Ложь,
								Новый Структура("Субконто1, Субконто2, Субконто3", Истина, Истина, Ложь));
		
		// Сч 76.05 по субконто "Контрагенты и договоры".
		ЗаполнитьСтрокуНастроек(Отчет.РазвернутоеСальдо.Добавить(),
								БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПоставщикамиИПодрядчиками),
								Ложь,
								Новый Структура("Субконто1, Субконто2, Субконто3", Истина, Истина, Ложь));
		
		// Сч 76.06 по субконто "Контрагенты и договоры".
		ЗаполнитьСтрокуНастроек(Отчет.РазвернутоеСальдо.Добавить(),
								БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПоставщикамиИПодрядчиками),
								Ложь,
								Новый Структура("Субконто1, Субконто2, Субконто3", Истина, Истина, Ложь));
		
		// Сч 76.09 по субконто "Контрагенты и договоры".
		ЗаполнитьСтрокуНастроек(Отчет.РазвернутоеСальдо.Добавить(),
								БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами),
								Ложь,
								Новый Структура("Субконто1, Субконто2, Субконто3", Истина, Истина, Ложь));
		
		// Сч 76.21 по субконто "Контрагенты и договоры".
		ЗаполнитьСтрокуНастроек(Отчет.РазвернутоеСальдо.Добавить(),
								БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ПланыСчетов.Хозрасчетный.РасчетыПоИмущественномуИЛичномуСтрахованиюВал),
								Ложь,
								Новый Структура("Субконто1, Субконто2, Субконто3", Истина, Истина, Ложь));
		
		// Сч 76.25 по субконто "Контрагенты и договоры".
		ЗаполнитьСтрокуНастроек(Отчет.РазвернутоеСальдо.Добавить(),
								БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПоставщикамиИПодрядчикамиВал),
								Ложь,
								Новый Структура("Субконто1, Субконто2, Субконто3", Истина, Истина, Ложь));
		
		// Сч 76.26 по субконто "Контрагенты и договоры".
		ЗаполнитьСтрокуНастроек(Отчет.РазвернутоеСальдо.Добавить(),
								БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПокупателямиИЗаказчикамиВал),
								Ложь,
								Новый Структура("Субконто1, Субконто2, Субконто3", Истина, Истина, Ложь));
		
		// Сч 76.29 по субконто "Контрагенты и договоры".
		ЗаполнитьСтрокуНастроек(Отчет.РазвернутоеСальдо.Добавить(),
								БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторамиВал),
								Ложь,
								Новый Структура("Субконто1, Субконто2, Субконто3", Истина, Истина, Ложь));
		
		// Сч 76.35 по субконто "Контрагенты и договоры".
		ЗаполнитьСтрокуНастроек(Отчет.РазвернутоеСальдо.Добавить(),
								БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПоставщикамиИПодрядчикамиУЕ),
								Ложь,
								Новый Структура("Субконто1, Субконто2, Субконто3", Истина, Истина, Ложь));
		
		// Сч 76.36 по субконто "Контрагенты и договоры".
		ЗаполнитьСтрокуНастроек(Отчет.РазвернутоеСальдо.Добавить(),
								БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПокупателямиИЗаказчикамиУЕ),
								Ложь,
								Новый Структура("Субконто1, Субконто2, Субконто3", Истина, Истина, Ложь));
		
		// Сч 76.39 по субконто "Контрагенты и договоры".
		ЗаполнитьСтрокуНастроек(Отчет.РазвернутоеСальдо.Добавить(),
								БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторамиУЕ),
								Ложь,
								Новый Структура("Субконто1, Субконто2, Субконто3", Истина, Истина, Ложь));
		
		// Сч 76.41 по субконто "Контрагенты".
		ЗаполнитьСтрокуНастроек(Отчет.РазвернутоеСальдо.Добавить(),
								БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ПланыСчетов.Хозрасчетный.РасчетыПоИсполнительнымДокументамРаботников),
								Ложь,
								Новый Структура("Субконто1, Субконто2, Субконто3", Истина, Ложь, Ложь));
		
		// Сч 76.49 по субконто "Контрагенты".
		ЗаполнитьСтрокуНастроек(Отчет.РазвернутоеСальдо.Добавить(),
								БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ПланыСчетов.Хозрасчетный.РасчетыПоПрочимУдержаниямРаботников),
								Ложь,
								Новый Структура("Субконто1, Субконто2, Субконто3", Истина, Ложь, Ложь));
		
		// Сч 76.К по субконто "Контрагенты".
		ЗаполнитьСтрокуНастроек(Отчет.РазвернутоеСальдо.Добавить(),
								БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ПланыСчетов.Хозрасчетный.КорректировкаРасчетовПрошлогоПериода),
								Ложь,
								Новый Структура("Субконто1, Субконто2, Субконто3", Истина, Истина, Ложь));
	КонецЕсли;
	
	Если ЗаполняемыеНастройки.Свойство("Отбор", ЗаполнятьКоллекцию) И ЗаполнятьКоллекцию Тогда
		
		Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
		Отчет.ВыводитьЗабалансовыеСчета = Ложь;
		
	КонецЕсли;
	
	Если ЗаполняемыеНастройки.Свойство("УсловноеОформление") Тогда
		
		Схема = Отчеты.ОборотноСальдоваяВедомость.ПолучитьМакет("СхемаКомпоновкиДанных");
		Настройки = Схема.НастройкиПоУмолчанию;
		
		КомпоновкаДанныхКлиентСервер.СкопироватьЭлементы(Отчет.КомпоновщикНастроек.Настройки.УсловноеОформление, Настройки.УсловноеОформление);
		
	КонецЕсли;
	
	Если ЗаполняемыеНастройки.Свойство("ДополнительныеПоля", ЗаполнятьКоллекцию) И ЗаполнятьКоллекцию Тогда
		
		Отчет.ДополнительныеПоля.Очистить();
		НоваяСтрока = Отчет.ДополнительныеПоля.Добавить();
		НоваяСтрока.Представление = НСтр("fr = 'Afficher le nom du compte'; ru = 'Выводить наименование счета'; en = 'Output the account name'; es = 'Mostrar el nombre de la cuenta'");
		НоваяСтрока.Поле          = "Счет.Наименование";
		НоваяСтрока.Использование = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПодготовленныеДанные()

	РезультатВыполнения = ПолучитьИзВременногоХранилища(АдресХранилища);
	
	Результат = РезультатВыполнения.Результат;	

	ДанныеРасшифровки = РезультатВыполнения.ДанныеРасшифровки;

	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеИспользовать");
	
	ДополнительныеСвойства = Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства;
	
КонецПроцедуры

&НаСервере
Процедура ВычислитьСуммуВыделенныхЯчеекТабличногоДокументаВКонтекстеНаСервере()
	
	ПолеСумма = БухгалтерскиеОтчетыВызовСервера.ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(
		Результат, КэшВыделеннойОбласти);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РезультатПриАктивизацииПодключаемый()
	
	НеобходимоВычислятьНаСервере = Ложь;
	БухгалтерскиеОтчетыКлиент.ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(
		ПолеСумма, Результат, Элементы.Результат, КэшВыделеннойОбласти, НеобходимоВычислятьНаСервере);
	
	Если НеобходимоВычислятьНаСервере Тогда
		ВычислитьСуммуВыделенныхЯчеекТабличногоДокументаВКонтекстеНаСервере();
	КонецЕсли;
	
	ОтключитьОбработчикОжидания("Подключаемый_РезультатПриАктивизацииПодключаемый");
	
КонецПроцедуры

&НаСервере
Процедура ИнициализацияКомпоновщикаНастроек()
	
	БухгалтерскиеОтчетыВызовСервера.ИнициализацияКомпоновщикаНастроек(ЭтаФорма, Истина);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьСтрокуНастроек(СтрокаНастроек, ДанныеСчета, ПоСубсчетам = Истина, ПоСубконто = Неопределено)

	СтрокаПоСубконто = "";
	СтрокаПредставление = "";
	
	Если ПоСубконто <> Неопределено Тогда
		Для НомерСубконто = 1 По 3 Цикл
			
			Если ДанныеСчета["ВидСубконто" + НомерСубконто] = Неопределено Тогда
				
				Прервать;
				
			ИначеЕсли ПоСубконто["Субконто" + НомерСубконто] Тогда
				
				СтрокаПоСубконто = СтрокаПоСубконто + "+" + НомерСубконто;
				СтрокаПредставление = СтрокаПредставление + ДанныеСчета["ВидСубконто" + НомерСубконто + "Наименование"] + ", ";
			Иначе
				
				СтрокаПоСубконто = СтрокаПоСубконто + "-" + НомерСубконто;
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	СтрокаНастроек.Использование 	= Истина;
	СтрокаНастроек.Счет 			= ДанныеСчета.Ссылка;
	СтрокаНастроек.ПоСубсчетам 		= ПоСубсчетам;
	СтрокаНастроек.Представление 	= Лев(СтрокаПредставление, СтрДлина(СтрокаПредставление) - 2);
	СтрокаНастроек.ПоСубконто 		= СтрокаПоСубконто;
	
КонецПроцедуры

&НаСервере
Функция ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента() Экспорт
	Сумма = 0;
	//Для Каждого Область Из Результат.ВыделенныеОбласти Цикл
	//	Если ТипЗнч(Область) = Тип("ОбластьЯчеекТабличногоДокумента") Тогда
	//		Для ИндексСтрока = Область.Верх По Область.Низ Цикл
	//			Для ИндексКолонка = Область.Лево По Область.Право Цикл
	//				Попытка
	//					Сумма = Сумма + Число(СтрЗаменить(Результат.Область("R" + Формат(ИндексСтрока, "ЧГ=0") + "C" + Формат(ИндексКолонка, "ЧГ=0")) .Текст, " ", ""));
	//				Исключение
	//				КонецПопытки;
	//			КонецЦикла;
	//		КонецЦикла;
	//	КонецЕсли;
	//КонецЦикла;
	Возврат Сумма;
КонецФункции 

&НаКлиенте
Процедура РассчитатьПоказателиДинамически()
	ТекущаяКоманда = ""; //сумма, среднее, макс,мин...
	ОбщегоНазначенияКлиентСервер.РассчитатьПоказатели(ЭтотОбъект, "Результат","ФормаПосчитатьСуммуВыделенных", ТекущаяКоманда, 2);
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекПользовательскиеНастройкиПриИзменении(Элемент)
	ЗаполнитьРеквизитыОбъектаИзНастроек();
	//ИзменениеСхемыКомпоновкиДанныхНаСервере();
КонецПроцедуры

#КонецОбласти