
#Область Интерфейс

Функция РеквизитыПредпринимателяПоИНН(Знач ИНН) Экспорт
	Результат = НовыеРеквизитыПредпринимателя();
	//Результат.ИНН = ИНН;
	//Если Не ЗначениеЗаполнено(ИНН) Тогда
	//	Результат.ОписаниеОшибки = "Не указан ИНН предпринимателя.";
	//	Возврат Результат;
	//КонецЕсли;
	//ИдентификаторУслуги = ИдентификаторУслугиЗаполнениеРеквизитовКонтрагентов();
	//URLОперации = URLRESTОперацииFindPersonByInn(ИНН);
	//РезультатВызова = ПроверитьУслугуИВызватьОперациюRESTСервиса(ИдентификаторУслуги, URLОперации, "Контрагент", "ИНН предпринимателя должен состоять из 12 цифр.");
	//ЗаполнитьЗначенияСвойств(Результат, РезультатВызова, "ОписаниеОшибки");
	//Если ЗначениеЗаполнено(Результат.ОписаниеОшибки) Тогда
	//	Возврат Результат;
	//КонецЕсли;
	//ТелоОтветаОбъект = РезультатВызова.ТелоОтветаОбъект;
	//Если ТелоОтветаОбъект.Получить("inn") = Неопределено Тогда
	//	Результат.ОписаниеОшибки = "Нет данных для ИНН " + ИНН;
	//КонецЕсли;
	//ЗаполнитьОсновныеРеквизитыПредпринимателя(ТелоОтветаОбъект, Результат);
	//ЗаполнитьКодОКВЭД(ТелоОтветаОбъект, Результат);
	Возврат Результат;
КонецФункции

Функция РеквизитыЮридическогоЛицаПоИНН(Знач ИНН) Экспорт
	Результат = НовыеРеквизитыЮридическогоЛица();
	//Результат.ИНН = ИНН;
	//ОписаниеОшибки = "";
	//ПараметрыСервиса = ПараметрыСервисаЮридическиеЛица(); 
	//ОбъектXDTO = Неопределено;
	//Прокси = ПроксиСервиса(ПараметрыСервиса.URL, ПараметрыСервиса.URIПространстваИмен, ПараметрыСервиса.Имя, ПараметрыСервиса.ИмяТочкиПодключения, ОписаниеОшибки);		
	//ВходныеПараметры = Прокси.ФабрикаXDTO.Создать(Прокси.ФабрикаXDTO.Тип(ПараметрыСервиса.URIПространстваИмен, "findCorporationByInn"));
	//ВходныеПараметры.inn = ИНН;
	//ВходныеПараметры.additionalParameters = ДополнительныеПараметрыВызоваОперацииСервиса(Прокси.ФабрикаXDTO, "http://company1c.com/orgregister/base");
	//Попытка 
	//	Ответ = Прокси.findCorporationByInn(ВходныеПараметры); 
	//	ОбъектXDTO = Ответ.РеквизитыЮрЛица;
	//Исключение
	//	ИнформацияОбОшибке = ИнформацияОбОшибке();
	//	Результат.ОписаниеОшибки = "ИНН " + ИНН + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
	//	Возврат Результат;
	//КонецПопытки;
	//Если ОбъектXDTO = Неопределено Тогда
	//	Результат.ОписаниеОшибки = "Нет данных для ИНН " + СокрЛП(ИНН);	
	//Иначе	
	//	ЗаполнитьНаименованияЮридическогоЛицаXDTO(ОбъектXDTO, Результат);
	//	Результат.РегистрационныйНомер = ОбъектXDTO.ОГРН;
	//	Результат.КПП = ОбъектXDTO.КПП;
	//	Результат.ДатаРегистрации = ОбъектXDTO.СвНаимЮЛ.ДатаОбрЮЛ; 
	//	ЗаполнитьКодОКВЭДXDTO(ОбъектXDTO, Результат);
	//	АдресныеСокращения = Неопределено;
	//	ЗаполнитьЮридическийАдресXDTO(ОбъектXDTO, Результат, Прокси.ФабрикаXDTO, АдресныеСокращения);
	//КонецЕсли;
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область ОписанияРеквизитов

Функция НовыеРеквизитыЮридическогоЛица()
	Результат = Новый Структура;
	// Заполняется на основе данных ЕГРЮЛ.
	Результат.Вставить("NIF");
	Результат.Вставить("RC");
	Результат.Вставить("Наименование");
	Результат.Вставить("НаименованиеПолное");
	Результат.Вставить("НаименованиеСокращенное");
	Результат.Вставить("РегистрационныйНомер");
	Результат.Вставить("Статус");
	Результат.Вставить("РегистрирующийОрган");
	// Следующие свойства могут содержать Неопределено в случае отсутствия в сервисе данных.
	Результат.Вставить("ПравоваяФорма");
	Результат.Вставить("ЮридическийАдрес");
	Результат.Вставить("Телефон");
	Результат.Вставить("Руководители", НоваяТаблицаРуководителей());
	Результат.Вставить("РегистрацияВНалоговомОргане");
	Результат.Вставить("ДатаРегистрации");
	Результат.Вставить("РегистрацияВПенсионномФонде");
	Результат.Вставить("РегистрацияВФСС");
	Результат.Вставить("ВидДеятельности");
	// Служебный реквизит
	Результат.Вставить("ОписаниеОшибки");
	// Устаревшие поля
	Результат.Вставить("КодОКВЭД");
	Результат.Вставить("ЭтоОКВЭД2", Ложь);
	Результат.Вставить("Руководитель");
	Возврат Результат;
КонецФункции

Функция НовыеРеквизитыПредпринимателя()
	Результат = Новый Структура;
	// Заполняется на основе данных ЕГРИП.
	Результат.Вставить("NIF");
	Результат.Вставить("Наименование");
	Результат.Вставить("НаименованиеПолное");
	Результат.Вставить("НаименованиеСокращенное");
	Результат.Вставить("ВидИП");
	Результат.Вставить("Фамилия");
	Результат.Вставить("Имя");
	Результат.Вставить("Отчество");
	Результат.Вставить("РегистрационныйНомер");
	// Следующие свойства могут содержать Неопределено в случае отсутствия в сервисе данных.
	Результат.Вставить("Пол");
	Результат.Вставить("КодСтраныГражданства");
	Результат.Вставить("РегистрацияВНалоговомОргане");
	Результат.Вставить("РегистрацияВПенсионномФонде");
	Результат.Вставить("РегистрацияВФСС");
	Результат.Вставить("ДатаРегистрации");
	Результат.Вставить("СвидетельствоОРегистрации");
	Результат.Вставить("ВидДеятельности");
	Результат.Вставить("Статус");
	Результат.Вставить("КодОКВЭД");
	Результат.Вставить("ЭтоОКВЭД2", Ложь);
	Результат.Вставить("ОписаниеОшибки");
	Возврат Результат;
КонецФункции

Функция НоваяТаблицаРуководителей()
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Должность", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Фамилия", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Имя", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Отчество", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("NIF", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ДатаЗаписи", Новый ОписаниеТипов("Дата"));
	Возврат Результат;
КонецФункции

Функция ПоляАдреса() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("ТипАдреса"                 , "");
	Результат.Вставить("Комментарий"               , "");
	
	Результат.Вставить("Представление"             , "");
	Результат.Вставить("МуниципальноеПредставление", "");
	
	Результат.Вставить("Страна"   , "");
	Результат.Вставить("КодСтраны", "");
	Результат.Вставить("Индекс"   , "");
	
	Результат.Вставить("КодРегиона"                               , "");
	Результат.Вставить("Регион"                                   , "");
	Результат.Вставить("РегионТипПолный"                          , "");
	Результат.Вставить("РегионТипКраткий"                         , "");
	
	Результат.Вставить("Район"                                    , "");
	Результат.Вставить("РайонТипПолный"                           , "");
	Результат.Вставить("РайонТипКраткий"                          , "");
	
	Результат.Вставить("МуниципальныйРайон"                       , "");
	Результат.Вставить("МуниципальныйРайонТипПолный"              , "");
	Результат.Вставить("МуниципальныйРайонТипКраткий"             , "");
	
	Результат.Вставить("Город"                                    , "");
	Результат.Вставить("ГородТипПолный"                           , "");
	Результат.Вставить("ГородТипКраткий"                          , "");
	
	Результат.Вставить("Поселение"                                , "");
	Результат.Вставить("ПоселениеТипПолный"                       , "");
	Результат.Вставить("ПоселениеТипКраткий"                      , "");
	
	Результат.Вставить("ВнутригородскойРайон"                     , "");
	Результат.Вставить("ВнутригородскойРайонТипПолный"            , "");
	Результат.Вставить("ВнутригородскойРайонТипКраткий"           , "");
	
	Результат.Вставить("НаселенныйПункт"                          , "");
	Результат.Вставить("НаселенныйПунктТипПолный"                 , "");
	Результат.Вставить("НаселенныйПунктТипКраткий"                , "");
	
	Результат.Вставить("Территория"                               , "");
	Результат.Вставить("ТерриторияТипПолный"                      , "");
	Результат.Вставить("ТерриторияТипКраткий"                     , "");
	
	Результат.Вставить("Улица"                                    , "");
	Результат.Вставить("УлицаТипПолный"                           , "");
	Результат.Вставить("УлицаТипКраткий"                          , "");
	
	// устаревшие свойства
	Результат.Вставить("РегионСокращение"                         , "");
	Результат.Вставить("Округ"                                    , "");
	Результат.Вставить("ОкругСокращение"                          , "");
	Результат.Вставить("РайонСокращение"                          , "");
	Результат.Вставить("МуниципальныйРайонСокращение"             , "");
	Результат.Вставить("ГородСокращение"                          , "");
	Результат.Вставить("ПоселениеСокращение"                      , "");
	Результат.Вставить("ВнутригородскойРайонСокращение"           , "");
	Результат.Вставить("НаселенныйПунктСокращение"                , "");
	Результат.Вставить("ТерриторияСокращение"                     , "");
	Результат.Вставить("УлицаСокращение"                          , "");
	Результат.Вставить("ДополнительнаяТерритория"                 , "");
	Результат.Вставить("ДополнительнаяТерриторияСокращение"       , "");
	Результат.Вставить("ЭлементДополнительнойТерритории"          , "");
	Результат.Вставить("ЭлементДополнительнойТерриторииСокращение", "");
	
	Здание = Новый Структура;
	Здание.Вставить("ТипЗдания", "");
	Здание.Вставить("Номер"    , "");
	Результат.Вставить("Здание", Здание);
	
	Результат.Вставить("Корпуса"  , Новый Массив);
	Результат.Вставить("Помещения", Новый Массив);
	
	Результат.Вставить("ИдентификаторАдресногоОбъекта"  , Неопределено);
	Результат.Вставить("ИдентификаторДома"              , Неопределено);
	Результат.Вставить("НомерЗемельногоУчастка"         , Неопределено);
	Результат.Вставить("ИдентификаторЗемельногоУчастка" , Неопределено);
	
	Идентификаторы = Новый Структура;
	Идентификаторы.Вставить("РегионИдентификатор"              , Неопределено);
	Идентификаторы.Вставить("РайонИдентификатор"               , Неопределено);
	Идентификаторы.Вставить("МуниципальныйРайонИдентификатор"  , Неопределено);
	Идентификаторы.Вставить("ГородИдентификатор"               , Неопределено);
	Идентификаторы.Вставить("ПоселениеИдентификатор"           , Неопределено);
	Идентификаторы.Вставить("ВнутригородскойРайонИдентификатор", Неопределено);
	Идентификаторы.Вставить("НаселенныйПунктИдентификатор"     , Неопределено);
	Идентификаторы.Вставить("ТерриторияИдентификатор"          , Неопределено);
	Идентификаторы.Вставить("УлицаИдентификатор"               , Неопределено);
	Результат.Вставить("Идентификаторы", Идентификаторы);
	
	ДополнительныеКоды = Новый Структура;
	ДополнительныеКоды.Вставить("ОКТМО"           , "");
	ДополнительныеКоды.Вставить("ОКАТО"           , "");
	ДополнительныеКоды.Вставить("КодИФНСФЛ"       , "");
	ДополнительныеКоды.Вставить("КодИФНСЮЛ"       , "");
	ДополнительныеКоды.Вставить("КодУчасткаИФНСФЛ", "");
	ДополнительныеКоды.Вставить("КодУчасткаИФНСЮЛ", "");
	Результат.Вставить("ДополнительныеКоды", ДополнительныеКоды);
	
	КодыКЛАДР = Новый Структура;
	КодыКЛАДР.Вставить("Регион"         , "");
	КодыКЛАДР.Вставить("Район"          , "");
	КодыКЛАДР.Вставить("Город"          , "");
	КодыКЛАДР.Вставить("НаселенныйПункт", "");
	КодыКЛАДР.Вставить("Улица"          , "");
	Результат.Вставить("КодыКЛАДР", КодыКЛАДР);
	
	Возврат Результат;
	
КонецФункции

Функция НоваяКонтактнаяИнформация()
	Результат = Новый Структура;
	Результат.Вставить("КонтактнаяИнформация");
	Результат.Вставить("Представление");
	Результат.Вставить("Комментарий");
	Возврат Результат;
КонецФункции

Функция ДатаИзJSON(ДатаСтрока)
	Возврат ?(ДатаСтрока = Неопределено, Неопределено, ПрочитатьДатуJSON(ДатаСтрока, ФорматДатыJSON.ISO));
КонецФункции

#КонецОбласти 

