#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Таб = Сформировать(ПараметрКоманды);
	ВыводПечатныхФормКлиент.ОткрытьПредварительныйПросмотр(Таб);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция Сформировать(Знач МасДок)
	Таб = Новый ТабличныйДокумент;
	Для Каждого Док Из МасДок Цикл
		Документы.ПередачаВПереработку.ПечатьАктПередачи(Док, Таб);
	КонецЦикла;
	Возврат Таб;
КонецФункции

#КонецОбласти
