
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ХозяйственнаяОперация") Тогда
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;
		Настройки = Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор;
        ЭлементОтбора = Настройки.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
        ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
        ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
        ЭлементОтбора.ПравоеЗначение = Справочники.СтатьиДвиженияДенежныхСредств.ПолучитьПоХозяйственнойОперации(Параметры.ХозяйственнаяОперация);
        ЭлементОтбора.Использование = Истина;
	КонецЕсли;	
КонецПроцедуры
