
#Область Интерфейс

// Проверяет, новый ли объект формы, если новый, записывает
Процедура ЗаписатьЕслиНовый(Форма, ЗаписыватьМодифицированный = Ложь) Экспорт
	Если Не ЗначениеЗаполнено(Форма.Объект.Ссылка) Тогда 
		Форма.Записать();
		Возврат;
	КонецЕсли;
	Если ЗаписыватьМодифицированный и Форма.Модифицированность = Истина Тогда
		Форма.Записать();	
	КонецЕсли;	
КонецПроцедуры

Процедура ДобавитьКомментарий(Владелец, Адресат = Неопределено) Экспорт
	Если Не ЗначениеЗаполнено(Владелец) Тогда Возврат КонецЕсли;
	П = Новый Структура;
	Если Адресат <> Неопределено Тогда
		П.Вставить("Адресат", Адресат);	
	КонецЕсли;	
	Оп = Новый ОписаниеОповещения("ПослеЗакрытияФормыВводаКомментария", ЭтотОбъект, Владелец);	
	ОткрытьФорму("РегистрСведений.КонтекстныеОбсуждения.Форма.ФормаВводаКомментария", П,,,,, Оп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

Процедура РедактироватьСуммыНДСПлатёжногоДокумента(СтрОснованиеПлатежа, Форма) Экспорт
	Если Не СтрОснованиеПлатежа.НесколькоСтавокНДС Тогда Возврат КонецЕсли;
	П = Новый Структура;
	П.Вставить("РасшифровкаНДС", ОбщегоНазначенияКлиентСервер.КонвертироватьИзJSON(СтрОснованиеПлатежа.РасшифровкаНДС, Ложь));
	Оп = Новый ОписаниеОповещения("ПослеЗакрытияФормыРедактированияНДСПлатёжногоДокумента", Форма, СтрОснованиеПлатежа);
	ОткрытьФорму("ОбщаяФорма.РедактированиеНДСПлатёжногоДокумента", П, Форма,,,, Оп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
КонецПроцедуры

Процедура ЗаполнитьСуммыНДСПлатёжногоДокумента(СтрОснованиеПлатежа, МасДанные) Экспорт
	СтрОснованиеПлатежа.СуммаНДС = 0;
	Для Каждого Стр Из МасДанные Цикл
		СтрОснованиеПлатежа.СуммаНДС = СтрОснованиеПлатежа.СуммаНДС + Стр.СуммаНДС;	
	КонецЦикла;	
	СтрОснованиеПлатежа.РасшифровкаНДС = ОбщегоНазначенияКлиентСервер.КонвертироватьВJSON(МасДанные);	
КонецПроцедуры	

Процедура ЗаполнитьДанныеПоТорговойТочке(ДокОбъект, ВидЦены, ЭлементВидЦены = Неопределено) Экспорт
	ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоров.СПокупателем");
	ДанныеКонтрагента = ОбщегоНазначенияВызовСервера.ПолучитьДанныеКонтрагента(ДокОбъект.Контрагент, ДокОбъект.Организация, ВидДоговора, ДокОбъект.Дата);
	ЗаполнитьЗначенияСвойств(ДокОбъект, ДанныеКонтрагента);
	ЗапретОтгрузки = КлиентуЗапрещеноОтгружать(ДокОбъект);
	Если ЗапретОтгрузки Тогда
		ДокОбъект.Контрагент = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
		Возврат;
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(ДокОбъект, ДанныеКонтрагента);
	ВидЦены = ДанныеКонтрагента.ВидЦены;
	Если ЭлементВидЦены <> Неопределено Тогда
		РаботаСДокументамиКлиентСервер.ЗаполнитьСписокВыбораВидовЦен(ВидЦены, ЭлементВидЦены);
	КонецЕсли;		
КонецПроцедуры	

Процедура ОткрытьФормуВыбораЗаявкиНаРасходованиеДС(Объект, Элемент, СтандартнаяОбработка) Экспорт
	СтандартнаяОбработка = Ложь;
	Отбор = Новый Структура("Организация, Контрагент, Сумма", Объект.Организация, Объект.Контрагент, Объект.Сумма);
    П = Новый Структура("Отбор, ДатаСреза, ТолькоНеоплаченные", Отбор, ?(Объект.Ссылка.Пустая(), ТекущаяДата(), Объект.Дата - 1), Истина);
    ОткрытьФорму("Документ.ЗаявкаНаРасходованиеДенежныхСредств.ФормаВыбора", П, Элемент);	
КонецПроцедуры	
	
#КонецОбласти

#Область Связь_данных

Процедура ОткрытьФормуВыбораСвязанныхДанных(ПараметрыФормы, ОписаниеОповещения, ТекСтр, КодСтроки, Основание, ТорговаяТочка) Экспорт
	ДанныеСтроки = Новый Структура("Номенклатура, Характеристика, Серия, Упаковка, Цена, ЦенаSKU, ВидЦены, СтавкаНДС, Идентификатор, УказаноНесколькоСерий");
	Если ТекСтр <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ДанныеСтроки, ТекСтр);	
		ДанныеСтроки.Идентификатор = ТекСтр.ПолучитьИдентификатор();
	КонецЕсли;	
	ДанныеСтроки.Вставить("КодСтроки", КодСтроки);
	ДанныеСтроки.Вставить("Основание", Основание);
	П = Новый Структура("ДанныеСтроки, ПараметрыФормы", ДанныеСтроки, ПараметрыФормы);
	ОткрытьФорму("ОбщаяФорма.ВыборСвязанныхДанных", П, АктивноеОкно(),,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

Функция ПараметрыФормыВыбораСвязанныхДанных() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("БлокироватьВыборОснования", Ложь);
	Возврат Результат;	
КонецФункции	

#КонецОбласти

#Область Обработка_данных

Процедура АвтоподборНоменклатуры(ДанныеВыбора, ПараметрыПолученияДанных, ДокОбъект, СтандартнаяОбработка, Параметры = Неопределено) Экспорт
	СтандартнаяОбработка = Ложь;	
	ПараметрыПолученияДанных.Вставить("ПодменаАвтоподбора", Истина);
	Если РаботаСДокументамиКлиентСервер.ЕстьРеквизит(ДокОбъект, "МестоХранения") Тогда
		ПараметрыПолученияДанных.Отбор.Вставить("МестоХранения", ДокОбъект.МестоХранения);	
	КонецЕсли;
	ПараметрыПолученияДанных.Отбор.Вставить("ДатаДокумента", ТекущаяДата());
	ПараметрыПолученияДанных.Отбор.Вставить("ПараметрыАвтоподбора", ?(Параметры = Неопределено, ПараметрыАвтободбораНоменклатуры(), Параметры));
	СЗ = РаботаСДокументамиВызовСервера.ПолучитьДанныеВыбораНоменклатуры(ПараметрыПолученияДанных);
	СтильПодсветкиСлов = ОбщегоНазначенияВызовСервера.ПолучитьСтильПодсветкиСлов();
	Для Каждого Стр Из СЗ Цикл
		ДанныеНоменклатуры = Стр.Значение;
		Представление = ОбщегоНазначенияКлиентСервер.ПредставлениеНоменклатуры(ДанныеНоменклатуры.Ссылка, ДанныеНоменклатуры.Характеристика, ДанныеНоменклатуры.Серия);	
		Если ЗначениеЗаполнено(ДанныеНоменклатуры.КодПоставщика) Тогда 
			Представление = Представление + ", " + ДанныеНоменклатуры.КодПоставщика;
		КонецЕсли;
		Если ЗначениеЗаполнено(ДанныеНоменклатуры.КодПроизводителя) Тогда 
			Представление = Представление + ", " + ДанныеНоменклатуры.КодПроизводителя;
		КонецЕсли;
		Если ДанныеНоменклатуры.Цена > 0 Тогда
			Представление = "► " + Представление;		
		КонецЕсли;	
		Если ДанныеНоменклатуры.Остаток = 0 Тогда
			ТекстОстаток = НСтр("fr = 'Hors stock'; ru = 'Нет в наличии'; en = 'Out of stock'; es = 'No disponible'");	
		Иначе	
			Единица = СокрЛП(ДанныеНоменклатуры.Единица); 
			ТекстОстаток = НСтр("ru = 'В наличии '; fr = 'En stock '") + Формат(ДанныеНоменклатуры.Остаток, "Л=ru_RU; ЧГ=0") + " " + Единица;
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(Представление, ТекстОстаток);
		Стр.Представление = ОбщегоНазначенияКлиентСервер.ПодсветитьСлова(Представление, ПараметрыПолученияДанных.СтрокаПоиска, СтильПодсветкиСлов, СтрНайти(Представление, "Нет в наличии") > 0);
	КонецЦикла;
	ДанныеВыбора = СЗ;	
КонецПроцедуры

Функция ПараметрыАвтободбораНоменклатуры() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("ВидЦены");
	Результат.Вставить("ИсключитьХарактеристикиДляВнутреннегоИспользования", Ложь);
	Возврат Результат;
КонецФункции	

Процедура ОбрабокаВыбораПриАвтоподбореНоменклатуры(ТекСтр, ВыбранноеЗначение, ДокОбъект, СтандартнаяОбработка, ПостфиксНоменклатуры = "") Экспорт
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		РеквизитНоменклатура = "Номенклатура" + ПостфиксНоменклатуры;
		РеквизитХарактеристика = "Характеристика" + ПостфиксНоменклатуры;
		РеквизитСерия = "Серия" + ПостфиксНоменклатуры;
		ТекСтр[РеквизитНоменклатура] = ВыбранноеЗначение.Ссылка;
		ТекСтр[РеквизитХарактеристика] = ВыбранноеЗначение.Характеристика;
		Если ТекСтр.Свойство("Серия") Тогда 
			ТекСтр[РеквизитСерия] = ВыбранноеЗначение.Серия;
		КонецЕсли;
		Если ТекСтр.Свойство("Остаток") Тогда 
			ТекСтр.Остаток = ВыбранноеЗначение.Остаток;
		КонецЕсли;
		РаботаСДокументамиКлиентСервер.УстановитьПараметрыНоменклатуры(ТекСтр, ДокОбъект);
		ЦенаВключаетНДС = РаботаСДокументамиКлиентСервер.ЦенаВключаетНДСДокумента(ДокОбъект);
		РаботаСДокументамиКлиентСервер.РассчитатьСтроку(ТекСтр, ЦенаВключаетНДС, , ПостфиксНоменклатуры);
	КонецЕсли;
КонецПроцедуры

Процедура ОткрытьФормуПодбораОбъектовРасчётовПоОстаткам(Форма, Параметры) Экспорт
	Оп = Новый ОписаниеОповещения("ПослеЗакрытияФормыПодбораОбъектовРасчётов", Форма);
	ОткрытьФорму("ОбщаяФорма.ПодборОбъектовРасчётовПоОстаткам", Параметры, Форма,,,, Оп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры	

#КонецОбласти

#Область Расчёты

Процедура РассчитатьАвансПоПлатёжномуДокументу(ДокОбъект, Аванс) Экспорт
	//Если ДокОбъект.ТЧОснования.Количество() = 1 Тогда
	//	ПерваяСтрока = ДокОбъект.ТЧОснования.Получить(0);
	//	СуммаОснования = ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(ПерваяСтрока.Основание,"Сумма");
	//	ПерваяСтрока.Сумма = ?(ЗначениеЗаполнено(ПерваяСтрока.Основание), Мин(СуммаОснования,ДокОбъект.Сумма), ДокОбъект.Сумма);
	//КонецЕсли;
	Аванс = ДокОбъект.Сумма - ДокОбъект.ТЧОснования.Итог("Сумма");	
КонецПроцедуры	

Процедура ПроверитьКратностьЕдиницы(ТекущиеДанные, Объект, Отказ) Экспорт
	Если ТекущиеДанные.КоличествоУпаковок = Цел(ТекущиеДанные.КоличествоУпаковок) Тогда Возврат	КонецЕсли;
	Если РаботаСДокументамиВызовСервера.КоличествоЕдиницыТолькоЦелое(ТекущиеДанные.Номенклатура, ТекущиеДанные.Упаковка) Тогда
		Отказ = Истина;
		ПоказатьПредупреждение(, Нстр("fr = ""Vous ne pouvez entrer qu'un nombre entier pour cette unité""; ru = 'Для данной единицы можно вводить только целое количество'; en = 'You can only enter an integer for a given unit.'; es = 'Para una unidad dada, solo se puede ingresar un número entero'"));
	КонецЕсли;
КонецПроцедуры	

#КонецОбласти

#Область Проверки

Процедура ПроверитьСуммуОснованийПлатёжногоДокумента(Объект, Отказ) Экспорт
	Если Объект.ТЧОснования.Итог("Сумма") > Объект.Сумма Тогда
		ПоказатьПредупреждение(, Нстр("fr = 'La somme des documents de base est supérieure à la somme du document'; ru = 'Сумма оснований больше суммы документа'; en = 'The amount of grounds is greater than the amount of the document'; es = 'La suma de los motivos es mayor que la suma del documento'"),, "Внимание");
		Отказ = Истина;
	КонецЕсли;	
КонецПроцедуры

Процедура ПроверитьСуммуАвансовТоварногоДокумента(Объект, Отказ) Экспорт
	Если Объект.ТЧЗачётАвансов.Итог("Сумма") > Объект.Сумма Тогда
		ПоказатьПредупреждение(, Нстр("fr = 'Le montant des avances est supérieur au montant du document'; ru = 'Сумма авансов больше суммы документа'; en = 'The amount of the advances is more than the amount of the document'; es = 'El monto de los anticipos es mayor que el monto del documento'"),, "Внимание");
		Отказ = Истина;
	КонецЕсли;	
КонецПроцедуры

Процедура ПоказатьВопросОПроверкеДокумента(ОписаниеОповещения, ТекстВопроса) Экспорт
	СЗКнопки = Новый СписокЗначений;
	СЗКнопки.Добавить(КодВозвратаДиалога.ОК, "Подтвердить");
	СЗКнопки.Добавить(КодВозвратаДиалога.Отмена, "Проверить");
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, СЗКнопки,,, "Внимание");	
КонецПроцедуры	

Функция КлиентуЗапрещеноОтгружать(ДокОбъект) Экспорт
	Если ТипЗнч(ДокОбъект.Ссылка) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда 
		ДатаОтгрузки = ДокОбъект.ДатаОтгрузки;
	ИначеЕсли ТипЗнч(ДокОбъект.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		ДатаОтгрузки = ДокОбъект.Дата;
	иначе
		Возврат Ложь;
	КонецЕсли;
	ЗапрещеноОтгружать = РаботаСДокументамиВызовСервера.КлиентуЗапрещеноОтгружать(ДокОбъект.Контрагент, ДатаОтгрузки);
	Если ЗапрещеноОтгружать Тогда 
		ПоказатьПредупреждение(,Нстр("fr = ""Il est interdit d'expédier vers ce point de vente !"
"Raison : Il y a des expéditions impayées dépassant le report et le crédit établis en vertu du contrat.""; ru = 'Запрещено отгружать данной торговой точке!"
"Причина: Есть неоплаченные отгрузки превышающие установленную отсрочку и кредит по договору.'; en = 'It is forbidden to ship to this outlet!"
"Reason: There are unpaid shipments exceeding the established deferral and credit under the agreement.'; es = '¡Está Prohibido enviar a este punto de venta!"
"Razón: Hay envíos impagados que exceden el aplazamiento establecido y el crédito del contrato.'"),10);
	КонецЕсли;
	Возврат ЗапрещеноОтгружать;
КонецФункции

#КонецОбласти

#Область Оповещения

Процедура ПослеЗакрытияФормыВводаКомментария(Результат, Владелец) Экспорт
	Если Результат = Неопределено Тогда Возврат КонецЕсли;
	РаботаСДокументамиВызовСервера.ДобавитьКомментарий(Владелец, СокрЛП(Результат.Описание), Результат.Адресат);
	ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.КонтекстныеОбсуждения"));
КонецПроцедуры

#КонецОбласти 
