
Функция СформироватьДвижения(ДокОбъект) Экспорт
	ТЗ = СерииИРазмещение.ОбъединитьТоварыССериями(ДокОбъект.Основание);
	ТЗ.Свернуть("СтавкаНДС", "СуммаСНДС, СуммаНДС");
	Для Каждого Стр Из ТЗ Цикл
		НС = ДокОбъект.Движения.НДСПродажи.Добавить();
		НС.Период = ДокОбъект.Дата;
		НС.Организация = ДокОбъект.Организация;
		НС.Контрагент = ДокОбъект.Контрагент;
		НС.СчётФактура = ?(ДокОбъект.Корректировочный, ДокОбъект.СчётФактураОснование, ДокОбъект.Ссылка);
		НС.Основание = ДокОбъект.Основание;
		НС.СтавкаНДС = Стр.СтавкаНДС;
		НС.СуммаБезНДС = Стр.СуммаСНДС - Стр.СуммаНДС;
		НС.СуммаНДС = Стр.СуммаНДС;
	КонецЦикла;	
КонецФункции
