
#Область Печать

Процедура ПечатьРасходныйКассовыйОрдер(Док, Таб) Экспорт
	Таб.ТолькоПросмотр = Истина;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ОтображатьСетку = Ложь;
	Таб.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	Таб.АвтоМасштаб = Истина;
	Таб.КлючПараметровПечати = "Параметры_печати_Документ_РасходныйКассовыйОрдер_РасходныйКассовыйОрдер";
	КарточкаОрганизации = Справочники.Контрагенты.ПолучитьКарточку(Док.Организация, Док.Дата);
	Валюта = Справочники.Валюты.MoroccanDirham;
	Макет = Документы.РасходныйКассовыйОрдер.ПолучитьМакет("РасходныйКассовыйОрдер");	
	оШапка = Макет.ПолучитьОбласть("Шапка");
	оШапка.Параметры.ПредставлениеОрганизации = КарточкаОрганизации.Наименование;
	//оШапка.Параметры.ОрганизацияПоОКПО = КарточкаОрганизации.ОКПО;
	оШапка.Параметры.НомерДокумента = РаботаСДокументами.СформироватьЦифровойНомер(Док.Номер);
	оШапка.Параметры.ДатаДокумента = Формат(Док.Дата, "ДЛФ=D");
	оШапка.Параметры.ДатаДокументаПрописью = Формат(Док.Дата, "ДЛФ=DD");
	оШапка.Параметры.КредитСубСчет = "50.01";
	оШапка.Параметры.Сумма = Док.Сумма;
	оШапка.Параметры.СуммаПрописью = Справочники.Валюты.СформироватьСуммуПрописью(Док.Сумма, Валюта, Перечисления.Локализации.fr_CA);
	оШапка.Параметры.ФИОПолучателя = Док.Выдать;
	оШапка.Параметры.Основание = Док.ОснованиеДляПечати;
	оШапка.Параметры.Приложение = Док.Приложение;
	оШапка.Параметры.РеквизитыДокументаУдостоверяющегоЛичность = Док.ПоДокументу;
	оШапка.Параметры.ДолжностьРуководителя = КарточкаОрганизации.Руководитель.Должность;
	оШапка.Параметры.ФИОРуководителя = КарточкаОрганизации.Руководитель.ДляПечати;
	оШапка.Параметры.ФИОГлавногоБухгалтера = КарточкаОрганизации.ГлавныйБухгалтер.ДляПечати;
	//оШапка.Параметры.ФИОКассира = Справочники.ФизическиеЛица.СформироватьПредставлениеДляПечати(Док.Кассир.ФизическоеЛицо);
	Таб.Вывести(оШапка);
	Таб.ВывестиГоризонтальныйРазделительСтраниц();
КонецПроцедуры

Function ПечатьЧека(Док, Spreadsheet) Export
	Template = Документы.РасходныйКассовыйОрдер.ПолучитьМакет("Ticket");
	
	Header = Template.GetArea("Шапка");
	
	Header.Parameters.Fill(Док);
	
	FieldPhoto = Док.Организация.Логотип.Get();
	Try
		Header.Drawings[0].Picture = New Picture(FieldPhoto);
	Except
	EndTry;
	
	Header.Parameters.КонтрагентЗаголовок = ?(ЗначениеЗаполнено(Док.Контрагент), НСтр("fr = 'Bénéficiaire'; ru = 'Получатель'; en = 'Recipient'; es = 'Destinatario'"), "");
	Header.Parameters.Контрагент = ?(ЗначениеЗаполнено(Док.Контрагент), Док.Контрагент, "");

	Spreadsheet.Put(Header);
	
	Spreadsheet.PutHorizontalPageBreak();
	
	Return Spreadsheet;
	
	//}}
EndFunction

Function PrintLettreDePaiement(Doc, Spreadsheet) Export
	Template = Документы.РасходныйКассовыйОрдер.ПолучитьМакет("LettreDePaiement");
	
	Header = Template.GetArea("Header");
	
	Header.Parameters.Fill(Doc);
	
	FieldPhoto = Doc.Организация.Логотип.Get();
	Try
		Header.Drawings[0].Picture = New Picture(FieldPhoto);
	Except
	EndTry;
	
	Header.Parameters.КонтрагентЗаголовок = ?(ЗначениеЗаполнено(Doc.Контрагент), НСтр("fr = 'Bénéficiaire'; ru = 'Получатель'; en = 'Recipient'; es = 'Destinatario'"), "");
	Header.Parameters.Контрагент = ?(ЗначениеЗаполнено(Doc.Контрагент), Doc.Контрагент, "");

	Spreadsheet.Put(Header);
	
	If not Doc.ТЧОснования.Count() = 0 then
		Title = Template.GetArea("Title");
		Spreadsheet.Put(Title);
		Num = 0;
		Line = Template.GetArea("Line");
		For Each Str in Doc.ТЧОснования Do
			Num = Num + 1;
			Line.Parameters.Num = Num;
			If ValueIsFilled(Str.Основание) then
				Line.Parameters.Number = Str.Основание.Number;
				If ТипЗнч(Str.Основание) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") 
					or ТипЗнч(Str.Основание) = Тип("ДокументСсылка.НалоговаяНакладнаяПокупка") Тогда 
					BLNumber = Str.Основание.НомерОтгрузочногоДокумента;
					BLDate = Str.Основание.ДатаОтгрузочногоДокумента;
				Else
					BLNumber = Str.Основание.Номер;
					BLDate = Str.Основание.Дата;
				EndIf;
			Else
				Line.Parameters.Number = "";
				BLNumber = "";
				BLDate = "";
			EndIf;
			Line.Parameters.BLNumber = BLNumber;
			Line.Parameters.BLDate = BLDate;
			Line.Parameters.Somme = Str.Сумма;
			Spreadsheet.Put(Line);
		EndDo;
	EndIf;

	Footer = Template.GetArea("Footer");
	Footer.Parameters.Comment = Doc.Комментарий;
	Spreadsheet.Put(Footer);
	
	Spreadsheet.PutHorizontalPageBreak();
	
	Return Spreadsheet;
	
	//}}
EndFunction

#КонецОбласти