#Область ПрограммныйИнтерфейс

// Перечисляет печатные формы объекта.
// См. ПечатныеФормы.НоваяКоллекцияКомандПечати
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - пополняемая коллекция команд печати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	Команда = КомандыПечати.Добавить();
	Команда.ИмяМакета = "РасходныйКассовыйОрдер";
	Команда.Представление = НСтр("ru = 'Расходный кассовый ордер'; fr = 'Bon de décaissement';
		|en = 'Cash payment order'; es = 'Orden de pago de caja'");

	Команда = КомандыПечати.Добавить();
	Команда.ИмяМакета = "Ticket";
	Команда.Представление = НСтр("ru = 'Чек'; fr = 'Ticket';
		|en = 'Receipt'; es = 'Recibo'");

	Команда = КомандыПечати.Добавить();
	Команда.ИмяМакета = "LettreDePaiement";
	Команда.Представление = НСтр("ru = 'Письмо о платеже'; fr = 'Lettre de paiement';
		|en = 'Payment letter'; es = 'Carta de pago'");

КонецПроцедуры

// Формирует запрошенные печатные формы.
// См. ПечатныеФормы.СформироватьПечатныеФормы
//
// Параметры:
//  МассивОбъектов        - Массив          - печатаемые объекты
//  ПараметрыПечати       - Структура       - параметры команды печати
//  КоллекцияПечатныхФорм - ТаблицаЗначений - заполняемая коллекция печатных форм
//  ОбъектыПечати         - СписокЗначений  - соответствие объектов областям печати
//  ПараметрыВывода       - Структура       - параметры окна печати
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	Если ПечатныеФормы.НужноПечататьМакет(КоллекцияПечатныхФорм, "РасходныйКассовыйОрдер") Тогда
		Таб = Новый ТабличныйДокумент;
		Для Каждого Док Из МассивОбъектов Цикл
			НомерСтрокиНачало = Таб.ВысотаТаблицы + 1;
			ПечатьРасходныйКассовыйОрдер(Док, Таб);
			ПечатныеФормы.ЗадатьОбластьПечати(Таб, НомерСтрокиНачало, ОбъектыПечати, Док);
		КонецЦикла;
		ПечатныеФормы.ВывестиТабличныйДокумент(КоллекцияПечатныхФорм, "РасходныйКассовыйОрдер",
			НСтр("ru = 'Расходный кассовый ордер'; fr = 'Bon de décaissement';
			|en = 'Cash payment order'; es = 'Orden de pago de caja'"),
			Таб, "Документ.РасходныйКассовыйОрдер.РасходныйКассовыйОрдер");
	КонецЕсли;

	Если ПечатныеФормы.НужноПечататьМакет(КоллекцияПечатныхФорм, "Ticket") Тогда
		Таб = Новый ТабличныйДокумент;
		Таб.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		Таб.АвтоМасштаб = Истина;
		Таб.ОтображатьСетку = Ложь;
		Таб.ОтображатьЗаголовки = Ложь;
		Таб.Защита = Ложь;
		Таб.ПолеСверху = 10;
		Таб.ПолеСлева = 5;
		Таб.ПолеСнизу = 10;
		Таб.ПолеСправа = 5;
		Для Каждого Док Из МассивОбъектов Цикл
			НомерСтрокиНачало = Таб.ВысотаТаблицы + 1;
			ПечатьЧека(Док, Таб);
			ПечатныеФормы.ЗадатьОбластьПечати(Таб, НомерСтрокиНачало, ОбъектыПечати, Док);
		КонецЦикла;
		ПечатныеФормы.ВывестиТабличныйДокумент(КоллекцияПечатныхФорм, "Ticket",
			НСтр("ru = 'Чек'; fr = 'Ticket';
			|en = 'Receipt'; es = 'Recibo'"),
			Таб, "Документ.РасходныйКассовыйОрдер.Ticket");
	КонецЕсли;

	Если ПечатныеФормы.НужноПечататьМакет(КоллекцияПечатныхФорм, "LettreDePaiement") Тогда
		Таб = Новый ТабличныйДокумент;
		Для Каждого Док Из МассивОбъектов Цикл
			НомерСтрокиНачало = Таб.ВысотаТаблицы + 1;
			PrintLettreDePaiement(Док, Таб);
			ПечатныеФормы.ЗадатьОбластьПечати(Таб, НомерСтрокиНачало, ОбъектыПечати, Док);
		КонецЦикла;
		ПечатныеФормы.ВывестиТабличныйДокумент(КоллекцияПечатныхФорм, "LettreDePaiement",
			НСтр("ru = 'Письмо о платеже'; fr = 'Lettre de paiement';
			|en = 'Payment letter'; es = 'Carta de pago'"),
			Таб, "Документ.РасходныйКассовыйОрдер.LettreDePaiement");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Печать

Процедура ПечатьРасходныйКассовыйОрдер(Док, Таб) Экспорт
	Таб.ТолькоПросмотр = Истина;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ОтображатьСетку = Ложь;
	Таб.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	Таб.АвтоМасштаб = Истина;
	Таб.КлючПараметровПечати = "Параметры_печати_Документ_РасходныйКассовыйОрдер_РасходныйКассовыйОрдер";
	КарточкаОрганизации = Справочники.Контрагенты.ПолучитьКарточку(Док.Организация, Док.Дата);
	Валюта = Справочники.Валюты.MoroccanDirham;
	Макет = ПечатныеФормы.МакетПечатнойФормы("Документ.РасходныйКассовыйОрдер.РасходныйКассовыйОрдер");	
	оШапка = Макет.ПолучитьОбласть("Шапка");
	оШапка.Параметры.ПредставлениеОрганизации = КарточкаОрганизации.Наименование;
	//оШапка.Параметры.ОрганизацияПоОКПО = КарточкаОрганизации.ОКПО;
	оШапка.Параметры.НомерДокумента = РаботаСДокументами.СформироватьЦифровойНомер(Док.Номер);
	оШапка.Параметры.ДатаДокумента = Формат(Док.Дата, "ДЛФ=D");
	оШапка.Параметры.ДатаДокументаПрописью = Формат(Док.Дата, "ДЛФ=DD");
	оШапка.Параметры.КредитСубСчет = "50.01";
	оШапка.Параметры.Сумма = Док.Сумма;
	оШапка.Параметры.СуммаПрописью = Справочники.Валюты.СформироватьСуммуПрописью(Док.Сумма, Валюта, Перечисления.Локализации.fr_CA);
	оШапка.Параметры.ФИОПолучателя = Док.Выдать;
	оШапка.Параметры.Основание = Док.ОснованиеДляПечати;
	оШапка.Параметры.Приложение = Док.Приложение;
	оШапка.Параметры.РеквизитыДокументаУдостоверяющегоЛичность = Док.ПоДокументу;
	оШапка.Параметры.ДолжностьРуководителя = КарточкаОрганизации.Руководитель.Должность;
	оШапка.Параметры.ФИОРуководителя = КарточкаОрганизации.Руководитель.ДляПечати;
	оШапка.Параметры.ФИОГлавногоБухгалтера = КарточкаОрганизации.ГлавныйБухгалтер.ДляПечати;
	//оШапка.Параметры.ФИОКассира = Справочники.ФизическиеЛица.СформироватьПредставлениеДляПечати(Док.Кассир.ФизическоеЛицо);
	Таб.Вывести(оШапка);
	Таб.ВывестиГоризонтальныйРазделительСтраниц();
КонецПроцедуры

Function ПечатьЧека(Док, Spreadsheet) Export
	Template = ПечатныеФормы.МакетПечатнойФормы("Документ.РасходныйКассовыйОрдер.Ticket");
	
	Header = Template.GetArea("Шапка");
	
	Header.Parameters.Fill(Док);
	
	FieldPhoto = Док.Организация.Логотип.Get();
	Try
		Header.Drawings[0].Picture = New Picture(FieldPhoto);
	Except
	EndTry;
	
	Header.Parameters.КонтрагентЗаголовок = ?(ЗначениеЗаполнено(Док.Контрагент), НСтр("fr = 'Bénéficiaire'; ru = 'Получатель'; en = 'Recipient'; es = 'Destinatario'"), "");
	Header.Parameters.Контрагент = ?(ЗначениеЗаполнено(Док.Контрагент), Док.Контрагент, "");

	Spreadsheet.Put(Header);
	
	Spreadsheet.PutHorizontalPageBreak();
	
	Return Spreadsheet;
	
	//}}
EndFunction

Function PrintLettreDePaiement(Doc, Spreadsheet) Export
	Template = ПечатныеФормы.МакетПечатнойФормы("Документ.РасходныйКассовыйОрдер.LettreDePaiement");
	
	Header = Template.GetArea("Header");
	
	Header.Parameters.Fill(Doc);
	
	FieldPhoto = Doc.Организация.Логотип.Get();
	Try
		Header.Drawings[0].Picture = New Picture(FieldPhoto);
	Except
	EndTry;
	
	Header.Parameters.КонтрагентЗаголовок = ?(ЗначениеЗаполнено(Doc.Контрагент), НСтр("fr = 'Bénéficiaire'; ru = 'Получатель'; en = 'Recipient'; es = 'Destinatario'"), "");
	Header.Parameters.Контрагент = ?(ЗначениеЗаполнено(Doc.Контрагент), Doc.Контрагент, "");

	Spreadsheet.Put(Header);
	
	If not Doc.ТЧОснования.Count() = 0 then
		Title = Template.GetArea("Title");
		Spreadsheet.Put(Title);
		Num = 0;
		Line = Template.GetArea("Line");
		For Each Str in Doc.ТЧОснования Do
			Num = Num + 1;
			Line.Parameters.Num = Num;
			If ValueIsFilled(Str.Основание) then
				Line.Parameters.Number = Str.Основание.Number;
				If ТипЗнч(Str.Основание) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") 
					or ТипЗнч(Str.Основание) = Тип("ДокументСсылка.НалоговаяНакладнаяПокупка") Тогда 
					BLNumber = Str.Основание.НомерОтгрузочногоДокумента;
					BLDate = Str.Основание.ДатаОтгрузочногоДокумента;
				Else
					BLNumber = Str.Основание.Номер;
					BLDate = Str.Основание.Дата;
				EndIf;
			Else
				Line.Parameters.Number = "";
				BLNumber = "";
				BLDate = "";
			EndIf;
			Line.Parameters.BLNumber = BLNumber;
			Line.Parameters.BLDate = BLDate;
			Line.Parameters.Somme = Str.Сумма;
			Spreadsheet.Put(Line);
		EndDo;
	EndIf;

	Footer = Template.GetArea("Footer");
	Footer.Parameters.Comment = Doc.Комментарий;
	Spreadsheet.Put(Footer);
	
	Spreadsheet.PutHorizontalPageBreak();
	
	Return Spreadsheet;
	
	//}}
EndFunction

#КонецОбласти