
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	РаботаСДокументами.ЗаполнитьРеквизитыПоУмолчанию(ЭтотОбъект);
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Или
		ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Или
		ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Или
		ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств") Или
		ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НалоговаяНакладная") Или
		ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НалоговаяНакладнаяПокупка") Тогда
		Организация = ДанныеЗаполнения.Организация;
		ДанныеОрганизации = ОбщегоНазначенияВызовСервера.ПолучитьДанныеОрганизации(Организация);
		//Касса = ДанныеОрганизации.Касса;
		КассаПользователя = РегистрыСведений.НастройкиПользователей.КассаПользователя();
		Касса = ?(КассаПользователя.Владелец = Организация, КассаПользователя, ДанныеОрганизации.Касса);
		Кассир = ПараметрыСеанса.ПараметрыПользователя.Сотрудник;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Договор = ДанныеЗаполнения.Договор;
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") 
			Или ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НалоговаяНакладная") Тогда
			ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту;
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") 
			Или ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НалоговаяНакладнаяПокупка") Тогда	
			ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаПоставщику;	
		Иначе	
			ХозяйственнаяОперация = ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьСоответствиеПревращенийХозяйственныхОпераций(ДанныеЗаполнения.ХозяйственнаяОперация);
		КонецЕсли;
		Сумма = ДанныеЗаполнения.Сумма;
		РаботаСДокументамиКлиентСервер.ДобавитьОснованиеВДенежныйДокумент(ЭтотОбъект, ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВозвратОтПокупателя") Тогда
		Организация = ДанныеЗаполнения.Организация;
		ДанныеОрганизации = ОбщегоНазначенияВызовСервера.ПолучитьДанныеОрганизации(Организация);
		//Касса = ДанныеОрганизации.Касса;
		КассаПользователя = РегистрыСведений.НастройкиПользователей.КассаПользователя();	
		Касса = ?(КассаПользователя.Владелец = Организация, КассаПользователя, ДанныеОрганизации.Касса);
		Кассир = ПараметрыСеанса.ПараметрыПользователя.Сотрудник;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Договор = ДанныеЗаполнения.Договор;
		Основание = ДанныеЗаполнения;
		ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту;
		Сумма = ДанныеЗаполнения.Сумма;
		РаботаСДокументамиКлиентСервер.ДобавитьОснованиеВДенежныйДокумент(ЭтотОбъект, ДанныеЗаполнения.Основание);
		Если Не ТЧОснования.Количество() = 0 Тогда 
			ТЧОснования.Получить(0).Сумма = Сумма;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда	
		Если ДанныеЗаполнения.Свойство("ЗаявкаНаРасходованиеДенежныхСредств") Тогда
			Заявка = ДанныеЗаполнения.ЗаявкаНаРасходованиеДенежныхСредств;
			ЗаявкаНаРасходованиеДенежныхСредств = Заявка;
			Организация = Заявка.Организация;
			Контрагент = Заявка.Контрагент;
			ХозяйственнаяОперация = Заявка.ХозяйственнаяОперация; 
			Дата = Заявка.ДатаПлатежа;
			Касса = Заявка.МестоХранения;
			Кассир = ПараметрыСеанса.Пользователь;
			Сумма = Заявка.Сумма;
			Для Каждого Стр Из Заявка.ТЧОснования Цикл
				НС = ТЧОснования.Добавить();
				ЗаполнитьЗначенияСвойств(НС, Стр);
			КонецЦикла;
		Иначе
			ДокЗаполнения = ДанныеЗаполнения.Документ;
			ТипОплаты = ?(ДанныеЗаполнения.Свойство("ТипОплаты"), ДанныеЗаполнения.ТипОплаты, Справочники.TypesDePayment.Cash);
			Организация = ДокЗаполнения.Организация;
			ДанныеОрганизации = ОбщегоНазначенияВызовСервера.ПолучитьДанныеОрганизации(Организация);
			//Касса = ДанныеОрганизации.Касса;
			КассаПользователя = РегистрыСведений.НастройкиПользователей.КассаПользователя();	
			Касса = ?(КассаПользователя.Владелец = Организация, КассаПользователя, ДанныеОрганизации.Касса);
			Кассир = ПараметрыСеанса.ПараметрыПользователя.Сотрудник;
			Контрагент = ДокЗаполнения.Контрагент;
			Договор = ДокЗаполнения.Договор;
			Если ТипЗнч(ДокЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
				ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту;
			Иначе	
				ХозяйственнаяОперация = ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьСоответствиеПревращенийХозяйственныхОпераций(ДокЗаполнения.ХозяйственнаяОперация);			
			КонецЕсли;
			Сумма = ДанныеЗаполнения.Сумма;
			РаботаСДокументамиКлиентСервер.ДобавитьОснованиеВДенежныйДокумент(ЭтотОбъект, ДокЗаполнения);
			Если Не ТЧОснования.Количество() = 0 Тогда 
				СтрТЧОснования = ТЧОснования.Получить(0);
				СтрТЧОснования.Сумма = Сумма;
				РаботаСДокументамиКлиентСервер.РассчитатьСуммуНДСПлатёжногоДокумента(СтрТЧОснования);
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВыплатаЗарплаты")
		Или ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПлатёжнаяВедомостьНаАванс") Тогда
		ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыплатаЗарплаты;
		Организация = ПараметрыСеанса.ПараметрыПользователя.Организация;
		ДанныеОрганизации = ОбщегоНазначенияВызовСервера.ПолучитьДанныеОрганизации(Организация);
		//Касса = ДанныеОрганизации.Касса;
		Касса = РегистрыСведений.НастройкиПользователей.КассаПользователя();	
		Кассир = ПараметрыСеанса.ПараметрыПользователя.Сотрудник;
		Основание = ДанныеЗаполнения;
		Сумма = ДанныеЗаполнения.Сумма-ДенежныеСредства.ПолучитьОстатокВыплатыЗПОснованию(ДанныеЗаполнения,Истина);
		СтатьяДДС = Справочники.СтатьиДвиженияДенежныхСредств.ВыплатаЗарплаты;
		РаботаСДокументамиКлиентСервер.ДобавитьОснованиеВДенежныйДокумент(ЭтотОбъект, ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПрочиеРасходы") Тогда 
		ХозяйственнаяОперация = ДанныеЗаполнения.ХозяйственнаяОперация;
		Организация = ДанныеЗаполнения.Организация;
		Контрагент = ДанныеЗаполнения.Контрагент;
		ДанныеОрганизации = ОбщегоНазначенияВызовСервера.ПолучитьДанныеОрганизации(Организация);
		//Касса = ДанныеОрганизации.Касса;
		Касса = РегистрыСведений.НастройкиПользователей.КассаПользователя();	
		Кассир = ПараметрыСеанса.ПараметрыПользователя.Сотрудник;
		Сумма = ДанныеЗаполнения.Сумма;
		СтатьяДДС = ДанныеЗаполнения.СтатьяДДС;
		РаботаСДокументамиКлиентСервер.ДобавитьОснованиеВДенежныйДокумент(ЭтотОбъект, ДанныеЗаполнения);
	Иначе
		ДанныеОрганизации = ОбщегоНазначенияВызовСервера.ПолучитьДанныеОрганизации(Организация);
		//Касса = ДанныеОрганизации.Касса;
		КассаПользователя = РегистрыСведений.НастройкиПользователей.КассаПользователя();	
		Касса = ?(КассаПользователя.Владелец = Организация, КассаПользователя, ДанныеОрганизации.Касса);
		МестоХранения = Касса.МестоХранения;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(СтатьяДДС) Тогда 
		СтатьяДДС = ОбщегоНазначенияВызовСервера.ПолучитьСтатьюДДСПоХозяйственнойОперации(ХозяйственнаяОперация);
	КонецЕсли;
	КассоваяСмена = РаботаСДокументами.НайтиОткрытуюСмену(Касса);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	УстановитьПривилегированныйРежим(Истина);
	РаботаСДокументами.УстановитьЗаписьВсехРегистров(Движения);
	// Блокировки
	Если ЗначениеЗаполнено(Контрагент) и ТипЗнч(Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
		Блокировка = Новый БлокировкаДанных;
		//УправляемыеБлокировки.ВзаиморасчётыСКонтрагентамиПрочее(Блокировка, Контрагент);
		УправляемыеБлокировки.ВзаиморасчётыСПокупателями(Блокировка, Контрагент);
		УправляемыеБлокировки.ВзаиморасчётыСПоставщиками(Блокировка, Контрагент);
		Блокировка.Заблокировать();
	КонецЕсли;
	// Формируем движения
	РегистрыНакопления.ДенежныеСредстваОрганизаций.СформироватьДвижения(ЭтотОбъект);
	РегистрыНакопления.ДвиженияПоКассе.СформироватьДвижения(ЭтотОбъект);
	РегистрыНакопления.ВзаиморасчётыСКонтрагентамиПрочие.СформироватьДвижения(ЭтотОбъект);
	РегистрыНакопления.ВзаиморасчётыСПокупателями.СформироватьДвижения(ЭтотОбъект);
	РегистрыНакопления.ВзаиморасчётыСПоставщиками.СформироватьДвижения(ЭтотОбъект);
	РегистрыНакопления.Убытки.СформироватьДвижения(ЭтотОбъект);
	РегистрыНакопления.Зарплата.СформироватьДвижения(ЭтотОбъект);	
	РегистрыНакопления.ОплатыЧеками.СформироватьДвижения(ЭтотОбъект);
	// Записываем движения
	Движения.Записать();
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = ПараметрыСеанса.Пользователь;
	КассоваяСмена = РаботаСДокументами.НайтиОткрытуюСмену(Касса);
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	РаботаСДокументами.МожноРедактироватьДокумент(ЭтотОбъект, Отказ);
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если (ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыплатаЗарплаты И ЗначениеЗаполнено(Основание))
		или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПрочийРасходДенежныхСредств Тогда 
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Контрагент"));
	КонецЕсли;
	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПрочийРасходДенежныхСредств Тогда 
		ПроверяемыеРеквизиты.Добавить("Комментарий");
	КонецЕсли;
	Если ТипОплаты = Справочники.TypesDePayment.Cheque Тогда 
		ПроверяемыеРеквизиты.Добавить("Чек");
	КонецЕсли;
КонецПроцедуры


                                                                                        