
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	РаботаСДокументами.ЗаполнитьРеквизитыПоУмолчанию(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	УстановитьПривилегированныйРежим(Истина);
	РаботаСДокументами.УстановитьЗаписьВсехРегистров(Движения);
	// Данные для проведения
    ТЗТоварыССериями = ЭтотОбъект.ТЧТовары.Выгрузить();
	ТЗТоварыССериями.Очистить();
	ТЗТоварыССериями.Колонки.Добавить("МестоХранения", Новый ОписаниеТипов("СправочникСсылка.МестаХранения"));
	//Если ЭтотОбъект.ТЧСерии.Количество() = 0 Тогда 
		НС = ТЗТоварыССериями.Добавить();
		НС.Номенклатура = ЭтотОбъект.Номенклатура;
		НС.Характеристика = ЭтотОбъект.Характеристика;
		НС.Упаковка = ЭтотОбъект.Упаковка;
		НС.КоличествоУпаковок = ЭтотОбъект.КоличествоУпаковок;
		НС.Количество = ЭтотОбъект.Количество; 
		НС.МестоХранения = МестоХранения;
	//Иначе
	//	Для Каждого Стр Из ЭтотОбъект.ТЧСерии Цикл 
	//		НС = ТЗТоварыССериями.Добавить();
	//		НС.Номенклатура = ЭтотОбъект.Номенклатура;
	//		НС.Характеристика = ЭтотОбъект.Характеристика;
	//		НС.Упаковка = ЭтотОбъект.Упаковка;
	//		НС.Серия = Стр.Серия;
	//		НС.КоличествоУпаковок = Стр.КоличествоУпаковок;
	//		НС.Количество = Стр.Количество; 
	//		НС.МестоХранения = МестоХранения;
	//	КонецЦикла;
	//КонецЕсли;
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ТЗТоварыССериями", ТЗТоварыССериями);
	// Блокировки
	ТЗТовары = ТЧТовары.Выгрузить(, "Номенклатура");
	НС = ТЗТовары.Добавить();
	НС.Номенклатура = Номенклатура;
	ТЗТовары.Свернуть("Номенклатура");
	Блокировка = Новый БлокировкаДанных;
	УправляемыеБлокировки.ТоварыВНаличии(Блокировка, ТЗТовары, МестоХранения);
	//УправляемыеБлокировки.ТоварыВЯчейках(Блокировка, ТЗТовары, Организация, МестоХранения);
	Блокировка.Заблокировать();
	// Формируем
	Отказ = Не РегистрыНакопления.ТоварыВНаличии.СформироватьДвижения(ЭтотОбъект);
	Если Отказ Тогда Возврат КонецЕсли;
	//РегистрыНакопления.ТоварыВЯчейках.СформироватьДвижения(ЭтотОбъект);
	// Записываем
	Движения.Записать();
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = ПараметрыСеанса.Пользователь;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	РаботаСДокументами.МожноРедактироватьДокумент(ЭтотОбъект, Отказ);
КонецПроцедуры
