#Область ПрограммныйИнтерфейс

// Перечисляет печатные формы объекта.
// См. ПечатныеФормы.НоваяКоллекцияКомандПечати
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - пополняемая коллекция команд печати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	Команда = КомандыПечати.Добавить();
	Команда.ИмяМакета = "Facture";
	Команда.Представление = НСтр("ru = 'Товарная накладная'; fr = 'Facture';
		|en = 'Invoice'; es = 'Factura'");

	Команда = КомандыПечати.Добавить();
	Команда.ИмяМакета = "Счёт";
	Команда.Представление = НСтр("ru = 'Счёт на оплату'; fr = 'Facture proforma';
		|en = 'Invoice for payment'; es = 'Factura para pago'");

	Команда = КомандыПечати.Добавить();
	Команда.ИмяМакета = "FactureSocassif";
	Команда.Представление = НСтр("ru = 'Товарная накладная (новая форма)'; fr = 'Facture (nouveau formulaire)';
		|en = 'Invoice (new form)'; es = 'Factura (formulario nuevo)'");

	Команда = КомандыПечати.Добавить();
	Команда.ИмяМакета = "FactureСФоном";
	Команда.Представление = НСтр("ru = 'Товарная накладная на бланке'; fr = 'Facture sur papier à en-tête';
		|en = 'Invoice on letterhead'; es = 'Factura en papel con membrete'");

КонецПроцедуры

// Формирует запрошенные печатные формы.
// См. ПечатныеФормы.СформироватьПечатныеФормы
//
// Параметры:
//  МассивОбъектов        - Массив          - печатаемые объекты
//  ПараметрыПечати       - Структура       - параметры команды печати
//  КоллекцияПечатныхФорм - ТаблицаЗначений - заполняемая коллекция печатных форм
//  ОбъектыПечати         - СписокЗначений  - соответствие объектов областям печати
//  ПараметрыВывода       - Структура       - параметры окна печати
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	Если ПечатныеФормы.НужноПечататьМакет(КоллекцияПечатныхФорм, "Facture") Тогда
		Таб = Новый ТабличныйДокумент;
		Для Каждого Док Из МассивОбъектов Цикл
			НомерСтрокиНачало = Таб.ВысотаТаблицы + 1;
			Документы.РеализацияТоваровУслуг.PrintFacture(Док, Таб);
			ПечатныеФормы.ЗадатьОбластьПечати(Таб, НомерСтрокиНачало, ОбъектыПечати, Док);
		КонецЦикла;
		ПечатныеФормы.ВывестиТабличныйДокумент(КоллекцияПечатныхФорм, "Facture",
			НСтр("ru = 'Товарная накладная'; fr = 'Facture';
			|en = 'Invoice'; es = 'Factura'"),
			Таб, "Документ.РеализацияТоваровУслуг.FactureModel");
	КонецЕсли;

	Если ПечатныеФормы.НужноПечататьМакет(КоллекцияПечатныхФорм, "Счёт") Тогда
		Таб = Новый ТабличныйДокумент;
		Документы.РеализацияТоваровУслуг.ПечатьСчетовНаОплату(МассивОбъектов, Таб, ОбъектыПечати);
		ПечатныеФормы.ВывестиТабличныйДокумент(КоллекцияПечатныхФорм, "Счёт",
			НСтр("ru = 'Счёт на оплату'; fr = 'Facture proforma';
				|en = 'Invoice for payment'; es = 'Factura para pago'"),
			Таб, "Документ.РеализацияТоваровУслуг.Счёт");
	КонецЕсли;

	Если ПечатныеФормы.НужноПечататьМакет(КоллекцияПечатныхФорм, "FactureSocassif") Тогда
		Таб = Новый ТабличныйДокумент;
		Для Каждого Док Из МассивОбъектов Цикл
			НомерСтрокиНачало = Таб.ВысотаТаблицы + 1;
			Документы.РеализацияТоваровУслуг.PrintFactureSocassif(Док, Таб);
			ПечатныеФормы.ЗадатьОбластьПечати(Таб, НомерСтрокиНачало, ОбъектыПечати, Док);
		КонецЦикла;
		ПечатныеФормы.ВывестиТабличныйДокумент(КоллекцияПечатныхФорм, "FactureSocassif",
			НСтр("ru = 'Товарная накладная (новая форма)'; fr = 'Facture (nouveau formulaire)';
			|en = 'Invoice (new form)'; es = 'Factura (formulario nuevo)'"),
			Таб, "Документ.РеализацияТоваровУслуг.FactureSocassif");
	КонецЕсли;

	Если ПечатныеФормы.НужноПечататьМакет(КоллекцияПечатныхФорм, "FactureСФоном") Тогда
		Таб = Новый ТабличныйДокумент;
		Для Каждого Док Из МассивОбъектов Цикл
			НомерСтрокиНачало = Таб.ВысотаТаблицы + 1;
			Документы.РеализацияТоваровУслуг.PrintFactureEnTete(Док, Таб, Истина);
			ПечатныеФормы.ЗадатьОбластьПечати(Таб, НомерСтрокиНачало, ОбъектыПечати, Док);
		КонецЦикла;
		ПечатныеФормы.ВывестиТабличныйДокумент(КоллекцияПечатныхФорм, "FactureСФоном",
			НСтр("ru = 'Товарная накладная на бланке'; fr = 'Facture sur papier à en-tête';
			|en = 'Invoice on letterhead'; es = 'Factura en papel con membrete'"),
			Таб, "Документ.РеализацияТоваровУслуг.FactureModelEnTete");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Печать

Процедура ПечатьТорг12(Док, Таб) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	ЭтоВозвратПоставщику = ТипЗнч(Док) = Тип("ДокументСсылка.ВозвратПоставщику");
	Таб.ТолькоПросмотр = Истина;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ОтображатьСетку = Ложь;
	Таб.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Таб.АвтоМасштаб = Истина;
	Таб.КлючПараметровПечати = "Параметры_печати_Документ_НалоговаяНакладная_Торг12";
	ТабФормирование = Новый ТабличныйДокумент;
	ТабФормирование.АвтоМасштаб = Истина;
	ТабФормирование.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	// Макет
	Макет = ПечатныеФормы.МакетПечатнойФормы("Документ.НалоговаяНакладная.РасходнаяНакладная");
	// Переменные
	Если ТипЗнч(Док) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		Грузоотправитель = Док.Контрагент;
		Грузополучатель = Док.Организация; 
		Плательщик = Док.Организация;
		ДокНомер = Док.НомерВходящегоДокумента;
		ДокДата = Док.ДатаВходящегоДокумента;
	Иначе
		Грузоотправитель = Док.Организация;
		Грузополучатель =  Док.Контрагент;
		Плательщик = Док.Контрагент;
		ДокНомер = РаботаСДокументами.СформироватьЦифровойНомер(Док.Номер);
		ДокДата = Док.Дата;
	КонецЕсли;
    КарточкаГрузоотправителя = Справочники.Контрагенты.ПолучитьКарточку(Грузоотправитель, Док.Дата);
	КарточкаГрузополучателя = Справочники.Контрагенты.ПолучитьКарточку(Грузополучатель, Док.Дата);
	КарточкаПлательщика = Справочники.Контрагенты.ПолучитьКарточку(Плательщик, Док.Дата);
	// Шапка
	оШапка = Макет.ПолучитьОбласть("Шапка");
	оЗаголовок = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	оШапка.Параметры.НомерДокумента = ДокНомер;
	оШапка.Параметры.ДатаДокумента = ДокДата;
	оШапка.Параметры.ПредставлениеОрганизации = КарточкаГрузоотправителя.Представление;
	оШапка.Параметры.ПредставлениеПоставщика = КарточкаГрузоотправителя.Представление;
	оШапка.Параметры.ОрганизацияПоОКПО = КарточкаГрузоотправителя.Реквизиты.ОКПО;
	оШапка.Параметры.ПредставлениеГрузополучателя = КарточкаГрузополучателя.Наименование + ", " + КарточкаГрузополучателя.Реквизиты.АдресФактический;
	оШапка.Параметры.АдресДоставки = КарточкаГрузополучателя.Реквизиты.АдресДоставки;
	оШапка.Параметры.ГрузополучательПоОКПО = КарточкаГрузополучателя.Реквизиты.ОКПО;
	оШапка.Параметры.ПредставлениеПлательщика = КарточкаПлательщика.Представление;
	оШапка.Параметры.ПлательщикПоОКПО = КарточкаПлательщика.Реквизиты.ОКПО;
	оШапка.Параметры.Основание = "Договор " + СокрЛП(Док.Договор);
	ТабФормирование.Вывести(оШапка);
	ТабФормирование.Вывести(оЗаголовок);
	// Строки
	оСтрока = Макет.ПолучитьОбласть("Строка");
	оИтогоПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
	оВсего = Макет.ПолучитьОбласть("Всего");
	оПодвал = Макет.ПолучитьОбласть("Подвал");
	ИтогоКоличество = 0;
	ИтогоСумма = 0;
	ИтогоМест = 0;
	ИтогоНетто = 0;
	ИтогоБрутто = 0;
	ИтогоСтраницаКоличество = 0;
	ИтогоСтраницаСумма = 0;
	ИтогоСтраницаМест = 0;
	Ном = 1;
	МасВывод = Новый Массив;
	ТЧТовары = СерииИРазмещение.ОбъединитьТоварыССериями(Док);	
	ТЧТовары = ВыводПечатныхФорм.СформироватьТабличныеДанные(ТЧТовары);	
	КоличествоТоваров = ТЧТовары.Количество();
	Для Каждого Стр Из ТЧТовары Цикл
		оСтрока.Параметры.Заполнить(Стр);
		оСтрока.Параметры.НомерСтроки = Ном;
		//Если Док.ЦенаВключаетНДС Тогда
			СуммаБезНДС = Стр.СуммаСНДС - Стр.СуммаНДС;
			ЦенаБезНДС = ?(Стр.Количество = 0, 0, СуммаБезНДС / Стр.Количество);
			оСтрока.Параметры.Сумма = СуммаБезНДС;
			оСтрока.Параметры.Цена = ЦенаБезНДС;
		//КонецЕсли;
		МасВывод.Очистить();
		МасВывод.Добавить(оСтрока);
		МасВывод.Добавить(оИтогоПоСтранице);			
		Если Ном = КоличествоТоваров Тогда				
			МасВывод.Добавить(оВсего);
			МасВывод.Добавить(оПодвал);
			Если Не ТабФормирование.ПроверитьВывод(МасВывод) Тогда
				оИтогоПоСтранице.Параметры.ИтогоКоличествоНаСтранице = ИтогоСтраницаКоличество;
				оИтогоПоСтранице.Параметры.ИтогоМестНаСтранице = ИтогоСтраницаМест;
				оИтогоПоСтранице.Параметры.ИтогоСуммаНаСтранице = ИтогоСтраницаСумма;
				ТабФормирование.Вывести(оИтогоПоСтранице);
				ТабФормирование.ВывестиГоризонтальныйРазделительСтраниц();
				ИтогоСтраницаКоличество = 0;
				ИтогоСтраницаСумма = 0;
				ИтогоСтраницаМест = 0;
				ТабФормирование.Вывести(оЗаголовок);
			КонецЕсли;
		ИначеЕсли Не ТабФормирование.ПроверитьВывод(МасВывод) Тогда
			оИтогоПоСтранице.Параметры.ИтогоКоличествоНаСтранице = ИтогоСтраницаКоличество;
			оИтогоПоСтранице.Параметры.ИтогоМестНаСтранице = ИтогоСтраницаМест;
			оИтогоПоСтранице.Параметры.ИтогоСуммаНаСтранице = ИтогоСтраницаСумма;
			ТабФормирование.Вывести(оИтогоПоСтранице);
			ТабФормирование.ВывестиГоризонтальныйРазделительСтраниц();
			ИтогоСтраницаКоличество = 0;
			ИтогоСтраницаСумма = 0;
			ИтогоСтраницаМест = 0;
			ТабФормирование.Вывести(оЗаголовок);
		КонецЕсли;
		ТабФормирование.Вывести(оСтрока);
		ИтогоКоличество = ИтогоКоличество + Стр.Количество;
		ИтогоСумма = ИтогоСумма + Стр.Сумма;
		ИтогоМест = ИтогоМест + Стр.КоличествоУпаковок;
		//ИтогоНетто = ИтогоНетто + Стр.Количество;
		//ИтогоБрутто = ИтогоБрутто + Стр.Количество;
		ИтогоСтраницаКоличество = ИтогоСтраницаКоличество + Стр.Количество;
		ИтогоСтраницаСумма = ИтогоСтраницаСумма + Стр.СуммаСНДС;
		ИтогоСтраницаМест = ИтогоСтраницаМест + Стр.КоличествоУпаковок;
		Ном = Ном + 1;
	КонецЦикла;
	оИтогоПоСтранице.Параметры.ИтогоКоличествоНаСтранице = ИтогоСтраницаКоличество;
	оИтогоПоСтранице.Параметры.ИтогоМестНаСтранице = ИтогоСтраницаМест;
	оИтогоПоСтранице.Параметры.ИтогоСуммаНаСтранице = ИтогоСтраницаСумма;
	ТабФормирование.Вывести(оИтогоПоСтранице);
	// Всего
	оВсего.Параметры.ИтогоКоличество = ИтогоКоличество;
	оВсего.Параметры.ИтогоМест = ИтогоМест;
	оВсего.Параметры.ИтогоСумма = ИтогоСумма;
	ТабФормирование.Вывести(оВсего);
	// Подвал
	оПодвал.Параметры.КоличествоПорядковыхНомеровЗаписейПрописью = ЧислоПрописью(КоличествоТоваров,,",,,,,,,,0");
	оПодвал.Параметры.ВсегоМестПрописью = ЧислоПрописью(ИтогоМест,,",,,,,,,,0");
	оПодвал.Параметры.МассаГрузаНеттоПрописью = ЧислоПрописью(ИтогоНетто,,",,,,,,,,0");
	оПодвал.Параметры.МассаГрузаБруттоПрописью = ЧислоПрописью(ИтогоБрутто,,",,,,,,,,0");
	оПодвал.Параметры.СуммаПрописью = Справочники.Валюты.СформироватьСуммуПрописью(ИтогоСумма, Справочники.Валюты.MoroccanDirham, Перечисления.Локализации.fr_CA);
	
	оПодвал.Параметры.ФИОРуководителя = КарточкаГрузоотправителя.Руководитель.ДляПечатиПолное;		
	оПодвал.Параметры.ДолжностьРуководителя = КарточкаГрузоотправителя.Руководитель.Должность;		
	оПодвал.Параметры.ФИОГлавБухгалтера = КарточкаГрузоотправителя.ГлавныйБухгалтер.Должность; 		
	
	ТабФормирование.Вывести(оПодвал);
	ТабФормирование.ВывестиГоризонтальныйРазделительСтраниц();
	Таб.Вывести(ТабФормирование);
	Таб.ИспользуемоеИмяФайла = РаботаСДокументами.КраткоеПредставлениеДокумента(Док, "Товарная накладная");
КонецПроцедуры

Процедура ПечатьСчетНаОплату(Док, Таб, РазбитьНДС = Ложь) Экспорт
	ВыбДата = Док.Дата;
	ВыбНомер = Док.Номер;
	Организация = Док.Организация;
	Контрагент = Док.Контрагент;
	Макет = ПечатныеФормы.МакетПечатнойФормы("Документ.НалоговаяНакладная.Счёт"); 
    КарточкаОрганизации = Справочники.Контрагенты.ПолучитьКарточку(Организация, Док.Дата);
    КарточкаКонтрагента = Справочники.Контрагенты.ПолучитьКарточку(Контрагент, Док.Дата);
	ОбластьЗаголовокСчета = Макет.ПолучитьОбласть("ЗаголовокСчета");
	ОбластьЗаголовокСчета.Параметры.БанкПолучателяпредставление = КарточкаОрганизации.БанковскийСчётОсновной.Наименование;
	ОбластьЗаголовокСчета.Параметры.БикБанкаПолучателя = КарточкаОрганизации.БанковскийСчётОсновной.Банк.Код;
	//ОбластьЗаголовокСчета.Параметры.СчетБанкаПолучателяПредставление = КарточкаОрганизации.БанковскийСчётОсновной.Банк.КоррСчёт;
	ОбластьЗаголовокСчета.Параметры.СчетПолучателяПредставление = КарточкаОрганизации.БанковскийСчётОсновной.НомерСчёта;
	ОбластьЗаголовокСчета.Параметры.ИННПолучателя = Организация.NIF;
	ОбластьЗаголовокСчета.Параметры.КПППолучателя = КарточкаОрганизации.Реквизиты.ICE;
	ОбластьЗаголовокСчета.Параметры.ПредставлениеПолучателя = Организация.Наименование;
	Таб.Вывести(ОбластьЗаголовокСчета);
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.ТекстЗаголовка = "Facture proforma № " + Выбномер + " de " + Формат(ВыбДата, "ДЛФ=DD");
	Таб.Вывести(ОбластьЗаголовок);
	
	ОбластьПоставщик = Макет.ПолучитьОбласть("Поставщик");
	ОбластьПоставщик.Параметры.ПредставлениеПоставщика = Организация.Наименование 
	+ ", IF " + Организация.NIF + ", RC " + Организация.RC + ", " 
	+ КарточкаОрганизации.Реквизиты.АдресЮридический;
	Таб.Вывести(ОбластьПоставщик);
	
	ОбластьПокупатель = Макет.ПолучитьОбласть("Покупатель");
	ОбластьПокупатель.Параметры.ПредставлениеПокупателя = Контрагент.Наименование
	+ ", IF " + Контрагент.NIF + ", RC " + Контрагент.RC + ", " 
	+ КарточкаКонтрагента.Реквизиты.АдресЮридический + ", tel.: " + КарточкаКонтрагента.Реквизиты.Телефон;
	Таб.Вывести(ОбластьПокупатель);
	
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	Таб.Вывести(ОбластьШапкаТаблицы);
	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	ТЗ = СерииИРазмещение.ОбъединитьТоварыССериями(Док);	
	ТЗ = ВыводПечатныхФорм.СформироватьТабличныеДанные(ТЗ);	

	Ном = 1;
	Для Каждого Стр Из ТЗ цикл
		ОбластьСтрока.Параметры.Заполнить(Стр);
		//ОбластьСтрока.Параметры.Единица = Стр.Единица.Единица;
		ОбластьСтрока.Параметры.НомерСтроки = Ном;
		Таб.Вывести(ОбластьСтрока);
		Ном = Ном + 1;
	КонецЦикла;
	
	ОбластьИтого = Макет.ПолучитьОбласть("Итого");
	ОбластьИтого.Параметры.Всего = ТЗ.Итог("Сумма");
	Таб.Вывести(ОбластьИтого);
	
	оИтогоНДС = Макет.ПолучитьОбласть("ИтогоНДС");
	оИтогоНДС.Параметры.НДС = "Сумма НДС";
	оИтогоНДС.Параметры.ВсегоНДС = ТЗ.Итог("СуммаНДС");
	Таб.Вывести(оИтогоНДС);
	
	Если РазбитьНДС тогда
		ТзНДС = ТЗ.Скопировать();
		ТзНДС.Свернуть("СтавкаНДС", "СуммаНДС");
		ТзНДС.Сортировать("СтавкаНДС");
		Для каждого Стр Из ТзНДС цикл
			оИтогоНДС.Параметры.НДС = "В т.ч. "+Стр.СтавкаНДС;
			оИтогоНДС.Параметры.ВсегоНДС = Стр.СуммаНДС;
			Таб.Вывести(оИтогоНДС);
		КонецЦикла;
	КонецЕсли;
	
	ОбластьИтогоКОплате = Макет.ПолучитьОбласть("ИтогоКОплате");
	ОбластьИтогоКОплате.Параметры.ИтогоКОплате = ТЗ.Итог("Сумма");
	Таб.Вывести(ОбластьИтогоКОплате);
	
	ОбластьСуммаПрописью = Макет.ПолучитьОбласть("СуммаПрописью");
	//ОбластьСуммаПрописью.Параметры.ИтоговаяСтрока = "Всего наименований " + ТЗ.Количество() + ", на сумму " + ТЗ.Итог("Сумма") + " руб.";
	ОбластьСуммаПрописью.Параметры.СуммаПрописью = Справочники.Валюты.СформироватьСуммуПрописью(ТЗ.Итог("Сумма"), Константы.ВалютаРегламентированногоУчета.Получить(), Перечисления.Локализации.fr_CA);
	Таб.Вывести(ОбластьСуммаПрописью);
	
	ОбластьПодвалСчета = макет.ПолучитьОбласть("ПодвалСчета");
	Таб.Вывести(ОбластьПодвалСчета);
	Таб.ОтображатьСетку = Ложь;
	Таб.ОтображатьЗаголовки = Ложь; 
	Таб.ВывестиГоризонтальныйРазделительСтраниц();
КонецПроцедуры

Процедура ПечатьАктаОбОказанииУслуг(Док, Таб) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Таб.ОтображатьСетку = Ложь;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	Таб.АвтоМасштаб = Истина;
	Таб.КлючПараметровПечати = "Параметры_печати_Документ_НалоговаяНакладная_АктОбОказанииУслуг";
	Макет = ПечатныеФормы.МакетПечатнойФормы("ОбщийМакет.АктОбОказанииУслуг");	
	оЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	оЗаголовок.Параметры.ТекстЗаголовка = РаботаСДокументами.КраткоеПредставлениеДокумента(Док, "Акт");
	Таб.Вывести(оЗаголовок);
	оПоставщик = Макет.ПолучитьОбласть("Поставщик");	
	оПоставщик.Параметры.ПредставлениеПоставщика = Док.Организация;
	Таб.Вывести(оПоставщик);
	оПолучатель = Макет.ПолучитьОбласть("Получатель");	
	оПолучатель.Параметры.ПредставлениеПолучателя = Док.Контрагент;
	оПолучатель.Параметры.Основание = Док.Договор;
	Таб.Вывести(оПолучатель);
	Таб.Вывести(Макет.ПолучитьОбласть("ШапкаТаблицы"));
	ТЗ = Док.ТЧУслуги.Выгрузить();	
	Для Каждого Стр Из ТЗ Цикл
		оСтрока = Макет.ПолучитьОбласть("Строка"); 
		оСтрока.Параметры.Заполнить(Стр);
		оСтрока.Параметры.Номенклатура = ОбщегоНазначенияКлиентСервер.ПредставлениеНоменклатуры(Стр.Номенклатура, Стр.Содержание, , Истина);
		оСтрока.Параметры.ЕдиницаИзмерения = Стр.Номенклатура.Единица;
		Таб.Вывести(оСтрока);
	КонецЦикла;
	ОИтого = Макет.ПолучитьОбласть("Итого");
	ОИтого.Параметры.Всего = ТЗ.Итог("Сумма");
	Таб.Вывести(ОИтого);
	оИтогоНДС = Макет.ПолучитьОбласть("ИтогоНДС");
	оИтогоНДС.Параметры.НДС = "Сумма НДС";
	оИтогоНДС.Параметры.ВсегоНДС = ТЗ.Итог("СуммаНДС");
	Таб.Вывести(оИтогоНДС);
	ОСуммаПрописью = Макет.ПолучитьОбласть("СуммаПрописью");
	ОСуммаПрописью.Параметры.ИтоговаяСтрока = "Всего наименований " + ТЗ.Количество() 
	+ ", на сумму " + ТЗ.Итог("Сумма") + " руб.";
	ОСуммаПрописью.Параметры.СуммаПрописью = Справочники.Валюты.СформироватьСуммуПрописью(ТЗ.Итог("Сумма"),Константы.ВалютаРегламентированногоУчета.Получить(), Перечисления.Локализации.fr_CA);
	Таб.Вывести(ОСуммаПрописью);
	
	ОПодписи = Макет.ПолучитьОбласть("Подписи");
	ОПодписи.Параметры.НазваниеОрганизации = Док.Организация;
	ОПодписи.Параметры.НазваниеЗаказчика = Док.Контрагент;
	Таб.Вывести(ОПодписи);
	Таб.ВывестиГоризонтальныйРазделительСтраниц();
	Таб.ИспользуемоеИмяФайла = РаботаСДокументами.КраткоеПредставлениеДокумента(Док, "Акт");
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	Если ВидФормы = "ФормаОбъекта" Тогда
		СтандартнаяОбработка = Ложь;
		Если ПараметрыСеанса.ПараметрыКлиентаНаСервере.ЭтоМобильныйКлиент Тогда
			ВыбраннаяФорма = "ФормаДокументаМобильныйКлиент";
		Иначе
			ВыбраннаяФорма = "ФормаДокумента";	
		КонецЕсли;	
	ИначеЕсли ВидФормы = "ФормаСписка" Тогда
		СтандартнаяОбработка = Ложь;
		Если ПараметрыСеанса.ПараметрыКлиентаНаСервере.ЭтоМобильныйКлиент Тогда
			ВыбраннаяФорма = "ФормаСпискаМобильныйКлиент";
		Иначе
			ВыбраннаяФорма = "ФормаСписка";	
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти
