
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Период = Новый СтандартныйПериод;
	Период.ДатаНачала = ДобавитьМесяц(ТекущаяДата(), -1);
	Период.ДатаОкончания = ТекущаяДата();
	ПараметрыОтчёта = Новый Структура("Период", Период);
	ОтборОтчёта = Новый Структура("Номенклатура", ПараметрКоманды);
	ПользовательскиеНастройки = ОбщегоНазначенияВызовСервера.УстановитьНастройкиОтчёта("ВедомостьПоПродажам", ПараметрыОтчёта, ОтборОтчёта);	
	П = Новый Структура("ПользовательскиеНастройки, СформироватьПриОткрытии", ПользовательскиеНастройки, Истина);
	ОткрытьФорму("Отчет.ВедомостьПоПродажам.ФормаОбъекта", П);
КонецПроцедуры
