
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ШаблонПодписи = ТекущийОбъект.ШаблонПодписи.Получить();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ШаблонПодписи = Новый ХранилищеЗначения(ШаблонПодписи, Новый СжатиеДанных(9));
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Не ПроверитьЗаполнение() Тогда
		Отказ = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьРеквизитов();
КонецПроцедуры

#КонецОбласти 

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура ТестСоединения(Команда)
	Записать();
	ТестСоединенияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТестСоединенияНаСервере()
	Подключение = РаботаСЭлектроннойПочтой.Подключиться(Объект.Ссылка);
	Если Подключение.Подключено Тогда
		Сообщить(Нстр("fr = 'Connexion établie'; ru = 'Соединение установлено'; en = 'The connection is established'; es = 'Conexión establecida'"));
		Подключение.Почта.Отключиться();
	Иначе
		Сообщить(Подключение.Описание);	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОдинаковыеДанныеАутентификацииПриИзменении(Элемент)
	УстановитьВидимостьРеквизитов();
КонецПроцедуры

#КонецОбласти

#Область Дополнительно

&НаКлиенте
Процедура УстановитьВидимостьРеквизитов()
	Элементы.ПользовательSMTP.Видимость = Не Объект.ОдинаковыеДанныеАутентификации;
	Элементы.ПарольSMTP.Видимость = Не Объект.ОдинаковыеДанныеАутентификации;
	Элементы.ПользовательIMAP.Видимость = Не Объект.ОдинаковыеДанныеАутентификации;
	Элементы.ПарольIMAP.Видимость = Не Объект.ОдинаковыеДанныеАутентификации;
КонецПроцедуры	

#КонецОбласти