 
#Область Формирование_движений 
 
Процедура СформироватьДвижения(ДокОбъект) Экспорт
	Если ДокОбъект.Дата < Константы.ДатаНачалаРасчетаЗарплаты.Получить() Тогда Возврат; КонецЕсли;
	Движения = ДокОбъект.Движения;
	Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.НачислениеЗарплаты") Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ТЧСотрудники.Ссылка.Дата КАК Период,
		                      |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		                      |	ТЧСотрудники.Сотрудник КАК Сотрудник,
		                      |	ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.НачислениеПоТабелю) КАК СтатьяЗатрат,
		                      |	ТЧСотрудники.Оклад + ТЧСотрудники.Премия КАК Сумма
		                      |ИЗ
		                      |	Документ.НачислениеЗарплаты.ТЧСотрудники КАК ТЧСотрудники
		                      |ГДЕ
		                      |	ТЧСотрудники.Ссылка = &Док
		                      |	И НЕ ТЧСотрудники.Оклад + ТЧСотрудники.Премия = 0");
		Запрос.УстановитьПараметр("Док", ДокОбъект.Ссылка);
		Движения.Зарплата.Загрузить(Запрос.Выполнить().Выгрузить());
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ВыплатаЗарплаты") Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ТЧСотрудники.Ссылка.Дата КАК Период,
		                      |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		                      |	ТЧСотрудники.Сотрудник КАК Сотрудник,
		                      |	ТЧСотрудники.Сумма КАК Сумма
		                      |ИЗ
		                      |	Документ.ВыплатаЗарплаты.ТЧСотрудники КАК ТЧСотрудники
		                      |ГДЕ
		                      |	ТЧСотрудники.Ссылка = &Док");
		Запрос.УстановитьПараметр("Док", ДокОбъект.Ссылка);
		Движения.Зарплата.Загрузить(Запрос.Выполнить().Выгрузить());
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПлатёжнаяВедомостьНаАванс") Тогда	
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ТЧСотрудники.Ссылка.Дата КАК Период,
		                      |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		                      |	ТЧСотрудники.Сотрудник КАК Сотрудник,
		                      |	ТЧСотрудники.Сумма КАК Сумма,
		                      |	ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ВыплатаАванса) КАК СтатьяЗатрат
		                      |ИЗ
		                      |	Документ.ПлатёжнаяВедомостьНаАванс.ТЧСотрудники КАК ТЧСотрудники
		                      |ГДЕ
		                      |	ТЧСотрудники.Ссылка = &Док");
		Запрос.УстановитьПараметр("Док", ДокОбъект.Ссылка);
		Движения.Зарплата.Загрузить(Запрос.Выполнить().Выгрузить()); 
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПриказНаНачислениеУдержание") Тогда	
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ТЧСотрудники.Ссылка.Дата КАК Период,
		                      |	ВЫБОР
		                      |		КОГДА ТЧСотрудники.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачисленийЗарплаты.Начисление)
		                      |			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		                      |		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		                      |	КОНЕЦ КАК ВидДвижения,
		                      |	ТЧСотрудники.Сотрудник КАК Сотрудник,
		                      |	ВЫБОР
		                      |		КОГДА ТЧСотрудники.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачисленийЗарплаты.Начисление)
		                      |			ТОГДА ТЧСотрудники.Сумма
		                      |		ИНАЧЕ ТЧСотрудники.Сумма
		                      |	КОНЕЦ КАК Сумма,
		                      |	ТЧСотрудники.СтатьяЗатрат КАК СтатьяЗатрат
		                      |ИЗ
		                      |	Документ.ПриказНаНачислениеУдержание.ТЧСотрудники КАК ТЧСотрудники
		                      |ГДЕ
		                      |	ТЧСотрудники.Ссылка = &Док");
		Запрос.УстановитьПараметр("Док", ДокОбъект.Ссылка);
		Движения.Зарплата.Загрузить(Запрос.Выполнить().Выгрузить());	
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.СписаниеБезналичныхДенежныхСредств") Тогда
		Если ДокОбъект.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ВыплатаЗарплаты Тогда Возврат КонецЕсли;
		НС = Движения.Зарплата.ДобавитьРасход();
		НС.Период = ?(ЗначениеЗаполнено(ДокОбъект.ПериодРасчетаЗарплаты),ДокОбъект.ПериодРасчетаЗарплаты,ДокОбъект.Дата);
		НС.Сотрудник = ДокОбъект.Контрагент;
		НС.Сумма = ДокОбъект.Сумма;
		НС.СтатьяЗатрат = ДокОбъект.СтатьяДДС;
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.РасходныйКассовыйОрдер") Тогда
		Если ДокОбъект.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ВыплатаЗарплаты Тогда Возврат КонецЕсли;
		Если ЗначениеЗаполнено(ДокОбъект.Основание) Тогда
			Для Каждого Стр из ДокОбъект.Основание.ТЧСотрудники Цикл 
				НС = Движения.Зарплата.ДобавитьРасход();
				НС.Период = ДокОбъект.Дата;
				НС.Сотрудник = Стр.Сотрудник;
				НС.Сумма = Стр.Сумма;
				НС.СтатьяЗатрат = ДокОбъект.СтатьяДДС;
			КонецЦикла;
		Иначе
			НС = Движения.Зарплата.ДобавитьРасход();
			НС.Период = ДокОбъект.Дата;
			НС.Сотрудник = ДокОбъект.Контрагент;
			НС.Сумма = ДокОбъект.Сумма;
			НС.СтатьяЗатрат = ДокОбъект.СтатьяДДС;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры		

#КонецОбласти

#Область Расчёт_зарплаты

Функция РассчитатьПоСотруднику(Сотрудник, Дата) Экспорт
	УстановитьПривилегированныйРежим(Истина); 
	Результат = Новый Структура;
	Результат.Вставить("Оклад", РассчитатьОклад(Сотрудник, Дата));
	//Результат.Вставить("Премия", РассчитатьПремию(Сотрудник, Дата, Результат.Оклад));
	Результат.Вставить("Прочее", РассчитатьПрочиеНачисленияУдержания(Сотрудник, Дата));
	//Результат.Вставить("Итого", Результат.Оклад.Сумма + Результат.Премия.Сумма + Результат.Прочее.ВсегоНачислено - Результат.Прочее.ВсегоУдержано);
	Результат.Вставить("Итого", Результат.Оклад.Сумма + Результат.Прочее.ВсегоНачислено - Результат.Прочее.ВсегоУдержано);
	Возврат Результат;
КонецФункции

Функция РассчитатьОклад(Сотрудник, Период) Экспорт
	СтруктураОтработанноеВремя = РегистрыСведений.ОтработанноеВремяСотрудников.ПолучитьЗаМесяц(Период, Сотрудник);
	Результат = Новый Структура;
	Результат.Вставить("Сумма", 0);
	Результат.Вставить("ВыходовПланПоГрафикуПредставление", СтруктураОтработанноеВремя.ВыходовПланПоГрафикуПредставление);
	Результат.Вставить("ВыходовФактПредставление", СтруктураОтработанноеВремя.ВыходовФактПредставление);
	Результат.Вставить("ЧасовПланПоГрафику", СтруктураОтработанноеВремя.ЧасовПланПоГрафику);
	Результат.Вставить("ЧасовФакт", СтруктураОтработанноеВремя.ЧасовФакт);
	ТЗОклады = ПолучитьТаблицуОкладовСотрудникаЗаМесяц(Период, Сотрудник);
	Если СтруктураОтработанноеВремя.ЧасовПланПоГрафику = 0 Тогда
		Если Не ТЗОклады.Количество() = 0 Тогда 
			Результат.Сумма = ТЗОклады.Получить(0).Оклад;
		КонецЕсли;
	Иначе
		Для Каждого Стр Из СтруктураОтработанноеВремя.ТЗДанные Цикл
			// Получим расчетные данные
			ВариантОклада = Неопределено;
			ТекущийОклад = 0;
			Для Каждого СтрОклад Из ТЗОклады Цикл
				Если СтрОклад.Период > Стр.ДатаВыхода Тогда Продолжить КонецЕсли;
				ВариантОклада = СтрОклад.ВариантОклада;
				ТекущийОклад = СтрОклад.Оклад;
				Прервать;
			КонецЦикла;
			// Рассчитаем
			Если ВариантОклада = Перечисления.ВариантыОклада.Сменный Тогда
				Результат.Сумма = Результат.Сумма + (ТекущийОклад * ?(Стр.Факт=0,0,1) * Стр.Коэффициент);
			Иначе
				Если Результат.ЧасовПланПоГрафику = 0 Тогда Продолжить КонецЕсли;
				Результат.Сумма = Результат.Сумма + ?(Стр.План = 0,1,ТекущийОклад / СтруктураОтработанноеВремя.ВыходовПланПоГрафику*Стр.Факт/Стр.План*Стр.Коэффициент);
			КонецЕсли;		
		КонецЦикла;
	КонецЕсли;
	Возврат Результат;	
КонецФункции	

Функция РассчитатьПремию(Сотрудник, Период, Оклад)
	ТЗПоказатели = РегистрыСведений.ПлановыеПоказатели.ПолучитьПоСотруднику(Период, Сотрудник);
	Результат = Новый Структура("Сумма, ТЗПоказатели, ТЗШтрафы", 0, СоздатьТаблицуПоказателей(), СоздатьТаблицуШтрафов());	
	// Расчётные показатели
	МасПоказатели = ТЗПоказатели.НайтиСтроки(Новый Структура("SMART, IDРодитель", Ложь, ОбщегоНазначенияКлиентСервер.ПустойID()));	
	Для Каждого Стр Из МасПоказатели Цикл
		Если Стр.Веса Тогда			
			МасВеса = ТЗПоказатели.НайтиСтроки(Новый Структура("IDРодитель", Стр.ID));		
			Для Каждого СтрВеса Из МасВеса Цикл
				Стоимость = Окр(Стр.Стоимость / 100 * СтрВеса.Стоимость, 2);
				РасчётПоказателя = РассчитатьПоказатель(СтрВеса, Сотрудник, Период, Оклад, Стоимость);
				Результат.Сумма = Результат.Сумма + РасчётПоказателя.Премия;
				ДобавитьРасшифровкуПоказателя(Результат.ТЗПоказатели, Сотрудник, СтрВеса.Показатель, РасчётПоказателя.Премия, РасчётПоказателя.Пояснение, РасчётПоказателя.Комментарий);	
			КонецЦикла;
			Комментарий = "Стоимость " + Стр.Стоимость + "; Ниже порога " + Стр.Показатель.ПорогПланаОт + "% сумма входящего показателя = 0, выше рассчитывается от % выполнения плана";
		Иначе
			РасчётПоказателя = РассчитатьПоказатель(Стр, Сотрудник, Период, Оклад, Стр.Стоимость);
			Результат.Сумма = Результат.Сумма + РасчётПоказателя.Премия;	
			ДобавитьРасшифровкуПоказателя(Результат.ТЗПоказатели, Сотрудник, Стр.Показатель, РасчётПоказателя.Премия, РасчётПоказателя.Пояснение, РасчётПоказателя.Комментарий);
		КонецЕсли;
		// Итог
	КонецЦикла;
	// SMART Задачи
	МасSMART = ТЗПоказатели.НайтиСтроки(Новый Структура("SMART, IDРодитель", Истина, ОбщегоНазначенияКлиентСервер.ПустойID()));
	Для Каждого Стр Из МасSMART Цикл
		Если Стр.Стоимость = 0 Тогда Продолжить КонецЕсли;
		Если Стр.Показатель.План Тогда
			Выполнение = Окр(Стр.Факт / Стр.План * 100);
			Выполнение = ?(Выполнение > 100, 100, Выполнение);
			Премия = Окр(Стр.Стоимость / 100 * Выполнение);
			Пояснение = "Стоимость задания: " + Стр.Стоимость + "; План: " + СокрЛП(Стр.План) + "; Факт: " + СокрЛП(Стр.Факт);
		Иначе		
			Премия = ?(Стр.Факт, Стр.Стоимость, 0);
			Пояснение = "Стоимость задания: " + Стр.Стоимость + "; " + ?(Стр.Факт, "Выполнено", "Не выполнено");			
		КонецЕсли;
		ДобавитьРасшифровкуПоказателя(Результат.ТЗПоказатели, Сотрудник, Стр.Показатель, Премия, Пояснение, Стр.Комментарий);
		Результат.Сумма = Результат.Сумма + Премия;
	КонецЦикла;
	// Итоги
	Результат.Сумма = ?(Результат.Сумма < 0, 0, ВычисленияКлиентСервер.ОкрВверх(Результат.Сумма, 0)); // Если премия меньше нуля, обнуляем, окладную часть не уменьшаем
	Возврат Результат;
КонецФункции

Функция РассчитатьПрочиеНачисленияУдержания(Сотрудник, Дата)
	Результат = Новый Структура("ВсегоНачислено, ВсегоУдержано", 0, 0);
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Зарплата.СтатьяЗатрат КАК СтатьяЗатрат,
	                      |	СУММА(Зарплата.Сумма) КАК Сумма,
	                      |	Зарплата.ВидДвижения КАК ВидДвижения
	                      |ИЗ
	                      |	РегистрНакопления.Зарплата КАК Зарплата
	                      |ГДЕ
	                      |	Зарплата.Сотрудник = &Сотрудник
	                      |	И НАЧАЛОПЕРИОДА(Зарплата.Период, МЕСЯЦ) = &ПериодНачисления
	                      |	И (Зарплата.Регистратор ССЫЛКА Документ.ПриказНаНачислениеУдержание)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Зарплата.СтатьяЗатрат,
	                      |	Зарплата.ВидДвижения
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Зарплата.СтатьяЗатрат.Наименование");
	Запрос.УстановитьПараметр("ПериодНачисления", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Результат.Вставить("ТЗРасшифровка", Запрос.Выполнить().Выгрузить());
	Для Каждого Стр Из Результат.ТЗРасшифровка Цикл
		Если Стр.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
			Результат.ВсегоНачислено = Результат.ВсегоНачислено + Стр.Сумма;	
		Иначе
		    Результат.ВсегоУдержано = Результат.ВсегоУдержано + Стр.Сумма;
		КонецЕсли;
	КонецЦикла;	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область Обслуживающие_функции

Функция РассчитатьПоказатель(Стр, Сотрудник, Период, Оклад, Стоимость) Экспорт
	Результат = Новый Структура("План, Факт, Выполнение, ВыполнениеВЗачёт, Премия, Комментарий, Пояснение", 0, 0, 0, 0, "", "");
	Показатель = Стр.Показатель;
	Премия = 0;
	Если Не Показатель.АнализПродажАнализировать Тогда 
		Результат.План = Оклад.ЧасовПланПоГрафику;
		Если Показатель.ПоОтработаннымДням Тогда 
			Результат.Факт = Оклад.ЧасовФакт;
			Результат.Пояснение = "По графику: " + Оклад.ВыходовПланПоГрафикуПредставление + "; Отработано: " + Оклад.ВыходовФактПредставление + "; База: " + Стр.Стоимость;
		Иначе // Постоянная	
			Результат.Факт = Оклад.ЧасовПланПоГрафику;
			Результат.Пояснение = "Фиксированная премия независимо от количества отработанных дней";
		КонецЕсли;
	Иначе
		Если Стр.SMART Тогда // Только для весов
			Если Показатель.План Тогда
				//Результат.Выполнение = ВыполнениеВЗачёт;	
			Иначе		
				Результат.Комментарий = Результат.Комментарий + ?(Результат.Выполнение = 100, "Выполнено", "Не выполнено");
			КонецЕсли;		
		Иначе
			ТЗКоэффициентыПремии = Показатель.ТЧКоэффициентыПремии.Выгрузить();
			ПРП = ПланыВидовХарактеристик.ПоказателиРасчётаПремий;
			ВариантыАнализа = Перечисления.ВариантыАнализаПоказателей;
			Результат.План = ?(Стр.План = Неопределено, 0, Стр.План);
			Если (Не Показатель.План Или (Показатель.План и Стр.План > 0)) и Показатель.АнализПродажАнализировать Тогда 
				ВариантыАнализа = Перечисления.ВариантыАнализаПоказателей;
				// Формируем отбор
				МасСотрудники = Новый Массив;
				Если Показатель.АнализПродажВариант = ВариантыАнализа.ПоСотруднику Тогда
					МасСотрудники.Добавить(Сотрудник);
				ИначеЕсли Показатель.АнализПродажВариант = ВариантыАнализа.ПоСотрудникам Тогда	
					МасСотрудники = Показатель.ТЧАнализПродажСотрудники.ВыгрузитьКолонку("Сотрудник");		
				ИначеЕсли Показатель.АнализПродажВариант = ВариантыАнализа.ПоПодразделению Тогда	
					МасСотрудники = РегистрыСведений.ТарифныеСтавки.ПолучитьВсехСотрудниковВПодразделенииСотрудника(Сотрудник, Период);
				//ИначеЕсли Показатель.АнализПродажВариант = ВариантыАнализа.ПоПодразделениям Тогда	
				//	МасСотрудники = РегистрыСведений.ТарифныеСтавки.ПолучитьВсехСотрудниковВПодразделении(Показатель.ТЧАнализПродажПодразделения.ВыгрузитьКолонку("Подразделение"), Период);	
				КонецЕсли; 
				Отбор = Новый Структура("Сотрудник", МасСотрудники);
				Отбор.Вставить("Показатель", Показатель.АнализПродажПоказатель); 
				Отбор.Вставить("Параметры", Показатель.ТЧАнализПродажПараметры.Выгрузить().ВыгрузитьКолонку("Параметр"));
				// Получаем данные
				Если Показатель.АнализПродажПоказатель = Перечисления.ПоказателиПродаж.Оплаты Тогда
					//расчет премии от оплат независимо от плана
					Результат.Факт = РегистрыНакопления.ВзаиморасчётыСПокупателями.ПолучитьОплатыПоМенеджеру(НачалоМесяца(Период), КонецДня(КонецМесяца(Период)), Сотрудник, Отбор);
					ПроцентПремии = ПланыВидовХарактеристик.ПоказателиРасчётаПремий.ПолучитьПроцентПремииПоВыполненномуПлану(ТЗКоэффициентыПремии, Результат.Факт);
					Результат.Пояснение = "Премия: " +СокрЛП(ПроцентПремии) + "% от " + Результат.Факт;	
					Премия = Окр(Результат.Факт / 100 * ПроцентПремии); 
				ИначеЕсли Показатель.АнализПродажПоказатель = Перечисления.ПоказателиПродаж.ВыручкаОтОплат  Тогда 
					//расчет премии от оплат в зависимости от процента выполнения плана по отгрузкам (выручке),
					//т.е. план/факт рассчитывается от выручки, а премия считается от оплат
					Результат.Факт = РегистрыНакопления.ВзаиморасчётыСПокупателями.ПолучитьОплатыПоМенеджеру(НачалоМесяца(Период), КонецДня(КонецМесяца(Период)), Сотрудник, Отбор);
					СтруктураПоказатель = РегистрыНакопления.Продажи.ПолучитьПроцентПланаПродажПоМенеджеру(Период, Сотрудник, Показатель); 
					ПроцентПремии = ПланыВидовХарактеристик.ПоказателиРасчётаПремий.ПолучитьПроцентПремииПоВыполненномуПлану(ТЗКоэффициентыПремии, СтруктураПоказатель.Процент);
					Результат.Пояснение = "План: " + Цел(СтруктураПоказатель.План) + "; Факт: " + Цел(СтруктураПоказатель.Факт) + "; Выполнение: " + СтруктураПоказатель.Процент + "%; Премия: " + ПроцентПремии + "% от поступивших оплат в размере " + Цел(Результат.Факт);
					Премия = Окр(Результат.Факт / 100 * ПроцентПремии); 
				ИначеЕсли Показатель.АнализПродажПоказатель = Перечисления.ПоказателиПродаж.Выручка
					Или Показатель.АнализПродажПоказатель = Перечисления.ПоказателиПродаж.Прибыль Тогда
					Результат.Факт = РегистрыНакопления.Продажи.ПолучитьСуммуПоказателяПродажПоПараметру(НачалоМесяца(Период), КонецМесяца(Период), Отбор);
					Результат.Выполнение = ?(Результат.План = 0, 100, Окр(Результат.Факт / Результат.План * 100, 0));
					ПояснениеДоп = ?(Показатель.АнализПродажПоказатель = Перечисления.ПоказателиПродаж.Выручка, "факта продажи", "прибыли");
					ПроцентПремии = ПланыВидовХарактеристик.ПоказателиРасчётаПремий.ПолучитьПроцентПремииПоВыполненномуПлану(ТЗКоэффициентыПремии, Результат.Факт);
					Результат.Пояснение = "План: " + Цел(Стр.План) + "; Факт: " + Цел(Результат.Факт) + "; Выполнение: " + Результат.Выполнение + "%; Премия: " + ПроцентПремии + "% от " + ПояснениеДоп + " в размере " + Цел(Результат.Факт);
					Премия = Окр(Результат.Факт / 100 * ПроцентПремии); 
				ИначеЕсли Показатель.АнализПродажПоказатель = Перечисления.ПоказателиПродаж.Рентабельность Тогда
					//расчет премии от процента выполнения плана по рентабельности (доля % факт. от % план. рентабельности)
					ТЗПродажиПоОтгрузкам = РегистрыНакопления.Продажи.ПолучитьТаблицуПроцентыПланаРентабельностиПоМенеджеру(Период,Сотрудник,Показатель);
					Для Каждого СтрТЗПродажиПоОтгрузкам из ТЗПродажиПоОтгрузкам Цикл
						Факт = СтрТЗПродажиПоОтгрузкам.Прибыль;
						ПроцентПремии = ПланыВидовХарактеристик.ПоказателиРасчётаПремий.ПолучитьПроцентПремииПоВыполненномуПлану(ТЗКоэффициентыПремии, СтрТЗПродажиПоОтгрузкам.Процент);
						Премия = Премия + Окр(Факт / 100 * ПроцентПремии);
					КонецЦикла;
					Результат.Пояснение = "План: " + Цел(Стр.План) + "; Премия в размере " + Цел(Премия);
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	//
	Результат.Выполнение = ?(Результат.План = 0, 100, Окр(Результат.Факт / Результат.План * 100, 0));
	Результат.ВыполнениеВЗачёт = РассчитатьВыполнениеПланаВЗачёт(Показатель, Результат.Выполнение);
	Результат.Премия = Премия; //Окр(Стоимость / 100 * Результат.ВыполнениеВЗачёт, 2);
	// Комментарий
	Результат.Комментарий = "План: " + СокрЛП(Результат.План) + "; Факт: " + СокрЛП(Результат.Факт) + "; Выполнение: " + Результат.Выполнение + "%";
	Если Результат.Выполнение <> Результат.ВыполнениеВЗачёт Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(Результат.Комментарий, "в зачёт " + Результат.ВыполнениеВЗачёт + "%", ", ");	
	КонецЕсли;
	// Пояснение
	Если ПустаяСтрока(Результат.Пояснение) Тогда
		Результат.Пояснение = СокрЛП(Стр.Показатель) + " - " + Результат.Премия + " от " + Стоимость + " (" + Результат.Комментарий + ")";
	КонецЕсли;
	Возврат Результат;
КонецФункции	

Функция РассчитатьВыполнениеПланаВЗачёт(Показатель, ВыполнениеРасчётное)
	Если Показатель.ПорогПланаДо > 0 и ВыполнениеРасчётное > Показатель.ПорогПланаДо Тогда 
		Результат = Показатель.ПорогПланаДо;
	ИначеЕсли ВыполнениеРасчётное < Показатель.ПорогПланаОт Тогда 	
		Результат = 0;	
	Иначе
		Результат = ВыполнениеРасчётное;	
	КонецЕсли;		
	Возврат Результат;	
КонецФункции

//Процедура РассчитатьПремиюОтСтоимостиПоказателя(ТЗУсловияПоказателя, ПланФактПоказателя, ВыполненноеЗначение, Премия, Пояснение, Процентное = Истина)
//	РасчётноеЗначение = ?(ПланФактПоказателя.План = 0, 0, Окр(ВыполненноеЗначение / ПланФактПоказателя.План * 100));
//	КоэффициентПремии = ПолучитьЗначениеПоУсловиюПоказателя(ТЗУсловияПоказателя, РасчётноеЗначение);
//	Премия = Окр(ПланФактПоказателя.Стоимость * КоэффициентПремии);
//	Пояснение = "План: " + ПланФактПоказателя.План + ?(Процентное, "%", "") + "; Факт: " + ?(Процентное, ВыполненноеЗначение, Цел(ВыполненноеЗначение)) + 
//				?(Процентное, "%", "") + "; Выполнение: " + РасчётноеЗначение + "%; Коэффициент: " + КоэффициентПремии + " от " + ПланФактПоказателя.Стоимость;		
//КонецПроцедуры
			
Функция СоздатьТаблицуШтрафов()
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ТЗ.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТЗ.Колонки.Добавить("Договор", Новый ОписаниеТипов("СправочникСсылка.ДоговорыСКонтрагентами"));
	ТЗ.Колонки.Добавить("Сумма", Метаданные.ОпределяемыеТипы.Сумма.Тип);
	Возврат ТЗ;
КонецФункции

Функция СоздатьТаблицуПоказателей()
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ТЗ.Колонки.Добавить("Показатель", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ПоказателиРасчётаПремий"));
	ТЗ.Колонки.Добавить("SMART", Новый ОписаниеТипов("Булево"));
	ТЗ.Колонки.Добавить("Сумма", Метаданные.ОпределяемыеТипы.Сумма.Тип);
	ТЗ.Колонки.Добавить("Пояснение", Новый ОписаниеТипов("Строка"));
	ТЗ.Колонки.Добавить("Комментарий", Новый ОписаниеТипов("Строка"));
	Возврат ТЗ;
КонецФункции
			
Процедура ДобавитьРасшифровкуПоказателя(ТЗРасшифровкаПоказателей, Сотрудник, Показатель, Сумма, Пояснение, Комментарий)
	НС = ТЗРасшифровкаПоказателей.Добавить();
	НС.Сотрудник = Сотрудник;
	НС.Показатель = Показатель;
	НС.SMART = Показатель.SMART;
	НС.Сумма = Сумма;
	НС.Пояснение = Пояснение;
	НС.Комментарий = Комментарий;
КонецПроцедуры

Процедура ДобавитьРасшифровкуШтрафа(ТЗРасшифровкаШтрафов, Сотрудник, Договор, Сумма)
	НС = ТЗРасшифровкаШтрафов.Добавить();
	НС.Сотрудник = Сотрудник;
	Если Договор <> Неопределено Тогда
		НС.Контрагент = Договор.Владелец;
		НС.Договор = Договор;
	КонецЕсли;
	НС.Сумма = Сумма;	
КонецПроцедуры
			
#КонецОбласти

#Область Остатки

Функция ПолучитьТаблицуОкладовСотрудникаЗаМесяц(Период, Сотрудник)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВЗ.Период КАК Период,
	                      |	ВЗ.Сотрудник,
	                      |	ВЗ.ВариантОклада,
	                      |	ВЗ.Оклад
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		ЗПСрезПоследних.Период КАК Период,
	                      |		ЗПСрезПоследних.Сотрудник КАК Сотрудник,
	                      |		ЗПСрезПоследних.ВариантОклада КАК ВариантОклада,
	                      |		ЗПСрезПоследних.Оклад КАК Оклад
	                      |	ИЗ
	                      |		РегистрСведений.ТарифныеСтавки.СрезПоследних(&ДатаНач, Сотрудник = &Сотрудник) КАК ЗПСрезПоследних
						  //|	
						  //|	ОБЪЕДИНИТЬ ВСЕ
						  //|	
						  //|	ВЫБРАТЬ
						  //|		ЗП.Период,
						  //|		ЗП.Сотрудник,
						  //|		ЗП.ВариантОклада,
						  //|		ЗП.Оклад
						  //|	ИЗ
						  //|		РегистрСведений.ТарифныеСтавки КАК ЗП
						  //|	ГДЕ
						  //|		ЗП.Период МЕЖДУ &ДатаНач И &ДатаКон
						  //|		И ЗП.Сотрудник = &Сотрудник
	                      |) КАК ВЗ
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Период УБЫВ");
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(КонецМесяца(Период)));
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ПолучитьОстаткиПоСотрудникам(Объект, МасСотрудники) Экспорт 
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВЗ.Сотрудник КАК Сотрудник,
	                      |	СУММА(ВЗ.Сумма) КАК Сумма,
	                      |	ВЗ.СотрудникНаименование КАК СотрудникНаименование
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		ЗарплатаОстатки.Сотрудник КАК Сотрудник,
	                      |		ЗарплатаОстатки.СуммаОстаток КАК Сумма,
	                      |		ЗарплатаОстатки.Сотрудник.Наименование КАК СотрудникНаименование
	                      |	ИЗ
	                      |		РегистрНакопления.Зарплата.Остатки(
	                      |				&НаДату,
	                      |				ВЫБОР
	                      |					КОГДА &ПоСпискуСотрудников
	                      |						ТОГДА Сотрудник В (&МасСотрудники)
	                      |					ИНАЧЕ ИСТИНА
	                      |				КОНЕЦ) КАК ЗарплатаОстатки
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		ЗарплатаОбороты.Сотрудник,
	                      |		ЗарплатаОбороты.СуммаОборот,
	                      |		ЗарплатаОбороты.Сотрудник.Наименование
	                      |	ИЗ
	                      |		(ВЫБРАТЬ
	                      |			СУММА(ЗарплатаОбороты.СуммаОборот) КАК СуммаОборот,
	                      |			ЗарплатаОбороты.Сотрудник КАК Сотрудник
	                      |		ИЗ
	                      |			РегистрНакопления.Зарплата.Обороты(
	                      |					НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ),
	                      |					КОНЕЦПЕРИОДА(&Период, МЕСЯЦ),
	                      |					Регистратор,
	                      |					ВЫБОР
	                      |						КОГДА &ПоСпискуСотрудников
	                      |							ТОГДА Сотрудник В (&МасСотрудники)
	                      |						ИНАЧЕ ИСТИНА
	                      |					КОНЕЦ) КАК ЗарплатаОбороты
	                      |		ГДЕ
	                      |			НЕ ЗарплатаОбороты.Регистратор = &Регистратор
	                      |		
	                      |		СГРУППИРОВАТЬ ПО
	                      |			ЗарплатаОбороты.Сотрудник) КАК ЗарплатаОбороты) КАК ВЗ
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВЗ.Сотрудник,
	                      |	ВЗ.СотрудникНаименование
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ВЗ.СотрудникНаименование");
	Запрос.УстановитьПараметр("НаДату", КонецМесяца(НачалоМесяца(Объект.Дата)-1));
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	Запрос.УстановитьПараметр("МасСотрудники",МасСотрудники);
	Запрос.УстановитьПараметр("ПоСпискуСотрудников",Не МасСотрудники.Количество() = 0);
	Запрос.УстановитьПараметр("Регистратор",Объект.Ссылка);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

#КонецОбласти

