
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РаботаСДокументами.МожноРедактироватьДокументВФорме(Объект.Ссылка, ЭтаФорма);
	УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("МестоХранения", Объект.МестоХранения));
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, Объект);
	КомандыТабличныхЧастейВызовСервера.ПодключитьКоманду(ЭтотОбъект, "Подменю", Элементы.ТЧТовары.КоманднаяПанель);
	Если Не ТолькоПросмотр Тогда
		КомандыТабличныхЧастейВызовСервера.ПодключитьКоманду(ЭтотОбъект, "Подбор", Элементы.ТЧТовары.КоманднаяПанель);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОперацииСПодключаемымОборудованиемКлиент.ПодключитьОборудование(УникальныйИдентификатор, Истина); 
	РассчитатьОтклонения();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	НужноПерезаполнитьПодчинённыеДокументы = Модифицированность и Не СозданиеПодчинённыхДокументов и ПолучитьПодчинённыеДокументы(Объект.Ссылка).Количество() > 0;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить(РаботаСДокументами.СвойствоЗаписьИзФормы(), Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	РассчитатьОтклонения();
	//Если НужноПерезаполнитьПодчинённыеДокументы Тогда
	//	Оп = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОПерезаполненииПодчинённыхДокументов", ЭтотОбъект);
	//	ПоказатьВопрос(Оп, Нстр("fr = 'Actualiser les documents liés?'; ru = 'Перезаполнить связанные оприходование/списание товаров?'; en = 'Should I re-fill in the related product deposits/debits?'; es = '¿Volver a cargar los productos relacionados?'"), РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да, "Внимание");	
	//КонецЕсли;
	//ПерезаполнитьПодчинённыеДокументы(Объект.Ссылка);
	//СозданиеПодчинённыхДокументов = Ложь;
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыДокументов.Завершен") Тогда 
		СоздатьОприходованиеСписаниеТоваровНаСервере();
	Иначе
		ПерезаполнитьПодчинённыеДокументы(Объект.Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, ТекущийОбъект);
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура МестоХраненияПриИзменении(Элемент)
	УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("МестоХранения", Объект.МестоХранения));
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыУпаковкаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные);
КонецПроцедуры 

&НаКлиенте
Процедура ТЧТоварыКоличествоУпаковокФактПриИзменении(Элемент)
	ТекСтр = Элементы.ТЧТовары.ТекущиеДанные;
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(ТекСтр,,, "Факт");
	ТекСтр.КоличествоУпаковокОтклонение = ТекСтр.КоличествоУпаковокФакт - ТекСтр.КоличествоУпаковок;		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТовары(Команда)
	Если Объект.ТЧТовары.Количество() > 0 Тогда
		Оп = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОПерезаполненииТоваров", ЭтотОбъект);
		ПоказатьВопрос(Оп, Нстр("fr = 'La liste des marchandises sera actualisée. Continuer?'; ru = 'Список товаров будет перезаполнен. Продолжить?'; en = 'The list of products will be updated. Continue?'; es = 'La lista de productos se reiniciará. ¿Continuar?'"), РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);	
	Иначе
		ПослеЗакрытияВопросаОПерезаполненииТоваров(КодВозвратаДиалога.Да, Неопределено);	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОстатки(Команда)
	ЗаполнитьОстаткиНаСервере();
	РассчитатьОтклонения();	
КонецПроцедуры
	
&НаКлиенте
Процедура СоздатьОприходованиеСписаниеТоваров(Команда)
	СозданиеПодчинённыхДокументов = Истина;
	РаботаСДокументамиКлиент.ЗаписатьЕслиНовый(ЭтаФорма, Истина);
	МасДокументы = СоздатьОприходованиеСписаниеТоваровНаСервере();
	Для Каждого Док Из МасДокументы Цикл
		ПоказатьЗначение(, Док);	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоЗаданиямНаПересчет(Команда)
	ЗаполнитьПоЗаданиямНаПересчетНаСервере();
	РассчитатьОтклонения();
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область Оповещения

&НаКлиенте
Процедура ПослеЗакрытияВопросаОПерезаполненииТоваров(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда Возврат КонецЕсли;
	ЗаполнитьТоварыНаСервере();
	РассчитатьОтклонения();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОПерезаполненииПодчинённыхДокументов(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда Возврат КонецЕсли;
	МасДокументы = ПерезаполнитьПодчинённыеДокументы(Объект.Ссылка);
	Для Каждого Док Из МасДокументы Цикл
		ПоказатьЗначение(, Док);	
	КонецЦикла;
КонецПроцедуры	

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ScanData" и ВводДоступен() Тогда 
		Штрихкод = ОперацииСПодключаемымОборудованиемКлиент.ПолучитьШтрихкод(ИмяСобытия, Параметр, Источник);
		СтруктураТОвара = ОбщегоНазначенияВызовСервера.ПолучитьНоменклатуруПоШтрихкоду(Штрихкод);
		Если СтруктураТОвара = Неопределено Тогда
			Оп = Новый ОписаниеОповещения("ПослеДобавленияНоменклатуры",ЭтаФорма,Новый Структура("Штрихкод",Штрихкод));
			ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента",Новый Структура("Штрихкод",Штрихкод),ЭтаФорма,,,,Оп,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Иначе
			РаботаСДокументамиКлиентСервер.ДобавитьНоменклатуруПоШтрихкоду(Штрихкод, Объект, СтруктураТОвара,,,ЭтаФорма);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область Дополнительно

&НаСервере
Процедура ЗаполнитьТоварыНаСервере()
	Объект.ТЧТовары.Загрузить(ПолучитьОстатки());	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОстаткиНаСервере()
	ТЗ = ПолучитьОстатки();
	Для Каждого Стр Из Объект.ТЧТовары Цикл
		Мас = ТЗ.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Серия", Стр.Номенклатура, Стр.Характеристика, Стр.Серия));
		Если Мас.Количество() = 0 Тогда
			Стр.КоличествоУпаковок = 0;
			Стр.Количество = 0;
		Иначе
			Стр.КоличествоУпаковок = Мас[0].КоличествоУпаковок;
			Стр.Количество = Мас[0].Количество;	
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Функция ПолучитьОстатки()
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТоварыВНаличииОстатки.Номенклатура КАК Номенклатура,
	                      |	ТоварыВНаличииОстатки.Характеристика КАК Характеристика,
	                      |	ТоварыВНаличииОстатки.Серия КАК Серия,
	                      |	ТоварыВНаличииОстатки.КоличествоОстаток КАК КоличествоУпаковок,
	                      |	ТоварыВНаличииОстатки.КоличествоОстаток КАК Количество
	                      |ИЗ
	                      |	РегистрНакопления.ТоварыВНаличии.Остатки(
	                      |			&ДатаОст,
	                      |			МестоХранения = &МестоХранения
	                      |				И (Номенклатура.ТоварнаяГруппа = &ТоварнаяГруппа
	                      |					ИЛИ &ТоварнаяГруппа = ЗНАЧЕНИЕ(Справочник.ТоварныеГруппы.ПустаяСсылка))) КАК ТоварыВНаличииОстатки
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ТоварыВНаличииОстатки.Номенклатура.Наименование,
	                      |	ТоварыВНаличииОстатки.Характеристика.Наименование,
	                      |	Серия");
	Запрос.УстановитьПараметр("ДатаОст", РаботаСДокументамиВызовСервера.ПолучитьГраницуДокумента(Объект));
	Запрос.УстановитьПараметр("МестоХранения", Объект.МестоХранения);
	Запрос.УстановитьПараметр("ТоварнаяГруппа", Объект.ТоварнаяГруппа);
	Возврат Запрос.Выполнить().Выгрузить();		
КонецФункции

&НаКлиенте
Процедура РассчитатьОтклонения()
	Для Каждого Стр Из Объект.ТЧТовары Цикл
		Стр.КоличествоУпаковокОтклонение = Стр.КоличествоУпаковокФакт - Стр.КоличествоУпаковок;	
	КонецЦикла;	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПодчинённыеДокументы(Док)
	Результат = Новый Массив;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ОприходованиеТоваров.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.ОприходованиеТоваров КАК ОприходованиеТоваров
	                      |ГДЕ
	                      |	ОприходованиеТоваров.Основание = &Док
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	СписаниеТоваров.Ссылка
	                      |ИЗ
	                      |	Документ.СписаниеТоваров КАК СписаниеТоваров
	                      |ГДЕ
	                      |	СписаниеТоваров.Основание = &Док");
	Запрос.УстановитьПараметр("Док", Док);
	Если ЗначениеЗаполнено(Док) Тогда
		Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");	
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаСервереБезКонтекста
Функция ПерезаполнитьПодчинённыеДокументы(ДокОснование)
	Результат = Новый Массив;
	МасДокументы = ПолучитьПодчинённыеДокументы(ДокОснование);
	Для Каждого Док Из МасДокументы Цикл
		ДокОбъект = Док.ПолучитьОбъект();
		ДокОбъект.Заполнить(ДокОснование);
	 	ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
		Результат.Добавить(ДокОбъект.Ссылка);
	КонецЦикла;
	Возврат Результат;
КонецФункции	

&НаСервере
Функция СоздатьОприходованиеСписаниеТоваровНаСервере()
	Результат = Новый Массив;
	//НужноОприходование = Ложь;
	//НужноСписание = Ложь;
	//Для Каждого Стр Из Объект.ТЧТовары Цикл
	//	Если Стр.КоличествоУпаковок < Стр.КоличествоУпаковокФакт Тогда
	//		НужноОприходование = Истина;	
	//	КонецЕсли;
	//	Если Стр.КоличествоУпаковок > Стр.КоличествоУпаковокФакт Тогда
	//		НужноСписание = Истина;	
	//	КонецЕсли;
	//КонецЦикла;
	МасДокументы = ПолучитьПодчинённыеДокументы(Объект.Ссылка);
	//Если НужноОприходование Тогда
		ДокОприходование = Неопределено;
		Для Каждого Док Из МасДокументы Цикл
			Если ТипЗнч(Док) <> Тип("ДокументСсылка.ОприходованиеТоваров") Тогда Продолжить КонецЕсли;
			ДокОприходование = Док;
			Прервать;
		КонецЦикла;
		Если ЗначениеЗаполнено(ДокОприходование) Тогда
			ДокОприходование = ДокОприходование.ПолучитьОбъект();
			ДокОприходование.Заполнить(Объект.Ссылка);
		Иначе	
			ДокОприходование = Документы.ОприходованиеТоваров.СоздатьДокумент();
			ДокОприходование.Заполнить(Объект.Ссылка);
			ДокОприходование.Дата = ТекущаяДатаСеанса();
			ДокОприходование.УстановитьНовыйНомер();
		КонецЕсли;
		Попытка
			ДокОприходование.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ДокОприходование.Записать(РежимЗаписиДокумента.Запись);	
		КонецПопытки;	
		Результат.Добавить(ДокОприходование.Ссылка);
	//КонецЕсли;
	//Если НужноСписание Тогда
		ДокСписание = Неопределено;
		Для Каждого Док Из МасДокументы Цикл
			Если ТипЗнч(Док) <> Тип("ДокументСсылка.СписаниеТоваров") Тогда Продолжить КонецЕсли;
			ДокСписание = Док;
			Прервать;
		КонецЦикла;
		Если ЗначениеЗаполнено(ДокСписание) Тогда
			ДокСписание = ДокСписание.ПолучитьОбъект();
			ДокСписание.Заполнить(Объект.Ссылка);	
		Иначе	
			ДокСписание = Документы.СписаниеТоваров.СоздатьДокумент();
			ДокСписание.Заполнить(Объект.Ссылка);
			ДокСписание.Дата = ТекущаяДатаСеанса();
			ДокСписание.УстановитьНовыйНомер();
		КонецЕсли;
		Попытка
			ДокСписание.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ДокСписание.Записать(РежимЗаписиДокумента.Запись);	
		КонецПопытки;
		Результат.Добавить(ДокСписание.Ссылка);
	//КонецЕсли;
	Возврат Результат
КонецФункции

&НаСервере
Процедура ЗаполнитьПоЗаданиямНаПересчетНаСервере()
	Для Каждого Стр из Объект.ТЧТовары Цикл
		Стр.КоличествоУпаковокФакт = 0;
		Стр.КоличествоФакт = 0;
	КонецЦикла;
	ТЗ = ПолучитьОстаткиПоЗаданиям();
	Для Каждого Стр Из ТЗ Цикл
		Мас = Объект.ТЧТовары.НайтиСтроки(Новый Структура("Номенклатура", Стр.Номенклатура));
		Если Мас.Количество() = 0 Тогда
			НС = Объект.ТЧТовары.Добавить();
			НС.Номенклатура = Стр.Номенклатура;
			НС.КоличествоУпаковокФакт = Стр.Количество;
			НС.КоличествоФакт = Стр.Количество;
		Иначе
			Мас[0].КоличествоУпаковокФакт = Стр.Количество;
			Мас[0].КоличествоФакт = Стр.Количество;	
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Функция ПолучитьОстаткиПоЗаданиям()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаданиеНаПересчетТЧТовары.Номенклатура КАК Номенклатура,
	|	СУММА(ЗаданиеНаПересчетТЧТовары.Количество) КАК Количество
	|ИЗ
	|	Документ.ЗаданиеНаПересчет.ТЧТовары КАК ЗаданиеНаПересчетТЧТовары
	|ГДЕ
	|	ЗаданиеНаПересчетТЧТовары.Ссылка.ПересчетТовара = &ПересчетТовара
	|	И НЕ ЗаданиеНаПересчетТЧТовары.Ссылка.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаданиеНаПересчетТЧТовары.Номенклатура";
	Запрос.УстановитьПараметр("ПересчетТовара",Объект.Ссылка);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

&НаКлиенте
Процедура Подключаемый_ВыполнитьОбщуюКоманду(Команда)
	КомандыТабличныхЧастейКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") И ВыбранноеЗначение.Свойство("Количество") Тогда
		РаботаСДокументамиКлиентСервер.ДобавитьНоменклатуруПоПодбору(Объект, ВыбранноеЗначение, , Неопределено, ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
