
Функция СформироватьСуммуПрописью(Сумма, Валюта, Локализация) Экспорт
	Стр = Валюта.ТЧПараметрыИсчисления.Найти(Локализация, "Локализация");
	Если Стр = Неопределено Тогда
		Возврат Строка(Сумма);	
	КонецЕсли;
	ФорматнаяСтрока = "Л = " + Локализация + "; ДП = False";
	Если Локализация = Перечисления.Локализации.ru_RU Тогда
		ПараметрыИсчисления = Стр.ЦелаяЧасть1 + "," + Стр.ЦелаяЧасть2 + "," + Стр.ЦелаяЧасть5 + ", м, " +
						 	Стр.ДробнаяЧасть1 + "," + Стр.ДробнаяЧасть2 + "," + Стр.ДробнаяЧасть5 + ", ж, 2";
	ИначеЕсли Локализация = Перечисления.Локализации.en_US Тогда
		ПараметрыИсчисления = Стр.ЦелаяЧасть1 + "," + Стр.ЦелаяЧасть2 + "," +
						 	Стр.ДробнаяЧасть1 + "," + Стр.ДробнаяЧасть2 + ", 2";
		ФорматнаяСтрока = ФорматнаяСтрока + "; ИИ = Использовать";					
	ИначеЕсли Локализация = Перечисления.Локализации.fr_CA Тогда
		ПараметрыИсчисления = Стр.ЦелаяЧасть1 + "," + Стр.ЦелаяЧасть2 + "," +
						 	Стр.ДробнаяЧасть1 + "," + Стр.ДробнаяЧасть2 + ", 2";
		ФорматнаяСтрока = ФорматнаяСтрока + "; ИИ = Использовать";					
	КонецЕсли;	
	Возврат ЧислоПрописью(Сумма, ФорматнаяСтрока, ПараметрыИсчисления);
КонецФункции

Функция ПолучитьПараметрыИсчисления(Сумма, Валюта, Локализация) Экспорт
	Структура = Новый Структура("ЦелаяЧасть, ДробнаяЧасть", "", "");
	Стр = Валюта.ТЧПараметрыИсчисления.Найти(Локализация, "Локализация");
	Если Стр = Неопределено Тогда
		Возврат Структура;	
	КонецЕсли;
	ЦелаяЧасть = Цел(Сумма);
	ДробнаяЧасть = Сумма - ЦелаяЧасть;
	ЦелаяЧасть = Число(Прав(ЦелаяЧасть, 1));
	ДробнаяЧасть = Число(Прав(ДробнаяЧасть, 1));
	Структура.ЦелаяЧасть = ?(ЦелаяЧасть = 1, Стр.ЦелаяЧасть1, ?(ЦелаяЧасть = 2, Стр.ЦелаяЧасть2, Стр.ЦелаяЧасть5));
	Структура.ДробнаяЧасть = ?(ДробнаяЧасть = 1, Стр.ДробнаяЧасть1, ?(ДробнаяЧасть = 2, Стр.ДробнаяЧасть2, Стр.ДробнаяЧасть5));	
	Возврат Структура;
КонецФункции	

Функция ПолучитьУстановленные() Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Валюты.Ссылка КАК Ссылка,
	                      |	Валюты.Код КАК Код,
	                      |	Валюты.Наименование КАК Наименование
	                      |ИЗ
	                      |	Справочник.Валюты КАК Валюты
	                      |ГДЕ
	                      |	Валюты.ПометкаУдаления = ЛОЖЬ");
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции	