
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДанныеСтроки = Параметры.ДанныеСтроки;
	Основание = ДанныеСтроки.Основание;
	Номенклатура = ДанныеСтроки.Номенклатура;
	Характеристика = ДанныеСтроки.Характеристика;
	УказаноНесколькоСерий = ДанныеСтроки.УказаноНесколькоСерий;
	Серия = ДанныеСтроки.Серия;
	// Применяем переданные параметры формы
	Элементы.Основание.ТолькоПросмотр = Параметры.ПараметрыФормы.БлокироватьВыборОснования;
	ЗаполнитьСписокВыбораНоменклатурыПоОснованию();
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура ОснованиеПриИзменении(Элемент)
	ЗаполнитьСписокВыбораНоменклатурыПоОснованию();
	Номенклатура = Неопределено;
	Характеристика = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Номенклатура = ВыбранноеЗначение.Номенклатура;
	Характеристика = ВыбранноеЗначение.Характеристика;
 	Серия = ВыбранноеЗначение.Серия;
  	//
	ДанныеСтроки.Упаковка = ВыбранноеЗначение.Упаковка;
	ДанныеСтроки.Цена = ВыбранноеЗначение.Цена; 
	ДанныеСтроки.ЦенаSKU = ВыбранноеЗначение.ЦенаSKU;
	ДанныеСтроки.ВидЦены = ВыбранноеЗначение.ВидЦены;
	ДанныеСтроки.СтавкаНДС = ПолучитьСтавкуНДСНаСервере();//ВыбранноеЗначение.СтавкаНДС; 
	ДанныеСтроки.КодСтроки = ВыбранноеЗначение.КодСтроки; 
КонецПроцедуры

&НаКлиенте
Процедура Подтвердить(Команда)
	Если Не ПроверитьЗаполнение() Тогда Возврат КонецЕсли;
	ДанныеСтроки.Основание = Основание;
	ДанныеСтроки.Номенклатура = Номенклатура;
	ДанныеСтроки.Характеристика = Характеристика;
	ДанныеСтроки.Серия = Серия;
	Закрыть(ДанныеСтроки);
КонецПроцедуры

#КонецОбласти

#Область Дополнительно

&НаСервере
Процедура ЗаполнитьСписокВыбораНоменклатурыПоОснованию()
	Элементы.Номенклатура.СписокВыбора.Очистить(); 
	ТЗТовары = СерииИРазмещение.ОбъединитьТоварыССериями(Основание);
	Для Каждого Стр Из ТЗТовары Цикл
		Значение = Новый Структура("Номенклатура, Характеристика, Серия, Упаковка, Цена, ЦенаSKU, ВидЦены, СтавкаНДС, КодСтроки");
		ЗаполнитьЗначенияСвойств(Значение, Стр);
		Представление = СокрЛП(Стр.НомерСтроки); 
		ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(Представление, СокрЛП(Стр.Номенклатура));
		ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(Представление, СокрЛП(Стр.Характеристика)); 
		Если РаботаСДокументамиКлиентСервер.ЕстьРеквизит(Стр,"Серия") Тогда 
			ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(Представление, СокрЛП(Стр.Серия));
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(Представление, СокрЛП(Стр.Упаковка));		
		Элементы.Номенклатура.СписокВыбора.Добавить(Значение, Представление);	
	КонецЦикла;		
КонецПроцедуры	

&НаСервере
Функция ПолучитьСтавкуНДСНаСервере()
	Возврат Номенклатура.СтавкаНДС;
КонецФункции

#КонецОбласти
