
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ДобавитьКомандуОбновить();
	Обработки.Дашборд.ПостроитьДашбордПродаж(ЭтотОбъект);
	Обработки.Дашборд.ОбновитьДашбордПродаж(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)

	ОбновитьНаСервере();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДобавитьКомандуОбновить()

	ИмяКоманды = "Обновить";
	КомандаОбновить = Команды.Добавить(ИмяКоманды);
	КомандаОбновить.Заголовок = НСтр("ru = 'Обновить'; fr = 'Actualiser'; en = 'Refresh'; es = 'Actualizar'");
	КомандаОбновить.Действие = ИмяКоманды;
	КомандаОбновить.Картинка = БиблиотекаКартинок.КруговыеСтрелки;

	КнопкаОбновить = Элементы.Добавить("КнопкаОбновить", Тип("КнопкаФормы"), Элементы.ФормаКоманднаяПанель);
	КнопкаОбновить.ИмяКоманды = ИмяКоманды;

КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()

	Обработки.Дашборд.ОбновитьДашбордПродаж(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти
