
#Область Печать

Процедура ПечатьАктаВзаимозачета(Док, Таб) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Таб.ОтображатьСетку = Ложь;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	Таб.Автомасштаб = Истина;
	Таб.КлючПараметровПечати = "Параметры_печати_Документ_КорректировкаДолга_АктВзаимозачета";
	Макет = Документы.КорректировкаДолга.ПолучитьМакет("АктВзаимозачета");
	// Шапка
	оЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	оЗаголовок.Параметры.СтрокаШапки = РаботаСДокументами.КраткоеПредставлениеДокумента(Док);
	
	ПредставлениеВалюты = Строка(Константы.ВалютаРегламентированногоУчета.Получить());
	ДебиторскаяЗадолженность = Док.ТЧДебиторскаяЗадолженность.Выгрузить();
	КредиторскаяЗадолженность = Док.ТЧКредиторскаяЗадолженность.Выгрузить();
	ДебиторскаяЗадолженность.Свернуть("ОбъектРасчётов","Сумма");
	ДебиторскаяЗадолженность.Сортировать("ОбъектРасчётов,Сумма");
	КредиторскаяЗадолженность.Свернуть("ОбъектРасчётов","Сумма");
	КредиторскаяЗадолженность.Сортировать("ОбъектРасчётов,Сумма");
	Таб.Вывести(оЗаголовок);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокДебиторки");
	//СтрокаДебиторки = НСтр("ru = '2. Задолженность %ПредставлениеДебитора% перед %ПредставлениеОрганизации% составляет "
	СтрокаДебиторки = НСтр("ru = '2. Задолженность %ПредставлениеОрганизации% перед %ПредставлениеДебитора% составляет "
	+ "%Сумма% %ПредставлениеВалюты% по следующим документам/договорам:'");
	СтрокаДебиторки = СтрЗаменить(СтрокаДебиторки,"%ПредставлениеДебитора%", Док.КонтрагентДебитор);
	СтрокаДебиторки = СтрЗаменить(СтрокаДебиторки,"%ПредставлениеОрганизации%", Док.Организация);
	СтрокаДебиторки = СтрЗаменить(СтрокаДебиторки,"%ПредставлениеВалюты%", ПредставлениеВалюты);
	СтрокаДебиторки = СтрЗаменить(СтрокаДебиторки,"%Сумма%", Формат(ДебиторскаяЗадолженность.Итог("Сумма"), "ЧЦ=15; ЧДЦ=2; ЧН=Ноль"));
	ОбластьМакета.Параметры.СтрокаДебиторки = СтрокаДебиторки;
	Таб.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("СтрокаДебиторки");
	Для каждого СтрокаЗадолженности Из ДебиторскаяЗадолженность Цикл
		ОбластьМакета.Параметры.СтрокаДокументовДеб = сокрЛП(СтрокаЗадолженности.ОбъектРасчётов) + " :" + Символы.Таб + Формат(СтрокаЗадолженности["Сумма"], "ЧЦ=15; ЧДЦ=2; ЧН=Ноль") + " " + ПредставлениеВалюты;
		Таб.Вывести(ОбластьМакета);
	КонецЦикла;

	ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокКредиторки");
	//СтрокаКредиторки = НСтр("fr = '1. Dette %ПредставлениеОрганизации% avant %ПредставлениеКредитора% '; ru = '1. Задолженность %ПредставлениеОрганизации% перед %ПредставлениеКредитора% составляет'; en = '1. The debt owed by %ПредставлениеОрганизации% to %ПредставлениеКредитора% is'; es = '1. La deuda %ПредставлениеОрганизации% a %ПредставлениеКредитора% es'")+ " ";
	СтрокаКредиторки = НСтр("fr = '1. Dette %ПредставлениеКредитора% avant %ПредставлениеОрганизации% '; ru = '1. Задолженность %ПредставлениеКредитора% перед %ПредставлениеОрганизации% составляет'; en = '1. The debt owed by %ПредставлениеКредитора% to %ПредставлениеОрганизации% is'; es = '1. La deuda del %ПредставлениеКредитора% a %ПредставлениеОрганизации% es'")+ " ";
	СтрокаКредиторки = СтрЗаменить(СтрокаКредиторки,"%ПредставлениеОрганизации%",Док.Организация);
	СтрокаКредиторки = СтрЗаменить(СтрокаКредиторки,"%ПредставлениеКредитора%",Док.КонтрагентКредитор);
	СтрокаКредиторки  = СтрокаКредиторки + Формат(КредиторскаяЗадолженность.Итог("Сумма"), "ЧЦ=15; ЧДЦ=2; ЧН=Ноль") + " " + ПредставлениеВалюты + " " +НСтр("fr = 'selon les documents/contrats suivants:'; ru = 'по следующим документам/договорам:'; en = 'according to the following documents/agreements:'; es = 'en virtud de los siguientes instrumentos / tratados:'");
	ОбластьМакета.Параметры.СтрокаКредиторки = СтрокаКредиторки;
	Таб.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("СтрокаКредиторки");
	Для каждого СтрокаЗадолженности Из КредиторскаяЗадолженность Цикл
		ОбластьМакета.Параметры.СтрокаДокументовКред = сокрЛП(СтрокаЗадолженности.ОбъектРасчётов) + " :"+ символы.Таб + Формат(СтрокаЗадолженности["Сумма"], "ЧЦ=15; ЧДЦ=2; ЧН=Ноль") + " " + ПредставлениеВалюты;
		Таб.Вывести(ОбластьМакета);
	КонецЦикла;
	
	ОбластьПодвала     = Макет.ПолучитьОбласть("Подвал");
	СтрокаВзаимозачета = НСтр("fr = '3. La compensation est effectuée sur le montant'; ru = '3. Взаимозачет производится на сумму'; en = '3. Offsetting is performed for the amount of'; es = '3. La compensación se efectúa por la suma'")+ " "
	+ Формат(КредиторскаяЗадолженность.Итог("Сумма"), "ЧЦ=15; ЧДЦ=2; ЧН=Ноль") + " " + ПредставлениеВалюты;
	ОбластьПодвала.Параметры.СтрокаВзаимозачета       = СтрокаВзаимозачета;
	ОбластьПодвала.Параметры.ПредставлениеОрганизации = Док.Организация;
	ОбластьПодвала.Параметры.ПредставлениеКредитора   = Док.КонтрагентДебитор;
	Таб.Вывести(ОбластьПодвала);
КонецПроцедуры

#КонецОбласти