
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	РаботаСДокументами.ЗаполнитьРеквизитыПоУмолчанию(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	УстановитьПривилегированныйРежим(Истина);
	РаботаСДокументами.УстановитьЗаписьВсехРегистров(Движения);
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВЗ.ОбъектРасчётов КАК ОбъектРасчётов,
	                      |	ВЗ.Сумма КАК Сумма,
	                      |	Не ВЗ.СПоставщиком КАК СПокупателем,
	                      |	СПоставщиком КАК СПоставщиком
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		ДЗ.ОбъектРасчётов КАК ОбъектРасчётов,
	                      |		ДЗ.Сумма КАК Сумма,
	                      |		Истина как СПоставщиком
	                      |	ИЗ
	                      |		Документ.КорректировкаДолга.ТЧДебиторскаяЗадолженность КАК ДЗ
	                      |	ГДЕ
	                      |		ДЗ.Ссылка = &Док) КАК ВЗ
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВЗ.ОбъектРасчётов КАК ОбъектРасчётов,
	                      |	ВЗ.Сумма КАК Сумма,
	                      |	Не ВЗ.СПоставщиком КАК СПокупателем,
	                      |	СПоставщиком КАК СПоставщиком
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		КЗ.ОбъектРасчётов КАК ОбъектРасчётов,
	                      |		КЗ.Сумма КАК Сумма,
	                      |		Ложь как СПоставщиком
	                      |	ИЗ
	                      |		Документ.КорректировкаДолга.ТЧКредиторскаяЗадолженность КАК КЗ
	                      |	ГДЕ
	                      |		КЗ.Ссылка = &Док) КАК ВЗ");
	Запрос.УстановитьПараметр("Док", ЭтотОбъект.Ссылка);
    Рез = Запрос.ВыполнитьПакет();
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ТЗДебиторскаяЗадолженность", Рез[0].Выгрузить());
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ТЗКредиторскаяЗадолженность", Рез[1].Выгрузить());
	// Формируем движения
	//РегистрыНакопления.ВзаиморасчётыСКонтрагентамиПрочие.СформироватьДвижения(ЭтотОбъект);
	РегистрыНакопления.ВзаиморасчётыСПокупателями.СформироватьДвижения(ЭтотОбъект);
	РегистрыНакопления.ВзаиморасчётыСПоставщиками.СформироватьДвижения(ЭтотОбъект);
	//РегистрыНакопления.Продажи.СформироватьДвижения(ЭтотОбъект);
	Движения.Записать();
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = ПараметрыСеанса.Пользователь;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	РаботаСДокументами.МожноРедактироватьДокумент(ЭтотОбъект, Отказ);
КонецПроцедуры




