
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Номер");
	Поля.Добавить("Дата");
	Поля.Добавить("НомерВходящегоДокумента");
	Поля.Добавить("ДатаВходящегоДокумента");
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	//СтандартнаяОбработка = Ложь;
	//Представление = Строка(Данные.ТипПлатежногоДокумента) + " исходящее";
	//Представление = Представление + " №" + ?(ЗначениеЗаполнено(Данные.НомерВходящегоДокумента), Данные.НомерВходящегоДокумента, РаботаСДокументами.СформироватьЦифровойНомер(Данные.Номер));
	//ДатаДокумента = ?(ЗначениеЗаполнено(Данные.ДатаВходящегоДокумента), Данные.ДатаВходящегоДокумента, Данные.Дата);
	//Представление = Представление + " от " + Формат(ДатаДокумента, "ДЛФ=D");	
КонецПроцедуры

Функция МассивОперацийПеречисленияВБюджет() Экспорт	
	Результат = Новый Массив;
	Результат.Добавить(Перечисления.ХозяйственныеОперации.ОплатаПоставщику);
	Результат.Добавить(Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту);
	Результат.Добавить(Перечисления.ХозяйственныеОперации.ПеречислениеНалоговИВзносов);
	Результат.Добавить(Перечисления.ХозяйственныеОперации.ПрочийРасходДенежныхСредств);	
	Возврат Результат;	
КонецФункции

Процедура УстановитьРеквизитыПлательщикаПолучателя(Объект) Экспорт
	Объект.ИННПлательщика = Объект.Организация.NIF;
	Объект.КПППлательщика = Объект.Организация.RC;
	Если РаботаСДокументамиКлиентСервер.ЕстьРеквизит(Объект.Контрагент, "NIF") Тогда
		Объект.ИННПолучателя = Объект.Контрагент.NIF;
	КонецЕсли;
	Если РаботаСДокументамиКлиентСервер.ЕстьРеквизит(Объект.Контрагент, "RC") Тогда
		Объект.КПППолучателя = Объект.Контрагент.RC;
	КонецЕсли;
КонецПроцедуры	

#Область Формирование_назначения_платежа

Функция НазначениеПлатежаПриРасчетахСРаботниками(Объект)
	Результат = "Для зачисления на счет";
	Если ЗначениеЗаполнено(Объект.Контрагент) и ТипЗнч(Объект.Контрагент) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		ТекстФИО = ОбщегоНазначения.ПросклонятьСтроку(Строка(Объект.Контрагент), ОбщегоНазначения.Падежи().Родительный, Объект.Контрагент.Пол); 
		ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(Результат, ТекстФИО, " ");
	КонецЕсли;
	Результат = Результат + Символы.ПС + "Заработная плата";	
	Возврат Результат;	
КонецФункции

Функция НазначениеПлатежаСотрудникам(Объект)
	Результат = "";
	Если ЗначениеЗаполнено(Объект.Контрагент) и ТипЗнч(Объект.Контрагент) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		ТекстФИО = ОбщегоНазначения.ПросклонятьСтроку(Строка(Объект.Контрагент), ОбщегоНазначения.Падежи().Родительный, Объект.Контрагент.Пол); 
		Результат = "Для зачисления на счет";
		ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(Результат, ТекстФИО, " ");
	КонецЕсли;		
	Если ПустаяСтрока(Результат) Тогда
		Результат = "Оплата без указания назначения";
	КонецЕсли;
	ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
	Если ВалютаДокумента.Код = "643" Тогда
		ВалютаДляПечати = "руб.";
	Иначе
		ВалютаДляПечати = СокрЛП(ВалютаДокумента.Наименование);
	КонецЕсли;	
	// Сумма
	ТекстСумма = "Сумма " + Формат(Объект.Сумма, "ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ=") + ВалютаДляПечати;
	ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(Результат, ТекстСумма, Символы.ПС); 
	// НДС	
	ТЗОснования = Объект.ТЧОснования.Выгрузить();
	ТекстСуммаНДС = ТекстСуммаНДСПлатежа(Объект.Организация, ВалютаДокумента, ТЗОснования, Истина);	
	РазместитьТекстСуммыНДС(Результат, ТекстСуммаНДС);	
	Возврат Результат;	
КонецФункции

Функция НазначениеПлатежа(Объект)
	Результат = "";
	ТЗОснования = Объект.ТЧОснования.Выгрузить();
	СуммаОснований = ТЗОснования.Итог("Сумма"); 
	СуммаАвансов = Объект.Сумма - СуммаОснований;
	ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
	Если ВалютаДокумента.Код = "643" Тогда
		ВалютаДляПечати = "руб.";
	Иначе
		ВалютаДляПечати = СокрЛП(ВалютаДокумента.Наименование);
	КонецЕсли;	
	ПредставленияДокументов = ПолучитьПредставленияДокументов();	
	Для Каждого Стр Из ТЗОснования Цикл
		Если Не ЗначениеЗаполнено(Стр.Основание) Тогда Продолжить КонецЕсли;
		ВидДокумента = "";
		ПредставленияДокументов.Свойство(Стр.Основание.Метаданные().Имя, ВидДокумента);
		Если ЗначениеЗаполнено(ВидДокумента) Тогда
			ПредставлениеДляПечати = ВидДокумента;
			ДокОснование = Стр.Основание;
			Если ТипЗнч(ДокОснование) = Тип("ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств") Или ТипЗнч(ДокОснование) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
				НомерДокумента = ?(ЗначениеЗаполнено(ДокОснование.НомерВходящегоДокумента), ДокОснование.НомерВходящегоДокумента, РаботаСДокументами.СформироватьЦифровойНомер(ДокОснование.Номер));
				ДатаДокумента = ?(ЗначениеЗаполнено(ДокОснование.ДатаВходящегоДокумента), ДокОснование.ДатаВходящегоДокумента, ДокОснование.Дата);
			Иначе
				НомерДокумента = РаботаСДокументами.СформироватьЦифровойНомер(ДокОснование.Номер);
				ДатаДокумента = ДокОснование.Дата;
			КонецЕсли;
			ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(ПредставлениеДляПечати, НомерДокумента, " №");
			ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(ПредставлениеДляПечати, Формат(ДатаДокумента, "ДЛФ=D"), " от ");
			ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(ПредставлениеДляПечати, "Сумма " + Формат(Стр.Сумма, "ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ="), " ");
            ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(ПредставлениеДляПечати, ВалютаДляПечати, " ");
           	ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(Результат, ПредставлениеДляПечати, ", "); 
		КонецЕсли;
	КонецЦикла;	
	Если СуммаАвансов > 0 Тогда		
		Если СуммаОснований > 0 Тогда 
			ТекстНераспределённого = "без указания назначения ";
		Иначе
			ТекстНераспределённого = "договору № " + Объект.Договор.Код + " от " + Формат(Объект.Договор.ДатаДоговора, "ДЛФ=D");	
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(Результат, ТекстНераспределённого + Формат(СуммаАвансов, "ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ=") + " " + ВалютаДляПечати, ", ");
	КонецЕсли;
	Результат = "Оплата по " + Результат;
	Если Прав(Результат, 1) <> "." Тогда
		Результат = Результат + ".";
	КонецЕсли;	
	ТекстСуммаНДС = ТекстСуммаНДСПлатежа(Объект.Организация, ВалютаДокумента, ТЗОснования, Истина);	
	РазместитьТекстСуммыНДС(Результат, ТекстСуммаНДС);
	Возврат Результат;	
КонецФункции

Функция ТекстСуммаНДСПлатежа(Организация, ВалютаДокумента, ТЗОснования, ДобавлятьТекстВТомЧисле) Экспорт
	Результат = "";
	ТЗНДС = ТЗОснования.Скопировать(, "СтавкаНДС, СуммаНДС");
	ТЗНДС.Очистить();
	Для Каждого Стр Из ТЗОснования Цикл
		Если Стр.НесколькоСтавокНДС и ЗначениеЗаполнено(Стр.РасшифровкаНДС) Тогда
			МасРасшифровкаНДС = ОбщегоНазначенияКлиентСервер.КонвертироватьИзJSON(Стр.РасшифровкаНДС);
			Для Каждого СтрНДС Из МасРасшифровкаНДС Цикл
				НС = ТЗНДС.Добавить();
	           	НС.СтавкаНДС = Справочники.СтавкиНДС.НайтиПоРеквизиту("Ставка",СтрНДС.Получить("СтавкаНДС"));
				НС.СуммаНДС = СтрНДС.Получить("СуммаНДС");
			КонецЦикла;	
		Иначе
			НС = ТЗНДС.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Стр);
		КонецЕсли;	
	КонецЦикла;
	ТЗНДС.Свернуть("СтавкаНДС", "СуммаНДС");	
	Если ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить() Тогда
		ПредставлениеВалюты = "руб.";
	Иначе
		ПредставлениеВалюты = СокрЛП(ВалютаДокумента);
	КонецЕсли;	
	Для Каждого Стр Из ТЗНДС Цикл
		Если Стр.СтавкаНДС.Ставка = 0 Или Не ЗначениеЗаполнено(Стр.СтавкаНДС) Тогда Продолжить КонецЕсли;
		СтрокаНДС = "НДС (" + Стр.СтавкаНДС + ") " + Формат(Стр.СуммаНДС, "ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ=") + " " + ПредставлениеВалюты;
		ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(Результат, СтрокаНДС, ", ");
	КонецЦикла;
	Если ПустаяСтрока(Результат) Тогда
		Результат = "Без налога (НДС)";
	Иначе
		Если ДобавлятьТекстВТомЧисле Тогда
			Результат = "В т.ч." + " " + Результат;
		КонецЕсли;
	КонецЕсли;	
	Возврат Результат;	
КонецФункции

Функция ПолучитьПредставленияДокументов()
	Результат = Новый Структура;
	Результат.Вставить("ПоступлениеТоваровУслуг", "накладной");
	Результат.Вставить("РеализацияТоваровУслуг", "накладной");
   	Результат.Вставить("ПоступлениеБезналичныхДенежныхСредств", "платёжному поручению");
	Возврат Результат;	
КонецФункции

Процедура РазместитьТекстСуммыНДС(НазначениеПлатежа, ТекстСуммаНДС)
	ДлинаТекстаПолучателей = СтрДлина(НазначениеПлатежа);
	ДлинаТекстаНДС = СтрДлина(ТекстСуммаНДС);	
	Если ДлинаТекстаПолучателей + ДлинаТекстаНДС > 210 Тогда		
		ДлинаТекстаПолучателей = 207 - ДлинаТекстаНДС;
		НазначениеПлатежа = Лев(НазначениеПлатежа, ДлинаТекстаПолучателей);
		ТекстПоискаПоследнегоНазначения = НазначениеПлатежа;
		ПозицияПоследнейЗапятой = 0;
		ПозицияЗапятой = СтрНайти(ТекстПоискаПоследнегоНазначения, ",");		
		Пока Не ПозицияЗапятой = 0 Цикл			
			ПозицияПоследнейЗапятой = ПозицияПоследнейЗапятой + ПозицияЗапятой;
			ТекстПоискаПоследнегоНазначения = Сред(ТекстПоискаПоследнегоНазначения, ПозицияЗапятой + 1);
			ПозицияЗапятой = СтрНайти(ТекстПоискаПоследнегоНазначения, ",");			
		КонецЦикла;		
		НазначениеПлатежа = Лев(НазначениеПлатежа, ПозицияПоследнейЗапятой - 1) + "...";		
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(НазначениеПлатежа, ТекстСуммаНДС, Символы.ПС);	
КонецПроцедуры	

#КонецОбласти
