
Процедура ПечатьЗаказа(Док, Таб) Экспорт
	Макет = Документы.ЗаказПокупателя.ПолучитьМакет("Заказ");
	// Шапка
	оЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	оЗаголовок.Параметры.ТекстЗаголовка = "Commande client № " + Док.Номер + " de " + Формат(Док.Дата, "ДЛФ=DD");
	//оЗаголовок.Параметры.АдресДоставки = Док.Контрагент.Наименование;
	//оЗаголовок.Параметры.Маршрут = Справочники.Маршруты.ПолучитьПоТорговойТочке(Док.Контрагент);
	Таб.Вывести(оЗаголовок);
	
	оПоставщик = Макет.ПолучитьОбласть("Поставщик");
	КарточкаОрганизации = Справочники.Контрагенты.ПолучитьКарточку(Док.Организация, Док.Дата);
	оПоставщик.Параметры.ПредставлениеПоставщика = КарточкаОрганизации.Наименование 
	+ ", ICE " + КарточкаОрганизации.Реквизиты.ICE + ", " 
	+ КарточкаОрганизации.АдресЮридический;
	Таб.Вывести(оПоставщик);
	
	оПокупатель = Макет.ПолучитьОбласть("Покупатель");
	КарточкаПокупателя = Справочники.Контрагенты.ПолучитьКарточку(Док.Контрагент, Док.Дата);
	оПокупатель.Параметры.ПредставлениеПокупателя = КарточкаПокупателя.Наименование
	+ ", ICE " + КарточкаПокупателя.Реквизиты.ICE + ", " 
	+ КарточкаПокупателя.АдресЮридический + ", tel.: " + КарточкаПокупателя.Телефоны;
	Таб.Вывести(оПокупатель);
	
	оШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	Таб.Вывести(оШапкаТаблицы);
	// Строки
	Рез = ПолучитьТоварыПоГруппировкам(Док);
	ВыбГруппа = Рез.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	Ном = 1;
	Пока ВыбГруппа.Следующий() Цикл
		оГруппа = Макет.ПолучитьОбласть("Группа");
		оГруппа.Параметры.Наименование = ?(ЗначениеЗаполнено(ВыбГруппа.Группа), ВыбГруппа.Группа, "Autres");
		Таб.Вывести(оГруппа);
		Выб = ВыбГруппа.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока Выб.Следующий() Цикл
			оСтрока = Макет.ПолучитьОбласть("Строка");
			оСтрока.Параметры.Заполнить(Выб);
			оСтрока.Параметры.НомерСтроки = Ном;
			оСтрока.Параметры.Товар = ОбщегоНазначенияКлиентСервер.ПредставлениеНоменклатуры(Выб.Номенклатура, Выб.Характеристика);	
			Таб.Вывести(оСтрока);
			Ном = Ном + 1;	
		КонецЦикла;	
	КонецЦикла;	
 	// Подвал
	ОбластьПодвалСчета = Макет.ПолучитьОбласть("ПодвалЗаказа");
	ОбластьПодвалСчета.Параметры.ФиоИсполнителя = Справочники.ДоговорыСКонтрагентами.ПолучитьКуратораДоговора(Док.Договор, Док.Дата).Менеджер;
	Таб.Вывести(ОбластьПодвалСчета);
	Таб.ОтображатьСетку = Ложь;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.АвтоМасштаб = Истина;
	Таб.ИспользуемоеИмяФайла = РаботаСДокументами.КраткоеПредставлениеДокумента(Док, "Commande client");
КонецПроцедуры

Функция ПолучитьТоварыПоГруппировкам(Док) Экспорт
	ТипДокумента = Док.ПолучитьОбъект().Метаданные().Имя;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВЫРАЗИТЬ(ТЗДопСведения.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	                      |	ВЫРАЗИТЬ(ТЗДопСведения.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
	                      |	ВЫРАЗИТЬ(ТЗДопСведения.Описание КАК СТРОКА) КАК Описание
	                      |ПОМЕСТИТЬ ВТДопСведения
	                      |ИЗ
	                      |	&ТЗДопСведения КАК ТЗДопСведения
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТЧТовары.КодСтроки КАК КодСтроки,
	                      |	ТЧТовары.Номенклатура КАК Номенклатура,
	                      |	ТЧТовары.Характеристика КАК Характеристика,
	                      |	ТЧТовары.КоличествоУпаковок КАК Количество,
	                      |	ВЫБОР
	                      |		КОГДА ТЧТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	                      |			ТОГДА ТЧТовары.Номенклатура.Единица
	                      |		ИНАЧЕ ТЧТовары.Упаковка
	                      |	КОНЕЦ КАК Единица,
	                      |	ЕСТЬNULL(ВТДопСведения.Описание, """") КАК Комментарий,
	                      |	ВЫБОР
	                      |		КОГДА ТЧТовары.Номенклатура.Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	                      |			ТОГДА ТЧТовары.Номенклатура.Родитель
	                      |		КОГДА ТЧТовары.Номенклатура.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	                      |			ТОГДА ТЧТовары.Номенклатура.Родитель
	                      |		КОГДА ТЧТовары.Номенклатура.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	                      |			ТОГДА ТЧТовары.Номенклатура.Родитель.Родитель
	                      |		КОГДА ТЧТовары.Номенклатура.Родитель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	                      |			ТОГДА ТЧТовары.Номенклатура.Родитель.Родитель.Родитель
	                      |	КОНЕЦ КАК Группа
	                      |ИЗ
	                      |	Документ."+ТипДокумента+".ТЧТовары КАК ТЧТовары
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТДопСведения КАК ВТДопСведения
	                      |		ПО ТЧТовары.Номенклатура = ВТДопСведения.Номенклатура
	                      |			И ТЧТовары.Характеристика = ВТДопСведения.Характеристика
	                      |ГДЕ
	                      |	ТЧТовары.Ссылка = &Док
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Группа,
	                      |	ТЧТовары.Номенклатура.Наименование
	                      |ИТОГИ ПО
	                      |	Группа");	
	Запрос.УстановитьПараметр("Док", Док);
	Запрос.УстановитьПараметр("ТЗДопСведения", РегистрыСведений.ДополнительныеСведенияНоменклатуры.ПолучитьПоКонтрагенту(Док.Контрагент));
	Возврат Запрос.Выполнить();
КонецФункции

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	Если РольДоступна("ECommerce") Тогда
		СтандартнаяОбработка = Ложь;
		Если ВидФормы = "ФормаОбъекта" Тогда
			ВыбраннаяФорма = "ФормаДокументаECommerce";	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


