#Область ПрограммныйИнтерфейс

// Позволяет скорректировать состав отчетов, фактически реализованных в прикладном решении
// и использующих возможности подсистемы СправкиРасчеты.
//
// Параметры:
//  ИменаОтчетов - Массив - Модифицируемый параметр: имена отчетов.
//
Процедура УстановитьИспользуемыеСправкиРасчеты(ИменаОтчетов) Экспорт
	
КонецПроцедуры

// Проверяет нужен ли для переданного типа сложный подбор.
//
// Параметры:
//  ТипЭлемента  - Тип - что нужно проверить.
//  СложныйПодбор - возвращаемое значение. Истина, если нужна сложная обработка подбора; Ложь - в противном случае.
//
Процедура ЭтоТипЭлементаСоСложнымПодбором(ТипЭлемента, СложныйПодбор) Экспорт
	
	Если ТипЭлемента = Тип("СправочникСсылка.БанковскиеСчета") 
	 Или ТипЭлемента = Тип("СправочникСсылка.СтруктураПредприятия") 
	 Или ТипЭлемента = Тип("СправочникСсылка.ДоговорыСКонтрагентами")
	 Тогда
		
		СложныйПодбор = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Позволяет задать макет оформления в стиле прикладного решения.
//
// Параметры:
//  ЗначениеПоУмолчанию	- Строка - Модифицируемый параметр: имя общего макета.
//
Процедура УстановитьИмяМакетаОформленияПоУмолчанию(ЗначениеПоУмолчанию) Экспорт
	
	
КонецПроцедуры

// Определяет, насколько период отчета обычно отличается от периода, включающего сегодняшний день.
//
// Параметры:
//  Смещение  - Число - Возвращаемый параметр: смещение в месяцах, отрицательное для завершившихся периодов.
//  ИмяОтчета - Строка - Имя отчета.
//
Процедура УстановитьСмещениеПериодаОтчета(Смещение, Знач ИмяОтчета) Экспорт
	
	Смещение = БухгалтерскиеОтчетыКлиентСерверБП.СмещениеПериодаОтчета(ИмяОтчета);
	
КонецПроцедуры

#КонецОбласти

#Область ОпределениеТипов

// Функция описание типа договора.
//
// Параметры:
//	ЗначениеКонтрагента - СправочникСсылка.Контрагенты, СправочникСсылка.Организации, Неопределено - 
//		Ссылка для определения типа контрагента, договоры которого необходимо получить.
//
// Возвращаемое значение:
//	ОписаниеТипов - Описание типов справочник, содержащих договоры.
//
Функция ПолучитьОписаниеТиповДоговора() Экспорт
	
	Возврат Новый ОписаниеТипов("СправочникСсылка.ДоговорыСКонтрагентами");
	
КонецФункции

// Функция возвращает тип банковского счета организации.
//
// Возвращаемое значение:
//	Тип - Тип справочника с банковскими счетами организации.
//
Функция ТипЗначенияБанковскогоСчетаОрганизации() Экспорт
	
	Возврат Тип("СправочникСсылка.БанковскиеСчета");

КонецФункции

// Функция ПолучитьОписаниеТиповБанковскогоСчетаОрганизации ОписаниеТипов
// для банковских счетов организаций.
//
// Возвращаемое значение:
//	ОписаниеТипов - Описание типов справочника с банковскими счетами организаций.
//
Функция ПолучитьОписаниеТиповБанковскогоСчетаОрганизации() Экспорт

	Возврат Новый ОписаниеТипов("СправочникСсылка.БанковскиеСчета");	

КонецФункции // ПолучитьОписаниеТиповБанковскогоСчетаОрганизации()

// Функция ПолучитьОписаниеТиповНоменклатурнойГруппы возвращает 
// тип для номенклатурной группы.
//
// Возвращаемое значение:
//	ОписаниеТипов - Описание типа справочника для вида субконто "Номенклатурные группы".
//
Функция ПолучитьОписаниеТиповНоменклатурнойГруппы() Экспорт

	Возврат Новый ОписаниеТипов("СправочникСсылка.НоменклатурныеГруппы");

КонецФункции

// Функция ОписаниеТиповПодразделения возвращает 
// описание типов для справочника подразделений.
//
// Возвращаемое значение:
//	ОписаниеТипов - Описание типов справочника для подразделений.
//
Функция ОписаниеТиповПодразделения() Экспорт

	Возврат Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций");

КонецФункции

// Функция возвращает тип для справочника подразделений.
//
// Возвращаемое значение:
//	Тип - Тип справочника подразделений.
//
Функция ТипПодразделения() Экспорт
	
	Возврат Тип("СправочникСсылка.СтруктураПредприятия");

КонецФункции

#КонецОбласти