// +GAN  29/10/2025
#Область СлужебныйПрограммныйИнтерфейс

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	СсылкаНаКартинку = ПолучитьНавигационнуюСсылку(Объект.Ссылка,"Картинка"); 
	элементы.СсылкаНаКартинку.Доступность = РольДоступна("Администратор"); 
    элементы.ОтражатьвЛКП.Доступность = РольДоступна("Администратор"); 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УсловнаяВидимость();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЭтоАдресВременногоХранилища(СсылкаНаКартинку)  Тогда 
		ФайлКартинки = ПолучитьИзВременногоХранилища(СсылкаНаКартинку); 
		ТекущийОбъект.Картинка = Новый ХранилищеЗначения(ФайлКартинки); 
		ТекущийОбъект.КартинкаРасширение = ЭтаФорма["СсылкаНаКартинкуРасширение"];
		УдалитьИзВременногоХранилища(СсылкаНаКартинку); 
		СсылкаНаКартинку = ПолучитьНавигационнуюСсылку(Объект.Ссылка,"Картинка"); 
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область УправлениеПользователем
&НаКлиенте
Процедура УсловнаяВидимость()
   элементы.СсылкаНаКартинку.Видимость = объект.ОтражатьвЛКП;   
КонецПроцедуры

&НаКлиенте
Процедура ОтражатьвЛКППриИзменении(Элемент)
	УсловнаяВидимость();
КонецПроцедуры

#КонецОбласти

#Область РаботаСИзображением

&НаКлиенте
Процедура СсылкаНаКартинкуНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; 
	Режим = РежимДиалогаВыбораФайла.Открытие; 
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытия.ПолноеИмяФайла = ""; 
	Фильтр = "Файл изображения(*.png,*.jpg)|*.png;*.jpg"; 
	ДиалогОткрытия.Фильтр = Фильтр; 
	ДиалогОткрытия.МножественныйВыбор = Ложь; 
	ДиалогОткрытия.Заголовок = "Выберите файл для загрузки"; 
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗагрузкиФайла",ЭтаФорма); 
	ДиалогОткрытия.Показать(ОписаниеОповещения);	
КонецПроцедуры

&НаКлиенте 
Процедура ПослеЗагрузкиФайла(ВыбранныйФайл,ДопПараметр) Экспорт 
	Если ВыбранныйФайл = Неопределено Тогда 
		Возврат; 
	КонецЕсли; 
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПомещенияФайла", ЭтаФорма); 
	НачатьПомещениеФайла(ОписаниеОповещения,, ВыбранныйФайл[0], Ложь, УникальныйИдентификатор); 
КонецПроцедуры

&НаКлиенте 
Процедура ПослеПомещенияФайла(Результат, Адрес, ВыбранноеИмяФайла,ДопПараметры) Экспорт 
	Если Не Результат Тогда 
		Возврат; 
	КонецЕсли;        
	СсылкаНаКартинкуРасширение = ПолучитьРасширениеИмениФайла(ВыбранноеИмяФайла);
	СсылкаНаКартинку = Адрес; 
	Модифицированность = Истина; 
КонецПроцедуры     

Функция ПолучитьРасширениеИмениФайла(Знач ИмяФайла)  
	РасширениеФайла = "";  
	МассивСтрок = СтрРазделить(ИмяФайла, ".", Ложь);  
	Если МассивСтрок.Количество() > 1 Тогда  
		РасширениеФайла = МассивСтрок[МассивСтрок.Количество() - 1];  
	КонецЕсли;  
	Возврат РасширениеФайла;  
КонецФункции 

#КонецОбласти
// -GAN  29/10/2025  
