
Функция ПолучитьКарточку(Владелец, ДатаСреза, ПолучитьОтветственныхТолькоПоУставу = Ложь) Экспорт
	Результат = Новый Структура;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Контрагенты.Ссылка КАК Владелец,
	                      |	Контрагенты.Наименование КАК Наименование,
	                      |	Контрагенты.НаименованиеПолное КАК НаименованиеПолное
	                      |ИЗ
	                      |	Справочник.Контрагенты КАК Контрагенты
	                      |ГДЕ
	                      |	Контрагенты.Ссылка = &Владелец
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	Организации.Ссылка,
	                      |	Организации.Наименование,
	                      |	Организации.НаименованиеПолное
	                      |ИЗ
	                      |	Справочник.Организации КАК Организации
	                      |ГДЕ
	                      |	Организации.Ссылка = &Владелец
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	БанковскиеСчета.Ссылка КАК БанковскийСчёт,
	                      |	БанковскиеСчета.НомерСчёта КАК НомерСчёта,
	                      |	БанковскиеСчета.Банк.Наименование КАК Банк,
	                      |	БанковскиеСчета.Банк.Код КАК БИК,
	                      |	БанковскиеСчета.Банк.КоррСчёт КАК КоррСчёт,
	                      |	БанковскиеСчета.Основной КАК Основной
	                      |ИЗ
	                      |	Справочник.БанковскиеСчета КАК БанковскиеСчета
	                      |ГДЕ
	                      |	БанковскиеСчета.Владелец = &Владелец
	                      |	И БанковскиеСчета.ПометкаУдаления = ЛОЖЬ
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВидыРеквизитовКонтрагентов.Ссылка КАК Реквизит,
	                      |	ЕСТЬNULL(РеквизитыКонтрагентов.Представление, """") КАК Представление
	                      |ИЗ
	                      |	ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов КАК ВидыРеквизитовКонтрагентов
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыКонтрагентов КАК РеквизитыКонтрагентов
	                      |		ПО ВидыРеквизитовКонтрагентов.Ссылка = РеквизитыКонтрагентов.Реквизит
	                      |			И (РеквизитыКонтрагентов.Контрагент = &Владелец)
	                      |ГДЕ
	                      |	ВидыРеквизитовКонтрагентов.Предопределенный = ИСТИНА
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВЗ.ТипОтветственного КАК ТипОтветственного,
	                      |	ВЗ.ОтветственноеЛицо КАК ОтветственноеЛицо,
	                      |	ВЗ.Фамилия КАК Фамилия,
	                      |	ВЗ.Имя КАК Имя,
	                      |	ВЗ.Отчество КАК Отчество,
	                      |	ВЗ.Должность КАК Должность,
	                      |	ВЗ.ПравоПодписиДатаДокумента КАК ПравоПодписиДатаДокумента,
	                      |	ВЗ.ПравоПодписиНомерДокумента КАК ПравоПодписиНомерДокумента,
	                      |	ВЫБОР
	                      |		КОГДА ВЗ.ОснованиеПраваПодписи = ЗНАЧЕНИЕ(Перечисление.ОснованияПраваПодписи.Устав)
	                      |			ТОГДА """"
	                      |		КОГДА ВЗ.ОснованиеПраваПодписи = ЗНАЧЕНИЕ(Перечисление.ОснованияПраваПодписи.Доверенность)
	                      |			ТОГДА ""доверенность №"" + ВЗ.ПравоПодписиНомерДокумента + "" от ""
	                      |		КОГДА ВЗ.ОснованиеПраваПодписи = ЗНАЧЕНИЕ(Перечисление.ОснованияПраваПодписи.Приказ)
	                      |			ТОГДА ""приказ №"" + ВЗ.ПравоПодписиНомерДокумента + "" от ""
	                      |	КОНЕЦ КАК ОснованиеПраваПодписи,
	                      |	""действующего на основании "" + ВЫБОР
	                      |		КОГДА ВЗ.ОснованиеПраваПодписи = ЗНАЧЕНИЕ(Перечисление.ОснованияПраваПодписи.Устав)
	                      |			ТОГДА ""устава""
	                      |		КОГДА ВЗ.ОснованиеПраваПодписи = ЗНАЧЕНИЕ(Перечисление.ОснованияПраваПодписи.Доверенность)
	                      |			ТОГДА ""доверенности №"" + ВЗ.ПравоПодписиНомерДокумента + "" от ""
	                      |		КОГДА ВЗ.ОснованиеПраваПодписи = ЗНАЧЕНИЕ(Перечисление.ОснованияПраваПодписи.Приказ)
	                      |			ТОГДА ""приказа №"" + ВЗ.ПравоПодписиНомерДокумента + "" от ""
	                      |	КОНЕЦ КАК ОснованиеПраваПодписиДляПечати,
	                      |	ВЗ.Фамилия + "" "" + ПОДСТРОКА(ВЗ.Имя, 1, 1) + "". "" + ПОДСТРОКА(ВЗ.Отчество, 1, 1) + ""."" КАК ДляПечати,
	                      |	ВЗ.Подпись КАК Подпись,
	                      |	ВЗ.ПодписьВысота КАК ПодписьВысота,
	                      |	ВЗ.ПодписьШирина КАК ПодписьШирина
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		ОЛ.ТипОтветственного КАК ТипОтветственного,
	                      |		ОЛ.ФизическоеЛицо КАК ОтветственноеЛицо,
	                      |		ОЛ.ФизическоеЛицо.Фамилия КАК Фамилия,
	                      |		ОЛ.ФизическоеЛицо.Имя КАК Имя,
	                      |		ОЛ.ФизическоеЛицо.Отчество КАК Отчество,
	                      |		ЕСТЬNULL(ТарифныеСтавкиСрезПоследних.Должность, ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)) КАК Должность,
	                      |		ОЛ.ОснованиеПраваПодписи КАК ОснованиеПраваПодписи,
	                      |		ОЛ.ПравоПодписиДатаДокумента КАК ПравоПодписиДатаДокумента,
	                      |		ОЛ.ПравоПодписиНомерДокумента КАК ПравоПодписиНомерДокумента,
	                      |		ОЛ.Подпись КАК Подпись,
	                      |		ОЛ.ПодписьВысота КАК ПодписьВысота,
	                      |		ОЛ.ПодписьШирина КАК ПодписьШирина
	                      |	ИЗ
	                      |		РегистрСведений.ЛицаСПравомПодписи.СрезПоследних(
	                      |				&ДатаСреза,
	                      |				Организация = &Владелец
	                      |					И ВЫБОР
	                      |						КОГДА &ПолучитьОтветственныхТолькоПоУставу
	                      |							ТОГДА ОснованиеПраваПодписи = ЗНАЧЕНИЕ(Перечисление.ОснованияПраваПодписи.Устав)
	                      |						ИНАЧЕ ИСТИНА
	                      |					КОНЕЦ) КАК ОЛ
	                      |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифныеСтавки.СрезПоследних(&ДатаСреза, ) КАК ТарифныеСтавкиСрезПоследних
	                      |			ПО ОЛ.Организация = ТарифныеСтавкиСрезПоследних.Организация
	                      |				И ОЛ.ФизическоеЛицо = ТарифныеСтавкиСрезПоследних.Сотрудник) КАК ВЗ");
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.УстановитьПараметр("ПолучитьОтветственныхТолькоПоУставу", ПолучитьОтветственныхТолькоПоУставу);
	Рез = Запрос.ВыполнитьПакет();
	// Основные данные
	ТЗВладелец = Рез[0].Выгрузить();
	Результат.Вставить("Наименование", ТЗВладелец[0].Наименование);
	Результат.Вставить("НаименованиеПолное", ТЗВладелец[0].НаименованиеПолное);
	// Банковские счета
	ТЗБанковскиеСчета = Рез[1].Выгрузить();
	МасБанковскиеСчета = Новый Массив;
	Для Каждого Стр Из ТЗБанковскиеСчета Цикл 
		Структура = Новый Структура("БанковскийСчёт, НомерСчёта, Банк, БИК, КоррСчёт, Основной");
		ЗаполнитьЗначенияСвойств(Структура, Стр);
		МасБанковскиеСчета.Добавить(Структура);
	КонецЦикла;	
	Результат.Вставить("БанковскиеСчета", МасБанковскиеСчета);
	Мас = ТЗБанковскиеСчета.НайтиСтроки(Новый Структура("Основной", Истина));
	Если Мас.Количество() = 0 Тогда
		Мас = ТЗБанковскиеСчета.НайтиСтроки(Новый Структура("Основной", Ложь));	
	КонецЕсли;
	Результат.Вставить("БанковскийСчётОсновной", ?(Мас.Количество() = 0, Справочники.БанковскиеСчета.ПустаяСсылка(), Мас[0].БанковскийСчёт));							
	// Реквизиты
	Результат.Вставить("Реквизиты", Новый Структура);
	Выб = Рез[2].Выбрать();
	Пока Выб.Следующий() Цикл
		Результат.Реквизиты.Вставить(Выб.Реквизит.ИмяПредопределенныхДанных, Выб.Представление);	
	КонецЦикла;
	Если Не ЗначениеЗаполнено(Результат.Реквизиты.АдресДоставки) Тогда
		Результат.Реквизиты.АдресДоставки = Результат.Реквизиты.АдресФактический;	
	КонецЕсли;		
	// Ответственные лица 
	ТЗОтветственные = Рез[3].Выгрузить();
	ТЗОтветственные.Колонки.Добавить("ДляПечатиПолное", Новый ОписаниеТипов("Строка"));
	Для Каждого Стр Из ТЗОтветственные Цикл
		Стр.ОснованиеПраваПодписи = Стр.ОснованиеПраваПодписи + Формат(Стр.ПравоПодписиДатаДокумента, "ДЛФ=D");
		Стр.ОснованиеПраваПодписиДляПечати = Стр.ОснованиеПраваПодписиДляПечати + Формат(Стр.ПравоПодписиДатаДокумента, "ДЛФ=D");
		Стр.ДляПечатиПолное = Стр.ДляПечати;
		ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(Стр.ДляПечатиПолное, Стр.ОснованиеПраваПодписи, ", ");
	КонецЦикла;
	Руководитель = ПолучитьОтветственногоПоТипу(ТЗОтветственные, Перечисления.ТипыОтветственныхЛиц.Руководитель);
	Результат.Вставить("Руководитель", Руководитель);
	ГлавныйБухгалтер = ПолучитьОтветственногоПоТипу(ТЗОтветственные, Перечисления.ТипыОтветственныхЛиц.ГлавныйБухгалтер);
	Результат.Вставить("ГлавныйБухгалтер", ГлавныйБухгалтер);
	Результат.Вставить("АдресЮридический", Результат.Реквизиты.АдресЮридический);
	Результат.Вставить("АдресФактический", Результат.Реквизиты.АдресФактический);
	Результат.Вставить("Телефоны", Результат.Реквизиты.Телефон);
	// Представление
	Представление = ?(ПустаяСтрока(Результат.НаименованиеПолное), Результат.Наименование, Результат.НаименованиеПолное);
	ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(Представление, Результат.Реквизиты.NIF, ", NIF ");
	ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(Представление, Результат.Реквизиты.RC, ", RC ");
	ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(Представление, Результат.Реквизиты.АдресЮридический, ", ");
	ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(Представление, Результат.Реквизиты.АдресФактический, ", ");
	ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(Представление, Результат.Реквизиты.Телефон, ", тел.: ");
	Результат.Вставить("Представление", Представление);
	Возврат Результат;
КонецФункции

Функция ПолучитьРеквизитыКарточки(Карточка, Реквизиты, РазделительРезультата = ", ") Экспорт
	Мас = СтрРазделить(Реквизиты, ",", Ложь);
	Результат = "";
	Для Каждого Реквизит Из Мас Цикл
		Реквизит = СокрЛП(Реквизит);
		Если Карточка.Свойство(Реквизит) Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(Результат, Карточка[Реквизит], РазделительРезультата); 	
		ИначеЕсли Карточка.Реквизиты.Свойство(Реквизит) Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(Результат, Карточка.Реквизиты[Реквизит], РазделительРезультата);
		ИначеЕсли Карточка.Контакты.Свойство(Реквизит) Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(Результат, Карточка.Контакты[Реквизит], РазделительРезультата);
		КонецЕсли;	
	КонецЦикла;	
	Возврат Результат;	
КонецФункции

Функция РазделитьНаименованиеНаФИО(Контрагент) Экспорт
	Результат = Новый Структура("Фамилия, Имя, Отчество", "", "", "");
	Мас = СтрРазделить(СокрЛП(Контрагент), " ", Ложь);
	Если Мас.Количество() > 0 Тогда
		Результат.Фамилия = Мас[0];			
	КонецЕсли;
	Если Мас.Количество() > 1 Тогда
		Результат.Имя = Мас[1];			
	КонецЕсли;
	Если Мас.Количество() > 2 Тогда
		Результат.Отчество = Мас[2];			
	КонецЕсли;
	Возврат Результат;
КонецФункции	

Функция СоздатьКонтрагентаПоДаннымБанковскойВыписки(ДанныеВыписки) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Результат = Новый Структура("Контрагент, БанковскийСчёт");
	НачатьТранзакцию();
	// Контрагент
	Контрагент = Справочники.Контрагенты.СоздатьЭлемент();
	
	Результат.Контрагент = Контрагент.Ссылка;	
	ЗафиксироватьТранзакцию();
	Возврат Результат;
КонецФункции

Функция ПолучитьПараметрыДоставки(Контрагент,ДатаДоставки) Экспорт
	ПараметрыДоставки = Новый Структура("ВремяДоставкиС,ВремяДоставкиПо,КомментарийЛогиста",Дата(1,1,1),Дата(1,1,1));
	СтрТЧГрафикДоставок = Контрагент.ТЧГрафикДоставок.Найти(Перечисления.ДниНедели.Получить(ДеньНедели(ДатаДоставки)-1));
	Если Не СтрТЧГрафикДоставок = Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыДоставки,СтрТЧГрафикДоставок);
	КонецЕсли;
	Возврат ПараметрыДоставки;
КонецФункции

#Область Реквизиты_по_ИНН

Функция ПолучитьРеквизитыПоИНН(ИНН) Экспорт
	Результат = Новый Структура("ОК", Истина);
	// Проверки
	Если СтрДлина(ИНН) <> 10 и СтрДлина(ИНН) <> 12 Тогда
		Результат.ОК = Ложь;
		Результат.Вставить("ОписаниеОшибки", "Введённое значение не является ИНН");
		Возврат Результат;
	КонецЕсли;
	// Получаем данные
	Определение = Новый WSОпределения("https://api.orgregister.1c.ru/orgregister/v7?wsdl");
	Сервис = Определение.Сервисы[0];
	ТочкаПодключения = Сервис.ТочкиПодключения[0];
	Прокси = Новый WSПрокси(Определение, Сервис.URIПространстваИмен, Сервис.Имя, ТочкаПодключения.Имя);  
	Прокси.Пользователь = Константы.ИТСЛогин.Получить();
	Прокси.Пароль = Константы.ИТСПароль.Получить();
	ИмяФункции = ?(СтрДлина(ИНН) = 12, "getEntrepreneurRequisitesByINN", "getCorporationRequisitesByINN");
	ТипПараметра = Прокси.ФабрикаXDTO.Пакеты.Получить(Сервис.URIПространстваИмен).Получить(ИмяФункции);
	Параметр = Прокси.ФабрикаXDTO.Создать(ТипПараметра);
	Параметр.INN = ИНН;
	Параметр.configurationName = "";
	Попытка
		ДанныеСервиса = ?(СтрДлина(ИНН) = 12, Прокси.getEntrepreneurRequisitesByINN(Параметр), Прокси.getCorporationRequisitesByINN(Параметр));
	Исключение
		Результат.ОК = Ложь;
		Результат.Вставить("ОписаниеОшибки", "Нет доступа к сервису");
		Возврат Результат;
	КонецПопытки;
	// Заполняем
	Если СтрДлина(ИНН) = 12 Тогда
		Данные = ДанныеСервиса.РеквизитыИП;
		Если Данные <> Неопределено Тогда
			Фамилия = ТРег(Данные.СвФЛ.ФИОРус.Фамилия);
			Имя = ТРег(Данные.СвФЛ.ФИОРус.Имя);
			Отчество = ТРег(Данные.СвФЛ.ФИОРус.Отчество);
			ФИО = Фамилия + " " + Имя + " " + Отчество;		
			Результат.Вставить("Наименование", ФИО);
			Результат.Вставить("НаименованиеПолное", Данные.НаимВидИП + " """ + ФИО + """");
			Результат.Вставить("ИНН", Данные.ИННФЛ);
			Результат.Вставить("КПП", "");
			Результат.Вставить("ОГРН", Данные.ОГРН);
			Результат.Вставить("ДатаРегистрации", Данные.ДатаОГРНИП);
		Иначе
			Результат.ОК = Ложь;
			Результат.Вставить("ОписаниеОшибки", "ИНН не найден");
		КонецЕсли;
	Иначе
		Данные = ДанныеСервиса.РеквизитыЮрЛица;
		Если Данные <> Неопределено Тогда
			Результат.Вставить("Наименование", Данные.СвНаимЮЛ.НаимЮЛСокр);
			Результат.Вставить("НаименованиеПолное", Данные.СвНаимЮЛ.НаимЮЛПолн);
			Результат.Вставить("ИНН", Данные.ИНН);
			Результат.Вставить("КПП", Данные.КПП);
			Результат.Вставить("ОГРН", Данные.ОГРН);
			Результат.Вставить("ДатаРегистрации", Данные.СвНаимЮЛ.ДатаОбрЮЛ);
			МасОтветственные = Новый Массив;
			Для Каждого Ответственный Из Данные.СвУправлДеят.СведДолжнФЛ Цикл
				Фамилия = ТРег(Ответственный.ФИО.Фамилия);
				Имя = ТРег(Ответственный.ФИО.Имя); 
				Отчество = ТРег(Ответственный.ФИО.Отчество);
				Должность = ОбщегоНазначенияКлиентСервер.ПерваяБукваЗаглавная(Ответственный.НаимДолжн);
				МасОтветственные.Добавить(Новый Структура("ВидОрганизации, Должность, ДатаНачалаДействия, Фамилия, Имя, Отчество", Ответственный.НаимВидДолжн, Должность, Ответственный.ДатаНачДейств, Фамилия, Имя, Отчество));	
			КонецЦикла;
			Результат.Вставить("ОтветственныеЛица", МасОтветственные);
			СтруктураАдрес = РазобратьАдрес(Данные.СвАдрес);
			Результат.Вставить("АдресЮридический", "");
		Иначе
			Результат.ОК = Ложь;
			Результат.Вставить("ОписаниеОшибки", "ИНН не найден");	
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;
КонецФункции

Функция РазобратьАдрес(Адрес)
	Результат = Новый Структура("Страна", ОбщегоНазначенияКлиентСервер.ПерваяБукваЗаглавная(Адрес.Адрес.Страна));
	Результат.Вставить("Субъект", Адрес.Адрес.Состав.СубъектРФ);
	Результат.Вставить("Город", Адрес.Адрес.Состав.Город);
	Результат.Вставить("Улица", Адрес.Адрес.Состав.Улица);	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область Дополнительно

Функция ПолучитьОтветственногоПоТипу(ТЗОтветственные, ТипОтветственного)
	Результат = Новый Структура;
	Для Каждого Колонка Из ТЗОтветственные.Колонки Цикл
		Результат.Вставить(Колонка.Имя);	
	КонецЦикла;	
	Стр = ТЗОтветственные.Найти(ТипОтветственного, "ТипОтветственного");
	Если Стр <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Результат, Стр);	
	КонецЕсли;
	Возврат Результат;
КонецФункции

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	Если РольДоступна("ECommerce") Тогда
		СтандартнаяОбработка = Ложь;
		Если ВидФормы = "ФормаОбъекта" Тогда
			ВыбраннаяФорма = "ФормаЭлементаECommerce";	
		ИначеЕсли ВидФормы = "ФормаСписка" Тогда
			ВыбраннаяФорма = "ФормаСпискаECommerce";	
		ИначеЕсли ВидФормы = "ФормаВыбора" Тогда
			ВыбраннаяФорма = "ФормаВыбораECommerce";	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


