
&НаКлиенте
Процедура НайтиПоКонтактнойИнформации(Команда)
	П = Новый Структура("РежимВыбора", Истина);
	Оп = Новый ОписаниеОповещения("ПослеЗакрытияФормыВыбораКонтактнойИнформации", ЭтаФорма);
	ОткрытьФорму("РегистрСведений.РеквизитыКонтрагентов.ФормаСписка", П, ЭтаФорма,,,, Оп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#Область Оповещения

&НаКлиенте
Процедура ПослеЗакрытияФормыВыбораКонтактнойИнформации(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если РезультатЗакрытия = Неопределено Тогда Возврат КонецЕсли;
	Элементы.Список.ТекущаяСтрока = РезультатЗакрытия;
	//ПоказатьЗначение(, РезультатЗакрытия);
КонецПроцедуры

#КонецОбласти

	



