
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Таб = Новый ТабличныйДокумент;
	Сформировать(ПараметрКоманды, Таб);	
	Таб.PageOrientation = PageOrientation.Portrait;
	Таб.FitToPage = True;
	Таб.ShowGrid = False;
	Таб.ShowHeaders = False;
	Таб.Protection = False;
	Таб.ПолеСверху = 10;
	Таб.ПолеСлева = 5;
	Таб.ПолеСнизу = 10;
	Таб.ПолеСправа = 5;
	Таб.ИмяПринтера = ОбщегоНазначенияВызовСервера.ПолучитьИмяПринтераЧековНаСервере();
	Таб.Напечатать(РежимИспользованияДиалогаПечати.НеИспользовать);
КонецПроцедуры

&НаСервере
Процедура Сформировать(ПараметрКоманды, Таб)
	Документы.ПриходныйКассовыйОрдер.ПечатьЧека(ПараметрКоманды, Таб);
КонецПроцедуры
