
#Область Интерфейс

Функция ПолучитьПоБИК(БИК, ДЗКлассификатор = Неопределено, СоздаватьПриОтсутствииВКлассификаторе = Ложь) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Банки.Ссылка
	                      |ИЗ
	                      |	Справочник.Банки КАК Банки
	                      |ГДЕ
	                      |	Банки.Код = &БИК
	                      |	И Банки.ЭтоГруппа = ЛОЖЬ");
	Запрос.УстановитьПараметр("БИК", БИК);				  
	Рез = Запрос.Выполнить();
	Банк = ?(Рез.Пустой(), Справочники.Банки.ПустаяСсылка(), Рез.Выгрузить()[0].Ссылка);
	Если Не ЗначениеЗаполнено(Банк) Тогда
		ДЗКлассификатор = ?(ДЗКлассификатор = Неопределено, ПолучитьКлассификаторБанковСРБК(), ДЗКлассификатор); // Если классификатор не передан, то получаем с сайта
		Стр = ДЗКлассификатор.Строки.Найти(БИК, "БИК", Истина);
		Если Стр <> Неопределено Тогда
			Банк = Справочники.Банки.СоздатьЭлемент();
			Банк.Родитель = ПолучитьГруппуПоБИК(Стр.Родитель.БИК, Стр.Родитель.Наименование);
			Банк.Код = СокрЛП(Стр.БИК);
			Банк.Наименование = СокрЛП(Стр.Наименование);
			Банк.Адрес = Стр.Адрес; 			
			Банк.КоррСчёт = СокрЛП(Стр.КоррСчёт);
			Банк.Город = СокрЛП(Стр.Город);
			Банк.Записать();
			Банк = Банк.Ссылка;
		КонецЕсли;	
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Банк) и СоздаватьПриОтсутствииВКлассификаторе Тогда
		Банк = Справочники.Банки.СоздатьЭлемент();
		Банк.Код = СокрЛП(БИК);
		Банк.Наименование = "Отсутствует в классификаторе - " + Банк.Код;
		Банк.Записать();
		Банк = Банк.Ссылка;	
	КонецЕсли;	
	Возврат Банк;
КонецФункции

Функция ПолучитьГруппуПоБИК(БИК, Наименование) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Банки.Ссылка
	                      |ИЗ
	                      |	Справочник.Банки КАК Банки
	                      |ГДЕ
	                      |	Банки.Код = &БИК
	                      |	И Банки.ЭтоГруппа = ИСТИНА");
	Запрос.УстановитьПараметр("БИК", СокрЛП(БИК));
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		ГруппаБанков = Справочники.Банки.СоздатьГруппу();
		ГруппаБанков.Код = СокрЛП(БИК);
		ГруппаБанков.Наименование = СокрЛП(Наименование);
		ГруппаБанков.Записать();
		ГруппаБанков = ГруппаБанков.Ссылка;
	Иначе
		ГруппаБанков = Рез.Выгрузить()[0].Ссылка;
		Если СокрЛП(ГруппаБанков.Наименование) <> СокрЛП(Наименование) Тогда
			ГруппаБанков = ГруппаБанков.ПолучитьОбъект();
			ГруппаБанков.Наименование = СокрЛП(Наименование);
			ГруппаБанков.Записать();
			ГруппаБанков = ГруппаБанков.Ссылка;
		КонецЕсли;	
	КонецЕсли;
	Возврат ГруппаБанков;
КонецФункции

Функция ПолучитьКлассификаторБанковСРБК() Экспорт
	ДЗ = Новый ДеревоЗначений;
	ДЗ.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка"));
	ДЗ.Колонки.Добавить("БИК", Новый ОписаниеТипов("Строка"));
	ДЗ.Колонки.Добавить("ТипБанка", Новый ОписаниеТипов("Строка"));
	ДЗ.Колонки.Добавить("КоррСчёт", Новый ОписаниеТипов("Строка"));
	ДЗ.Колонки.Добавить("Индекс", Новый ОписаниеТипов("Строка"));
	ДЗ.Колонки.Добавить("Город", Новый ОписаниеТипов("Строка"));
	ДЗ.Колонки.Добавить("Адрес", Новый ОписаниеТипов("Строка"));
	ДЗ.Колонки.Добавить("Телефон", Новый ОписаниеТипов("Строка"));
	ДЗ.Колонки.Добавить("Загрузка", Новый ОписаниеТипов("Булево"));
	// Получим файл
	ВремКаталог = КаталогВременныхФайлов() + "tempBik";
	СоздатьКаталог(ВремКаталог);
	ИмяФайлаЗип = ВремКаталог + "\" + "bnk.zip"; 
	КопироватьФайл("http://cbrates.rbc.ru/bnk/bnk.zip", ИмяФайлаЗип); 
	ЧтениеZip = Новый ЧтениеZipФайла(ИмяФайлаЗип);
	ЧтениеZip.ИзвлечьВсе(ВремКаталог, РежимВосстановленияПутейФайловZIP.НеВосстанавливать);
	ЧтениеZip.Закрыть();
	// Получим регионы
	Разделитель = Символы.Таб;
	Классификатор = Новый ТекстовыйДокумент;
	Классификатор.Прочитать(ВремКаталог + "\Reg.txt");
	Регионы = Новый Соответствие;
	Для А = 1 по Классификатор.КоличествоСтрок() Цикл
		Стр = Классификатор.ПолучитьСтроку(А);
		Мас = СтрРазделить(Стр, Разделитель, Ложь);
		Если Мас.Количество() < 2 Тогда Продолжить КонецЕсли;
		Регионы.Вставить(Прав("00" + Мас[0], 2), Мас[1]);
	КонецЦикла;	
	// Получим банки
	Классификатор.Прочитать(ВремКаталог + "\bnkseek.txt");
	Для А = 1 по Классификатор.КоличествоСтрок() Цикл
		Стр = Классификатор.ПолучитьСтроку(А);
		Мас = СтрРазделить(Стр, Разделитель, Истина);
		Если Мас.Количество() < 7 Тогда 
			Продолжить; 
		КонецЕсли;
		БИК = Мас[5];
		КодРегиона = Сред(БИК, 3, 2);
		ДЗСтр = ДЗ.Строки.Найти(КодРегиона, "БИК", Ложь);
		Если ДЗСтр = Неопределено Тогда
			НСРегион = ДЗ.Строки.Добавить();
			НСРегион.БИК = КодРегиона;
			НСРегион.Наименование = Регионы.Получить(КодРегиона);
			НСРегион.Загрузка = Ложь;
		Иначе	
			НСРегион = ДЗСтр;
		КонецЕсли;	
		НС = НСРегион.Строки.Добавить();
		НС.Наименование = Мас[3];
		НС.БИК = БИК;
		НС.ТипБанка = ОпределитьТипБанка(Мас[0]);
		НС.КоррСчёт = Мас[6];
		НС.Индекс = "";
		НС.Город = ОпределитьТипПункта(Мас[2]) + " " + Мас[1]; // Тип пункта + Пункт
		НС.Адрес = "";
		НС.Телефон = "";
		НС.Загрузка = Ложь;
	КонецЦикла;
	Попытка
		УдалитьФайлы(ВремКаталог);
	Исключение КонецПопытки;	
	ДЗ.Строки.Сортировать("Наименование");
	Возврат ДЗ;
КонецФункции

#КонецОбласти

#Область Дополнительно

Функция ОпределитьТипПункта(Ключ)
	Соответствие = Новый Соответствие;
	Соответствие.Вставить("1", "Г."); // ГОРОД
	Соответствие.Вставить("2", "П."); // ПОСЕЛОК
	Соответствие.Вставить("3", "С."); // СЕЛО
	Соответствие.Вставить("4", "ПГТ."); // ПОСЕЛОК ГОРОДСКОГО ТИПА
	Соответствие.Вставить("5", "СТ-ЦА."); // СТАНИЦА
	Соответствие.Вставить("6", "АУЛ."); // АУЛ
	Соответствие.Вставить("7", "РП."); // РАБОЧИЙ ПОСЕЛОК
	Результат = Соответствие.Получить(Ключ);
	Возврат ?(Результат = Неопределено, "", Результат);
КонецФункции

Функция ОпределитьТипБанка(Ключ)
	Соответствие = Новый Соответствие;
	Соответствие.Вставить("00", "ГРКЦ ");
	Соответствие.Вставить("10", "РКЦ ");
	Соответствие.Вставить("20", "Б ");
	Соответствие.Вставить("21", "КБ ");
	Соответствие.Вставить("22", "СБ ");
	Соответствие.Вставить("23", "АКБ ");
	Соответствие.Вставить("24", "ЧКБ ");
	Соответствие.Вставить("25", "КОПБ ");
	Соответствие.Вставить("26", "АПБ ");
	Соответствие.Вставить("30", "ФБ ");
	Соответствие.Вставить("31", "ФКБ ");
	Соответствие.Вставить("32", "Отд. ");
	Соответствие.Вставить("33", "ФАКБ ");
	Соответствие.Вставить("34", "ФЧКБ ");
	Соответствие.Вставить("35", "ФКОБ ");
	Соответствие.Вставить("36", "Отд. ");
	Соответствие.Вставить("40", "ПУ ");
	Соответствие.Вставить("50", "ЦХ ");
	Соответствие.Вставить("70", "КУ ");
	Соответствие.Вставить("71", "КЛ ");
	Соответствие.Вставить("72", "ОРЦБ ");
	Соответствие.Вставить("90", "ЛИКВ ");
	Соответствие.Вставить("98", "ИСКЛ ");
	Соответствие.Вставить("99", "ОТЗВ ");
	Результат = Соответствие.Получить(Ключ);
	Возврат ?(Результат = Неопределено, "", Результат);		
КонецФункции

#КонецОбласти
