
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Отбор = Новый Структура;
	Отбор.Вставить("ХозяйственнаяОперация", ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.УстановкаЦенНоменклатуры"));
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", НСтр("fr = 'Tarification'; ru = 'Установка цен номенклатуры'; en = 'Setting item prices'; es = 'Fijación de precios de artículos'"));
	ПараметрыФормы.Вставить("Отбор", Отбор);
	ПараметрыФормы.Вставить("НеИзменятьОтборПоВидуОперации", Истина);
	ОткрытьФорму("Документ.УстановкаЦенНоменклатуры.ФормаСписка", ПараметрыФормы,, "ФормаСпискаЦН");
КонецПроцедуры
