
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РаботаСДокументами.МожноРедактироватьДокументВФорме(Объект.Ссылка, ЭтаФорма);
	УстановитьВидимостьРеквизитов();
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, Объект);
	Если Объект.Ссылка.Пустая() и Объект.Валюта.Пустая() Тогда 
		Объект.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	РаботаСДокументамиКлиент.РассчитатьАвансПоПлатёжномуДокументу(Объект, Аванс);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	РаботаСДокументамиКлиент.ПроверитьСуммуОснованийПлатёжногоДокумента(Объект, Отказ);	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить(РаботаСДокументами.СвойствоЗаписьИзФормы(), Истина);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, ТекущийОбъект);
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура ЗаполнитьПоСуммеДокумента(Команда)
	ЗаполнитьПоОстаткамНаСервере(Ложь);
	РаботаСДокументамиКлиент.РассчитатьАвансПоПлатёжномуДокументу(Объект, Аванс);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВсеНеоплаченные(Команда)
	ЗаполнитьПоОстаткамНаСервере(Истина);
	РаботаСДокументамиКлиент.РассчитатьАвансПоПлатёжномуДокументу(Объект, Аванс);
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьПоНеоплаченным(Команда)
	П = ПараметрыПолученияЗадолженности(Истина);
	РаботаСДокументамиКлиент.ОткрытьФормуПодбораОбъектовРасчётовПоОстаткам(ЭтаФорма, П);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНазначениеПлатежа(Команда)
	ЗаполнитьНазначениеПлатежаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	УстановитьРеквизитыПлательщикаПолучателя();
КонецПроцедуры

&НаКлиенте
Процедура ТипПлатежногоДокументаПриИзменении(Элемент)
	УстановитьРеквизитыПлательщикаПолучателя();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ДанныеОрганизации = ОбщегоНазначенияВызовСервера.ПолучитьДанныеОрганизации(Объект.Организация);
	Объект.БанковскийСчёт = ДанныеОрганизации.БанковскийСчёт;
	УстановитьДоговор();
	УстановитьРеквизитыПлательщикаПолучателя();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	ДанныеКонтрагента = ОбщегоНазначенияВызовСервера.ПолучитьДанныеКонтрагента(Объект.Контрагент, Объект.Организация,, Объект.Дата);
	Объект.БанковскийСчётКонтрагента = ДанныеКонтрагента.БанковскийСчёт;
	Объект.Договор = ДанныеКонтрагента.Договор;
	УстановитьДоговор();
	УстановитьРеквизитыПлательщикаПолучателя();
КонецПроцедуры

&НаКлиенте
Процедура ХозяйственнаяОперацияПриИзменении(Элемент)
	УстановитьВидимостьРеквизитов();
	УстановитьДоговор();
	Объект.СтатьяДДС = ОбщегоНазначенияВызовСервера.ПолучитьСтатьюДДСПоХозяйственнойОперации(Объект.ХозяйственнаяОперация);
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	РаботаСДокументамиКлиент.РассчитатьАвансПоПлатёжномуДокументу(Объект, Аванс);
	СуммаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПроведеноБанкомПриИзменении(Элемент)
	Объект.ДатаПроведенияБанком = ?(Объект.ПроведеноБанком, ТекущаяДата(), Дата(1,1,1));		
КонецПроцедуры

&НаКлиенте
Процедура ТЧОснованияПриИзменении(Элемент)
	РаботаСДокументамиКлиент.РассчитатьАвансПоПлатёжномуДокументу(Объект, Аванс);
	ЗаполнитьНазначениеПлатежаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТЧОснованияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле = Элементы.ТЧОснованияСтавкаНДС Или Поле = Элементы.ТЧОснованияСуммаНДС Тогда
		ТекСтр = Объект.ТЧОснования.НайтиПоИдентификатору(ВыбраннаяСтрока);
		РаботаСДокументамиКлиент.РедактироватьСуммыНДСПлатёжногоДокумента(ТекСтр, ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТЧОснованияОснованиеПриИзменении(Элемент)
	ТекСтр = Элементы.ТЧОснования.ТекущиеДанные;
	ДанныеСуммы = РаботаСДокументамиВызовСервера.ПолучитьСуммуОснованияДляПлатёжногоДокумента(ТекСтр.Основание);
	ЗаполнитьЗначенияСвойств(ТекСтр, ДанныеСуммы);
КонецПроцедуры

&НаКлиенте
Процедура ТЧДокументыОснованияСуммаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСуммуНДСПлатёжногоДокумента(Элементы.ТЧОснования.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТЧОснованияСтавкаНДСПриИзменении(Элемент)
	ТекСтр = Элементы.ТЧОснования.ТекущиеДанные;
	ТекСтр.СуммаНДС = РаботаСДокументамиКлиентСервер.РассчитатьСуммуНДС(ТекСтр.СтавкаНДС, ТекСтр.Сумма, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЧекПриИзменении(Элемент)
	ЧекПриИзмененииНаСервере();
	РаботаСДокументамиКлиент.РассчитатьАвансПоПлатёжномуДокументу(Объект, Аванс);
КонецПроцедуры

#КонецОбласти

#Область Оповещения

&НаКлиенте
Процедура ПослеЗакрытияФормыРедактированияНДСПлатёжногоДокумента(МасДанные, СтрОснованиеПлатежа) Экспорт
	Если МасДанные = Неопределено Тогда Возврат КонецЕсли;
	Модифицированность = Истина;
	РаботаСДокументамиКлиент.ЗаполнитьСуммыНДСПлатёжногоДокумента(СтрОснованиеПлатежа, МасДанные);
	ЗаполнитьНазначениеПлатежаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыПодбораОбъектовРасчётов(МасЗадолженность, ДополнительныеПараметры) Экспорт
	Если МасЗадолженность = Неопределено Тогда Возврат КонецЕсли;
	ЗаполнитьПоОстаткамНаСервере(Истина, МасЗадолженность);
	РаботаСДокументамиКлиент.РассчитатьАвансПоПлатёжномуДокументу(Объект, Аванс);
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область Дополнительно

&НаСервере
Функция ПараметрыПолученияЗадолженности(ВсеНеоплаченные)
	Возврат РаботаСДокументами.ПараметрыПолученияЗадолженности(Объект, Истина, ВсеНеоплаченные);	
КонецФункции

&НаСервере
Процедура УстановитьВидимостьРеквизитов()
	РаботаСДокументами.УстановитьВидимостьРеквизитовДенежногоДокумента(ЭтаФорма);
	Элементы.ПериодРасчетаЗарплаты.Видимость = Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыплатаЗарплаты;
	Если Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПрочееПоступлениеДенежныхСредств  
		Или Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОбналичиваниеЧека Тогда 
		Элементы.Контрагент.Видимость = Ложь;
		Элементы.Договор.Видимость = Ложь;
		Элементы.МестоХранения.Видимость = Не Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОбналичиваниеЧека;
	КонецЕсли;
	Элементы.МестоХранения.ТолькоПросмотр = РольДоступна("PDV");
	Элементы.Организация.ТолькоПросмотр = РольДоступна("PDV");
	Элементы.Чек.Видимость = Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОбналичиваниеЧека;
КонецПроцедуры	

&НаСервере
Процедура УстановитьРеквизитыПлательщикаПолучателя()
	Документы.СписаниеБезналичныхДенежныхСредств.УстановитьРеквизитыПлательщикаПолучателя(Объект);	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьПоОстаткамНаСервере(ВсеНеоплаченные, Знач МасЗадолженность = Неопределено)
	П = ПараметрыПолученияЗадолженности(ВсеНеоплаченные);
	РаботаСДокументами.ЗаполнитьЗадолженностьДляЗакрытия(Объект, П, МасЗадолженность);
	ЗаполнитьНазначениеПлатежаНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьДоговор()
	РаботаСДокументами.УстановитьДоговорДляПлатёжногоДокумента(Объект);		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНазначениеПлатежаНаСервере()
	Обработки.КлиентБанк.СформироватьТекстНазначенияПлатежа(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаНаРасходованиеДенежныхСредствПриИзменении(Элемент)
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаНаРасходованиеДенежныхСредствНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	РаботаСДокументамиКлиент.ОткрытьФормуВыбораЗаявкиНаРасходованиеДС(Объект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ЧекПриИзмененииНаСервере()
	Объект.Сумма = ?(Объект.Чек.Пустая(), 0, Объект.Чек.СуммаЧека);
КонецПроцедуры

&НаСервере
Процедура СуммаПриИзмененииНаСервере()
	Если Объект.Валюта = Константы.ВалютаРегламентированногоУчета.Получить() Тогда 
		Объект.СуммаВВалютеРеглУчета = Объект.Сумма;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

