
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	РаботаСДокументами.ЗаполнитьРеквизитыПоУмолчанию(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.ПлановыеПоказатели.Записывать = Истина;
	Для Каждого Стр Из ТЧПлановыеПоказатели Цикл
		Движение = Движения.ПлановыеПоказатели.Добавить();
		Движение.Период = Дата;
		ЗаполнитьЗначенияСвойств(Движение, Стр);
	КонецЦикла;
	Движения.Записать();
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = ПараметрыСеанса.Пользователь;
КонецПроцедуры


