
Функция СформироватьПредставлениеДляПечати(Сотрудник) Экспорт
	Возврат СокрЛП(Сотрудник.Фамилия) + 
		?(ЗначениеЗаполнено(Сотрудник.Имя), " " + Лев(Сотрудник.Имя, 1) + ".", "") + 
		?(ЗначениеЗаполнено(Сотрудник.Отчество), " " + Лев(Сотрудник.Отчество, 1) + ".", "");	
КонецФункции

Функция ПолучитьПоКодуМобильногоКлиента(КодМобильногоКлиента) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ФизическиеЛица.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.ФизическиеЛица КАК ФизическиеЛица
	                      |ГДЕ
	                      |	ФизическиеЛица.КодМобильногоКлиента = &КодМобильногоКлиента
	                      |	И ФизическиеЛица.ПометкаУдаления = ЛОЖЬ");
	Запрос.УстановитьПараметр("КодМобильногоКлиента", КодМобильногоКлиента);
	Рез = Запрос.Выполнить();
	Возврат ?(Рез.Пустой(), Справочники.ФизическиеЛица.ПустаяСсылка(), Рез.Выгрузить()[0].Ссылка);
КонецФункции 

Функция ПолучитьПоИДМобильногоУстройства(ИДМобильногоУстройства) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ФизическиеЛица.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.ФизическиеЛица КАК ФизическиеЛица
	                      |ГДЕ
	                      |	ФизическиеЛица.ИДМобильногоУстройства = &ИДМобильногоУстройства
	                      |	И ФизическиеЛица.ПометкаУдаления = ЛОЖЬ");
	Запрос.УстановитьПараметр("ИДМобильногоУстройства", ИДМобильногоУстройства);
	Рез = Запрос.Выполнить();
	Возврат ?(Рез.Пустой(), Справочники.ФизическиеЛица.ПустаяСсылка(), Рез.Выгрузить()[0].Ссылка);
КонецФункции




	