
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Новый Структура("Контрагент", ПараметрКоманды));
	ПараметрыФормы.Вставить("Заголовок", НСтр("ru = 'Договоры с контрагентами'; fr = 'Contrats des contreparties';
		|en = 'Counterparty contracts'; es = 'Contratos de contrapartes'"));
	ОткрытьФорму("Справочник.ДоговорыСКонтрагентами.ФормаСписка",
				 ПараметрыФормы,
				 ПараметрыВыполненияКоманды.Источник,
				 ПараметрыВыполненияКоманды.Уникальность,
				 ПараметрыВыполненияКоманды.Окно);	
КонецПроцедуры
