
Функция ТаблицаКлассификатора() Экспорт
	Макет = Справочники.СтраныМира.ПолучитьМакет("Классификатор");
	Возврат ОбщегоНазначения.ЗначениеИзСтрокиXML(Макет.ПолучитьТекст());
КонецФункции

Функция ДанныеСтраныМира(Знач КодСтраны = Неопределено, Знач Наименование = Неопределено) Экспорт
	Результат = Новый Структура("Ссылка, Код, Наименование, НаименованиеПолное, МеждународноеНаименование, КодАльфа2, КодАльфа3, УчастникЕАЭС",, "", "", "", "", "", "", Истина);
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СтраныМира.Ссылка КАК Ссылка,
	                      |	СтраныМира.Код КАК Код,
	                      |	СтраныМира.Наименование КАК Наименование,
	                      |	СтраныМира.НаименованиеПолное КАК НаименованиеПолное,
	                      |	СтраныМира.МеждународноеНаименование КАК МеждународноеНаименование,
	                      |	СтраныМира.КодАльфа2 КАК КодАльфа2,
	                      |	СтраныМира.КодАльфа3 КАК КодАльфа3,
	                      |	СтраныМира.УчастникЕАЭС КАК УчастникЕАЭС
	                      |ИЗ
	                      |	Справочник.СтраныМира КАК СтраныМира
	                      |ГДЕ
	                      |	ВЫБОР
	                      |			КОГДА &КодСтраны = НЕОПРЕДЕЛЕНО
	                      |				ТОГДА ИСТИНА
	                      |			ИНАЧЕ СтраныМира.Код = &КодСтраны
	                      |					ИЛИ СтраныМира.КодАльфа2 = &КодСтраны
	                      |					ИЛИ СтраныМира.КодАльфа3 = &КодСтраны
	                      |		КОНЕЦ
	                      |	И ВЫБОР
	                      |			КОГДА &Наименование = НЕОПРЕДЕЛЕНО
	                      |				ТОГДА ИСТИНА
	                      |			ИНАЧЕ СтраныМира.Наименование = &Наименование
	                      |					ИЛИ СтраныМира.МеждународноеНаименование = &Наименование
	                      |		КОНЕЦ");
	Запрос.УстановитьПараметр("КодСтраны", КодСтраны);
    Запрос.УстановитьПараметр("Наименование", Наименование);
	Выб = Запрос.Выполнить().Выбрать();
	Если Выб.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выб);	
	КонецЕсли;	
	Возврат Результат;
КонецФункции