
#Область Интерфейс

Функция ПринтерЭтикеток() Экспорт
	Возврат ПолучитьЗначениеНастройки(ПланыВидовХарактеристик.ВидыНастроекПользователей.ПринтерЭтикеток);	
КонецФункции

Функция ПринтерЧеков() Экспорт
	Возврат ПолучитьЗначениеНастройки(ПланыВидовХарактеристик.ВидыНастроекПользователей.ПринтерЧеков);	
КонецФункции

Функция РедактироватьДокументыВЗакрытомПериоде() Экспорт
	Возврат ПолучитьЗначениеНастройки(ПланыВидовХарактеристик.ВидыНастроекПользователей.РедактироватьДокументыВЗакрытомПериоде);	
КонецФункции

Функция СкладПользователя() Экспорт
	Возврат ПолучитьЗначениеНастройки(ПланыВидовХарактеристик.ВидыНастроекПользователей.Magasin);	
КонецФункции

Функция КассаПользователя() Экспорт
	Возврат ПолучитьЗначениеНастройки(ПланыВидовХарактеристик.ВидыНастроекПользователей.Касса);	
КонецФункции

Функция ЗаверениеЦен() Экспорт
	Возврат ПолучитьЗначениеНастройки(ПланыВидовХарактеристик.ВидыНастроекПользователей.ЗаверениеЦен);	
КонецФункции

Функция РедактироватьЗавершенныеДокументы() Экспорт
	Возврат ПолучитьЗначениеНастройки(ПланыВидовХарактеристик.ВидыНастроекПользователей.РедактироватьЗавершенныеДокументы);	
КонецФункции

Функция ЭтоКассир() Экспорт
	Возврат ПолучитьЗначениеНастройки(ПланыВидовХарактеристик.ВидыНастроекПользователей.Кассир);
КонецФункции

Функция НеКонтролироватьЗапретОтгрузок() Экспорт
	Возврат ПолучитьЗначениеНастройки(ПланыВидовХарактеристик.ВидыНастроекПользователей.НеКонтролироватьЗапретОтгрузок);
КонецФункции

#КонецОбласти

#Область Дополнительно

Функция ПолучитьЗначениеНастройки(Настройка)
	УстановитьПривилегированныйРежим(Истина);
	Результат = РегистрыСведений.НастройкиПользователей.Получить(Новый Структура("Пользователь, Настройка", ПараметрыСеанса.Пользователь, Настройка));		
	Возврат ?(Результат.Значение = Неопределено, Настройка.ТипЗначения.ПривестиЗначение(), Результат.Значение);	
КонецФункции	

#КонецОбласти