
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаказПоставщику = Параметры.ЗаказПоставщику;
	СформироватьДеревоПредварительныхЗаказов();
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура ДЗОтметкаПриИзменении(Элемент)
	Отметка = Элементы.ДЗ.ТекущиеДанные.Отметка;
	ДЗ2 = Элементы.ДЗ.ТекущиеДанные.ПолучитьЭлементы();
	Для Каждого Стр2 Из ДЗ2 Цикл
		Стр2.Отметка = Отметка;
		ДЗ3 = Стр2.ПолучитьЭлементы();
		Для Каждого Стр3 Из ДЗ3 Цикл
			Стр3.Отметка = Отметка;	
		КонецЦикла;	
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура Подтвердить(Команда)
	Закрыть(ОбработатьОтмеченныеЗаказы());
КонецПроцедуры

#КонецОбласти

#Область Дополнительно

&НаСервере
Процедура СформироватьДеревоПредварительныхЗаказов()
	ДЗВрем = РеквизитФормыВЗначение("ДЗ", Тип("ДеревоЗначений"));
	ДЗВрем.Строки.Очистить();
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗаказыПоставщикамОстатки.ЗаказПоставщику.Ответственный КАК Ответственный,
	                      |	ЗаказыПоставщикамОстатки.ЗаказПоставщику.ДатаПоставки КАК ДатаПоставки,
	                      |	ЗаказыПоставщикамОстатки.ЗаказПоставщику КАК ЗаказПоставщику,
	                      |	ЗаказыПоставщикамОстатки.Номенклатура КАК Номенклатура,
	                      |	ЗаказыПоставщикамОстатки.Характеристика КАК Характеристика,
	                      |	ЗаказыПоставщикамОстатки.КодСтроки КАК КодСтроки,
	                      |	ЗаказыПоставщикамОстатки.КоличествоОстаток КАК Количество,
	                      |	ЗаказыПоставщикамОстатки.ЗаказПоставщику.Комментарий КАК ЗаказПоставщикуКомментарий,
	                      |	ЗаказПоставщикуТЧТовары.Комментарий КАК Комментарий
	                      |ИЗ
	                      |	РегистрНакопления.ЗаказыПоставщикам.Остатки(&ДатаОст, ) КАК ЗаказыПоставщикамОстатки
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.ТЧТовары КАК ЗаказПоставщикуТЧТовары
	                      |		ПО ЗаказыПоставщикамОстатки.ЗаказПоставщику = ЗаказПоставщикуТЧТовары.Ссылка
	                      |			И ЗаказыПоставщикамОстатки.КодСтроки = ЗаказПоставщикуТЧТовары.КодСтроки
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ЗаказыПоставщикамОстатки.ЗаказПоставщику.Ответственный.Наименование,
	                      |	ЗаказыПоставщикамОстатки.ЗаказПоставщику.ДатаПоставки
	                      |ИТОГИ
	                      |	МАКСИМУМ(ЗаказПоставщикуКомментарий)
	                      |ПО
	                      |	Ответственный,
	                      |	ЗаказПоставщику");
	Запрос.УстановитьПараметр("ДатаОст", РаботаСДокументамиВызовСервера.ПолучитьГраницуДокумента(ЗаказПоставщику));
	ВыбОтветственный = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыбОтветственный.Следующий() Цикл
		НСОтветственный = ДЗВрем.Строки.Добавить();
		НСОтветственный.ОтветственныйЗаказПоставщикуНоменклатура = ВыбОтветственный.Ответственный;
		НСОтветственный.Уровень = 1;
		ВыбЗаказПоставщику = ВыбОтветственный.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыбЗаказПоставщику.Следующий() Цикл
			НСЗаказПоставщик = НСОтветственный.Строки.Добавить();
			НСЗаказПоставщик.ОтветственныйЗаказПоставщикуНоменклатура = ВыбЗаказПоставщику.ЗаказПоставщику;
			НСЗаказПоставщик.ДатаПоставкиКоличество = ВыбЗаказПоставщику.ДатаПоставки;
			НСЗаказПоставщик.Комментарий = ВыбЗаказПоставщику.ЗаказПоставщикуКомментарий;
			НСЗаказПоставщик.Уровень = 2;
			ВыбНоменклатура = ВыбЗаказПоставщику.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыбНоменклатура.Следующий() Цикл
				НСНоменклатура = НСЗаказПоставщик.Строки.Добавить();
				НСНоменклатура.ОтветственныйЗаказПоставщикуНоменклатура = ВыбНоменклатура.Номенклатура;
				НСНоменклатура.Характеристика = ВыбНоменклатура.Характеристика;
				НСНоменклатура.КодСтроки = ВыбНоменклатура.КодСтроки;
				НСНоменклатура.ДатаПоставкиКоличество = ВыбНоменклатура.Количество;
				НСНоменклатура.Комментарий = ВыбНоменклатура.Комментарий;
				НСНоменклатура.Уровень = 3;	
			КонецЦикла;	
		КонецЦикла;
	КонецЦикла;
	ЗначениеВРеквизитФормы(ДЗВрем, "ДЗ");
	Элементы.ДЗ.НачальноеОтображениеДерева = НачальноеОтображениеДерева.РаскрыватьВсеУровни;
КонецПроцедуры	

&НаСервере
Функция ОбработатьОтмеченныеЗаказы()
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ЗаказПоставщику", Новый ОписаниеТипов("ДокументСсылка.ЗаказПоставщику"));
	ТЗ.Колонки.Добавить("КодСтроки", Метаданные.ОпределяемыеТипы.КодСтроки.Тип);
	ТЗ.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТЗ.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТЗ.Колонки.Добавить("Количество", Метаданные.ОпределяемыеТипы.КоличествоНеотрицательное.Тип);
	ТЗ.Колонки.Добавить("Комментарий", Метаданные.ОпределяемыеТипы.Комментарий.Тип);	
	// Обрабатываем
	Для Каждого СтрОтветственный Из ДЗ.ПолучитьЭлементы() Цикл
		Для Каждого СтрЗаказ Из СтрОтветственный.ПолучитьЭлементы() Цикл
			Для Каждого СтрНоменклатура Из СтрЗаказ.ПолучитьЭлементы() Цикл
				Если Не СтрНоменклатура.Отметка Тогда Продолжить КонецЕсли; 
				НС = ТЗ.Добавить();
				НС.ЗаказПоставщику = СтрЗаказ.ОтветственныйЗаказПоставщикуНоменклатура;				
				НС.КодСтроки = СтрНоменклатура.КодСтроки;
				НС.Номенклатура = СтрНоменклатура.ОтветственныйЗаказПоставщикуНоменклатура;
				НС.Характеристика = СтрНоменклатура.Характеристика;
				НС.Количество = СтрНоменклатура.ДатаПоставкиКоличество;
				НС.Комментарий = СтрНоменклатура.Комментарий;
			КонецЦикла;	
		КонецЦикла;	
	КонецЦикла;
	Мас = Новый Массив;
	Для Каждого Стр Из ТЗ Цикл
		Структура = Новый Структура("ЗаказПоставщику, КодСтроки, Номенклатура, Характеристика, Комментарий, Количество");
		ЗаполнитьЗначенияСвойств(Структура, Стр);
		Мас.Добавить(Структура);
	КонецЦикла;	
	Возврат Мас;
КонецФункции	

#КонецОбласти





