
&НаКлиенте
Процедура ГиперссылкаПерейтиУпаковкиНабораНажатие(Элемент)
	РаботаСДокументамиКлиент.ЗаписатьЕслиНовый(ЭтаФорма, Истина);
	Отбор = Новый Структура;
	Отбор.Вставить("Владелец", Объект.Ссылка);
	Отбор.Вставить("ТипИзмеряемойВеличины", ПредопределенноеЗначение("Перечисление.ТипыИзмеряемыхВеличин.Упаковка"));
	П = Новый Структура("Отбор", Отбор);
	ОткрытьФорму("Справочник.УпаковкиЕдиницыИзмерения.ФормаСписка", П,, ЭтаФорма.УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
