
Процедура УстановитьРеквизитыПредопределённыхДанныхПоУмолчанию() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	ВРК = ПланыВидовХарактеристик.ВидыРеквизитовКонтрагентов;
	ВК = Перечисления.ВидыКонтрагентов;
    Порядок = 1;
	НачатьТранзакцию();
	
	#Область Регистрационные_данные
		// Дата рождения
		Об = ПолучитьВидРеквизита(ВРК.ДатаРождения, Ложь, Порядок);
		ДобавитьВидКонтрагента(Об, ВК.ЧастноеЛицо);
		Об.Записать();
		// CIN
		Об = ПолучитьВидРеквизита(ВРК.CIN, Ложь, Порядок);
		ДобавитьВидКонтрагента(Об, ВК.ЧастноеЛицо);
		Об.Записать();
		// IF
		Об = ПолучитьВидРеквизита(ВРК.NIF, Ложь, Порядок);
		ДобавитьВидКонтрагента(Об, ВК.ИндивидуальныйПредприниматель);
		ДобавитьВидКонтрагента(Об, ВК.ЧастноеЛицо);
		ДобавитьВидКонтрагента(Об, ВК.ЮридическоеЛицо);
		Об.Записать();
		// CNSS
		Об = ПолучитьВидРеквизита(ВРК.CNSS, Ложь, Порядок);
		ДобавитьВидКонтрагента(Об, ВК.ИндивидуальныйПредприниматель);
		ДобавитьВидКонтрагента(Об, ВК.ЧастноеЛицо);
		ДобавитьВидКонтрагента(Об, ВК.ЮридическоеЛицо);
		Об.Записать();
		// RC
		Об = ПолучитьВидРеквизита(ВРК.RC, Истина, Порядок);
		ДобавитьВидКонтрагента(Об, ВК.ИндивидуальныйПредприниматель);
		ДобавитьВидКонтрагента(Об, ВК.ЮридическоеЛицо);
		Об.Записать();
		// ICE
		Об = ПолучитьВидРеквизита(ВРК.ICE, Ложь, Порядок);
		ДобавитьВидКонтрагента(Об, ВК.ИндивидуальныйПредприниматель);
		ДобавитьВидКонтрагента(Об, ВК.ЮридическоеЛицо);
		Об.Записать();
		// TaxeProfessionnelle
		Об = ПолучитьВидРеквизита(ВРК.TaxeProfessionnelle, Ложь, Порядок);
		ДобавитьВидКонтрагента(Об, ВК.ИндивидуальныйПредприниматель);
		ДобавитьВидКонтрагента(Об, ВК.ЮридическоеЛицо);
		Об.Записать();
		//// ОКПО
		//Об = ПолучитьВидРеквизита(ВРК.ОКПО, Ложь, Порядок);
		//ДобавитьВидКонтрагента(Об, ВК.ЮридическоеЛицо);
		//Об.Записать();
		//// ОКВЭД
		//Об = ПолучитьВидРеквизита(ВРК.ОКВЭД, Ложь, Порядок);
		//ДобавитьВидКонтрагента(Об, ВК.ИндивидуальныйПредприниматель);
		//ДобавитьВидКонтрагента(Об, ВК.ЮридическоеЛицо);
		//Об.Записать();
		//// ОКТМО
		//Об = ПолучитьВидРеквизита(ВРК.ОКТМО, Ложь, Порядок);
		//ДобавитьВидКонтрагента(Об, ВК.ЮридическоеЛицо);
		//Об.Записать();
		// Дата регистрации
		Об = ПолучитьВидРеквизита(ВРК.ДатаРегистрации, Ложь, Порядок);
		ДобавитьВидКонтрагента(Об, ВК.ИндивидуальныйПредприниматель);
		ДобавитьВидКонтрагента(Об, ВК.ОбособленноеПодразделение);
		ДобавитьВидКонтрагента(Об, ВК.ЮридическоеЛицо);
		Об.Записать(); 
		// Уставный капитал
		Об = ПолучитьВидРеквизита(ВРК.УставныйКапитал, Ложь, Порядок);
		ДобавитьВидКонтрагента(Об, ВК.ЮридическоеЛицо);
		Об.Записать();
		//// Сотрудников
		//Об = ПолучитьВидРеквизита(ВРК.Сотрудников, Истина, Порядок);
		//ДобавитьВидКонтрагента(Об, ВК.ЮридическоеЛицо);
		//Об.Записать();
	#КонецОбласти
	
	#Область Адреса
		// Адрес юридический
		Об = ПолучитьВидРеквизита(ВРК.АдресЮридический, Истина, Порядок);
		ДобавитьВидКонтрагента(Об, ВК.ЮридическоеЛицо);
		Об.Записать();
		// Адрес фактический
		Об = ПолучитьВидРеквизита(ВРК.АдресФактический, Истина, Порядок);
		ДобавитьВидКонтрагента(Об, ВК.ИндивидуальныйПредприниматель);
		ДобавитьВидКонтрагента(Об, ВК.ОбособленноеПодразделение);
		ДобавитьВидКонтрагента(Об, ВК.ЮридическоеЛицо);
		ДобавитьВидКонтрагента(Об, ВК.ЧастноеЛицо);
		Об.Записать(); 
		//// Адрес по прописке
		//Об = ПолучитьВидРеквизита(ВРК.АдресПоПрописке, Истина, Порядок);
		//ДобавитьВидКонтрагента(Об, ВК.ЧастноеЛицо);
		//Об.Записать();
		// Адрес проживания
		Об = ПолучитьВидРеквизита(ВРК.АдресПроживания, Истина, Порядок);
		ДобавитьВидКонтрагента(Об, ВК.ЧастноеЛицо);
		Об.Записать(); 
		// Место рождения
		Об = ПолучитьВидРеквизита(ВРК.МестоРождения, Ложь, Порядок);
		ДобавитьВидКонтрагента(Об, ВК.ЧастноеЛицо);
		Об.Записать();
		// Адрес доставки
		Об = ПолучитьВидРеквизита(ВРК.АдресДоставки, Истина, Порядок);
		ДобавитьВидКонтрагента(Об, ВК.ИндивидуальныйПредприниматель);
		ДобавитьВидКонтрагента(Об, ВК.ОбособленноеПодразделение);
		ДобавитьВидКонтрагента(Об, ВК.ЧастноеЛицо);
		ДобавитьВидКонтрагента(Об, ВК.ЮридическоеЛицо);
		Об.Записать();
	#КонецОбласти 
	
	#Область Контакты
		// Телефон
		Об = ПолучитьВидРеквизита(ВРК.Телефон, Ложь, Порядок, Истина);
		ДобавитьВидКонтрагента(Об, ВК.ИндивидуальныйПредприниматель);
		ДобавитьВидКонтрагента(Об, ВК.ОбособленноеПодразделение);
		ДобавитьВидКонтрагента(Об, ВК.ЧастноеЛицо);
		ДобавитьВидКонтрагента(Об, ВК.ЮридическоеЛицо);
		Об.Записать();
		// Телефон фиксированный
		Об = ПолучитьВидРеквизита(ВРК.ТелефонФикс, Ложь, Порядок, Истина);
		ДобавитьВидКонтрагента(Об, ВК.ИндивидуальныйПредприниматель);
		ДобавитьВидКонтрагента(Об, ВК.ОбособленноеПодразделение);
		ДобавитьВидКонтрагента(Об, ВК.ЧастноеЛицо);
		ДобавитьВидКонтрагента(Об, ВК.ЮридическоеЛицо);
		Об.Записать();
		// E-mail
		Об = ПолучитьВидРеквизита(ВРК.EMail, Ложь, Порядок, Истина);
		ДобавитьВидКонтрагента(Об, ВК.ИндивидуальныйПредприниматель);
		ДобавитьВидКонтрагента(Об, ВК.ОбособленноеПодразделение);
		ДобавитьВидКонтрагента(Об, ВК.ЧастноеЛицо);
		ДобавитьВидКонтрагента(Об, ВК.ЮридическоеЛицо);
		Об.Записать();
		// Web
		Об = ПолучитьВидРеквизита(ВРК.Web, Ложь, Порядок, Истина);
		ДобавитьВидКонтрагента(Об, ВК.ИндивидуальныйПредприниматель);
		ДобавитьВидКонтрагента(Об, ВК.ОбособленноеПодразделение);
		ДобавитьВидКонтрагента(Об, ВК.ЧастноеЛицо);
		ДобавитьВидКонтрагента(Об, ВК.ЮридическоеЛицо);
		Об.Записать();
		// Другое
		Об = ПолучитьВидРеквизита(ВРК.Другое, Ложь, Порядок, Истина);
		ДобавитьВидКонтрагента(Об, ВК.ИндивидуальныйПредприниматель);
		ДобавитьВидКонтрагента(Об, ВК.ОбособленноеПодразделение);
		ДобавитьВидКонтрагента(Об, ВК.ЧастноеЛицо);
		ДобавитьВидКонтрагента(Об, ВК.ЮридическоеЛицо);
		Об.Записать();
	#КонецОбласти
	
	#Область Контактные_лица
		// Собственник
		Об = ПолучитьВидРеквизита(ВРК.Собственник, Истина, Порядок, Истина);
		ДобавитьВидКонтрагента(Об, ВК.ЮридическоеЛицо);
		Об.Записать();
		// Руководитель
		Об = ПолучитьВидРеквизита(ВРК.Руководитель, Истина, Порядок, Ложь);
		ДобавитьВидКонтрагента(Об, ВК.ОбособленноеПодразделение);
		ДобавитьВидКонтрагента(Об, ВК.ЮридическоеЛицо);
		Об.Записать();
		//// Главный бухгалтер
		//Об = ПолучитьВидРеквизита(ВРК.ГлавныйБухгалтер, Истина, Порядок, Ложь);
		//ДобавитьВидКонтрагента(Об, ВК.ИндивидуальныйПредприниматель);
		//ДобавитьВидКонтрагента(Об, ВК.ОбособленноеПодразделение);
		//ДобавитьВидКонтрагента(Об, ВК.ЮридическоеЛицо);
		//Об.Записать();
		// Сотрудник
		Об = ПолучитьВидРеквизита(ВРК.Сотрудник, Ложь, Порядок, Истина);
		ДобавитьВидКонтрагента(Об, ВК.ИндивидуальныйПредприниматель);
		ДобавитьВидКонтрагента(Об, ВК.ОбособленноеПодразделение);
		ДобавитьВидКонтрагента(Об, ВК.ЮридическоеЛицо);
		Об.Записать();
	#КонецОбласти
	
    #Область Другое
		Об = ПолучитьВидРеквизита(ВРК.НаименованиеПолное, Истина, Порядок);
		Об.Служебный = Истина;
		Об.Записать();
    #КонецОбласти
	
	Попытка
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
	КонецПопытки;	
КонецПроцедуры

#Область Дополнительно

Функция ПолучитьВидРеквизита(ВидРеквизита, Периодический, Порядок, Множественный = Ложь)
	Об = ВидРеквизита.ПолучитьОбъект();
	Об.Периодический = Периодический;
	Об.Служебный = Ложь;
	Об.Порядок = Порядок;
	Об.Множественный = Множественный;
	Об.ТЧВидыКонтрагентов.Очистить();
	Порядок = Порядок + 1;
	Возврат Об;
КонецФункции	

Процедура ДобавитьВидКонтрагента(СпрОбъект, ВидКонтрагента)
	НС = СпрОбъект.ТЧВидыКонтрагентов.Добавить();
	НС.ВидКонтрагента = ВидКонтрагента;
КонецПроцедуры

#КонецОбласти
