
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Для Каждого Стр Из ПараметрКоманды Цикл
		Таб = Новый ТабличныйДокумент;
		Сформировать(Стр, Таб);
		Таб.ТолькоПросмотр = Истина;
		Таб.ОтображатьСетку = Ложь;
		Таб.ОтображатьЗаголовки = Ложь;
		Таб.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		Таб.АвтоМасштаб = Истина;
		Таб.Показать("Печать: " + СокрЛП(Стр))	
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура Сформировать(Док, Таб)
	КоличествоДнейВМесяце = День(КонецМесяца(Док.Дата));
	Макет = Документы.ТабельУчётаРабочегоВремени.ПолучитьМакет("Табель");
	оШапкаОсновная = Макет.ПолучитьОбласть("Шапка|Основная");
	оШапкаДата = Макет.ПолучитьОбласть("Шапка|Дата");
	оСтрокаОсновная = Макет.ПолучитьОбласть("Строка|Основная");
	оСтрокаДата = Макет.ПолучитьОбласть("Строка|Дата");
	оШапкаОсновная.Параметры.Номер = Док.Номер;
	оШапкаОсновная.Параметры.Период = Формат(Док.Дата, "ДФ='MMMM yyyy'");
	оШапкаОсновная.Параметры.Группа = Док.Группа;
	Таб.Вывести(оШапкаОсновная);	
	мДата = НачалоМесяца(Док.Дата);
	Для А = 1 По КоличествоДнейВМесяце Цикл
		НомерДня = День(мДата);
		НомерДняНедели = ДеньНедели(мДата);		
		оШапкаДата.Параметры.Дата = СокрЛП(НомерДня) + " (" + ПолучитьДеньНеделиПоНомеру(НомерДняНедели) + ")";
		Таб.Присоединить(оШапкаДата);
		мДата = мДата + 24 * 60 * 60; 
	КонецЦикла;	
	Ном = 1;
	Для Каждого Стр Из Док.ТЧТабель Цикл
		оСтрокаОсновная.Параметры.Ном = Ном;
		оСтрокаОсновная.Параметры.Сотрудник = Стр.Сотрудник;
		оСтрокаОсновная.Параметры.ВариантУчётаРабочегоВремени = Стр.ВариантУчётаРабочегоВремени;
		оСтрокаОсновная.Параметры.ПоГрафику = Стр.ПоГрафику;
		оСтрокаОсновная.Параметры.Отработано = Стр.Отработано;
		Таб.Вывести(оСтрокаОсновная);
		Для А = 1 По КоличествоДнейВМесяце Цикл
			Если ЗначениеЗаполнено(Стр["_" + А]) и Стр["_" + А] <> Ложь Тогда
				оСтрокаДата.Параметры.Выход = Стр["_" + А];
				оСтрокаДата.Области.Выход.ЦветФона = ЦветаСтиля.ЦветФонаГруппировкиОтчета2;
			Иначе	
				оСтрокаДата.Параметры.Выход = "";
				оСтрокаДата.Области.Выход.ЦветФона = WebЦвета.Белый;
			КонецЕсли;			
			Таб.Присоединить(оСтрокаДата);	
		КонецЦикла;	
		Ном = Ном + 1;
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Функция ПолучитьДеньНеделиПоНомеру(Номер)
	Если Номер = 1 Тогда
		Возврат "пн.";
	ИначеЕсли Номер = 2 Тогда
		Возврат "вт.";
	ИначеЕсли Номер = 3 Тогда
		Возврат "ср.";
	ИначеЕсли Номер = 4 Тогда
		Возврат "чт.";
	ИначеЕсли Номер = 5 Тогда
		Возврат "пт.";
	ИначеЕсли Номер = 6 Тогда
		Возврат "сб.";
	ИначеЕсли Номер = 7 Тогда
		Возврат "вс.";
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции
