
&НаКлиенте
Асинх Процедура КаталогХраненияФайловНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДВФ = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДВФ.Заголовок = "Выберите каталог для хранения внешних файлов";
	Обещание = ДВФ.ВыбратьАсинх();
	МасКаталог = Ждать Обещание;
	Если МасКаталог = Неопределено Тогда Возврат КонецЕсли;
	НаборКонстант.КаталогХраненияФайлов = МасКаталог[0];
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНастройкиДанныхПоУмолчанию(Команда)
	УстановитьНастройкиДанныхПоУмолчаниюНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьНастройкиДанныхПоУмолчаниюНаСервере()
	УстановитьПривилегированныйРежим(Истина);
	ПланыВидовХарактеристик.ВидыРеквизитовКонтрагентов.УстановитьРеквизитыПредопределённыхДанныхПоУмолчанию();
	//МенеджерОборудованияВызовСервераПереопределяемый.ОбновитьПоставляемыеДрайвера();
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПутьКФайламАнкетыНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ДВФ = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДВФ.Заголовок = "Выберите каталог хранения файлов анкет";
	Обещание = ДВФ.ВыбратьАсинх();
	МасКаталог = Ждать Обещание;
	Если МасКаталог = Неопределено Тогда Возврат КонецЕсли;
	НаборКонстант.ПутьКФайламАнкеты = МасКаталог[0];
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ДатаНачалаРасчетаЗарплаты.ТолькоПросмотр = ЗначениеЗаполнено(НаборКонстант.ДатаНачалаРасчетаЗарплаты);
КонецПроцедуры
