
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТЗДомены.Очистить();
	Для Каждого СтрДомен Из ПользователиОС() Цикл
		НСДомен = ТЗДомены.Добавить();
		НСДомен.Домен = СтрДомен.ИмяДомена;
		Для Каждого СтрПользователь Из СтрДомен.Пользователи Цикл
			НСПользователь = НСДомен.ТЗПользователи.Добавить();
			НСПользователь.Пользователь = СтрПользователь;
		КонецЦикла;
		НСДомен.ТЗПользователи.Сортировать("Пользователь");
	КонецЦикла;
	ТЗДомены.Сортировать("Домен");
КонецПроцедуры

&НаКлиенте
Процедура ТЗПользователиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СформироватьОповещение();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОповещение()
	ТекСтр = Элементы.ТЗПользователи.ТекущиеДанные;
	Если ТекСтр = Неопределено Тогда
		Сообщить(Нстр("fr = 'Sélectionnez un utilisateur'; ru = 'Выберите пользователя'; en = 'Select a user'; es = 'Seleccione un usuario'"));
		Возврат;
	КонецЕсли;
	ОповеститьОВыборе("\\" + Элементы.ТЗДомены.ТекущиеДанные.Домен + "\" + ТекСтр.Пользователь);		
КонецПроцедуры;	


