
Функция ПолучитьПоСотрудникуЗаПериод(Сотрудник, НачалоПериода, КонецПериода) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВЗ.Период КАК Период,
	                      |	ВЗ.Сотрудник КАК Сотрудник,
	                      |	ВЗ.Должность КАК Должность,
	                      |	ВЗ.Оклад КАК Оклад,
	                      |	ВЗ.ВариантОклада КАК ВариантОклада
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		ТССрезПоследних.Период КАК Период,
	                      |		ТССрезПоследних.Сотрудник КАК Сотрудник,
	                      |		ТССрезПоследних.Должность КАК Должность,
	                      |		ТССрезПоследних.Оклад КАК Оклад,
	                      |		ТССрезПоследних.ВариантОклада КАК ВариантОклада
	                      |	ИЗ
	                      |		РегистрСведений.ТарифныеСтавки.СрезПоследних(&НачалоПериода, Сотрудник = &Сотрудник) КАК ТССрезПоследних
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		ТС.Период,
	                      |		ТС.Сотрудник,
	                      |		ТС.Должность,
	                      |		ТС.Оклад,
	                      |		ТС.ВариантОклада
	                      |	ИЗ
	                      |		РегистрСведений.ТарифныеСтавки КАК ТС
	                      |	ГДЕ
	                      |		ТС.Период МЕЖДУ &НачалоПериода И &КонецПериода
	                      |		И ТС.Сотрудник = &Сотрудник) КАК ВЗ
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Период УБЫВ");
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ПолучитьВсехСотрудников(ДатаСреза, МестоХранения) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТарифныеСтавки.Сотрудник КАК Сотрудник
	                      |ИЗ
	                      |	РегистрСведений.ТарифныеСтавки.СрезПоследних(&ДатаСреза, МестоХранения = &МестоХранения) КАК ТарифныеСтавкиСрезПоследних
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифныеСтавки КАК ТарифныеСтавки
	                      |		ПО ТарифныеСтавкиСрезПоследних.Период = ТарифныеСтавки.Период
	                      |ГДЕ
	                      |	ТарифныеСтавкиСрезПоследних.ВидПриказа <> ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхПриказов.Увольнение)");
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.УстановитьПараметр("МестоХранения", МестоХранения);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
КонецФункции

Функция ПолучитьДанныеСотрудника(Сотрудник, ДатаСреза) Экспорт
	Результат = Новый Структура("Сотрудник, Организация, Должность, ГрафикРаботы", Сотрудник);
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТарифныеСтавкиСрезПоследних.Сотрудник КАК Сотрудник,
	                      |	ТарифныеСтавкиСрезПоследних.Организация КАК Организация,
	                      |	ТарифныеСтавкиСрезПоследних.Должность КАК Должность,
	                      |	ТарифныеСтавкиСрезПоследних.ГрафикРаботы КАК ГрафикРаботы
	                      |ИЗ
	                      |	РегистрСведений.ТарифныеСтавки.СрезПоследних(&ДатаСреза, Сотрудник = &Сотрудник) КАК ТарифныеСтавкиСрезПоследних");
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		Рез = Запрос.Выполнить();
		Если Не Рез.Пустой() Тогда
			ЗаполнитьЗначенияСвойств(Результат, Рез.Выгрузить()[0]);	
		КонецЕсли;	
	КонецЕсли;
	Возврат Результат;
КонецФункции

