
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Подпись = ПолучитьНавигационнуюСсылку(Запись.ИсходныйКлючЗаписи, "Подпись");
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ОбщегоНазначения.ЗаписатьДанныеВХранилищеЗначения(ТекущийОбъект, "Подпись", Подпись);
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура ПодписьНажатие(Элемент, СтандартнаяОбработка)
	ПрисоединённыеФайлыКлиент.ВыбратьИзображение(ЭтаФорма, Элемент.Имя, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ПодписьУдалить(Команда)
	ПрисоединённыеФайлыКлиент.УдалитьИзображение(ЭтаФорма, Подпись);
КонецПроцедуры

#КонецОбласти
