
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Номер");
	Поля.Добавить("Дата");  
	Поля.Добавить("НомерВходящегоДокумента");
	Поля.Добавить("ДатаВходящегоДокумента");
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	//СтандартнаяОбработка = Ложь;
	//Представление = Строка(Данные.ТипПлатежногоДокумента) + " входящее";
	//Представление = Представление + " №" + ?(ЗначениеЗаполнено(Данные.НомерВходящегоДокумента), Данные.НомерВходящегоДокумента, РаботаСДокументами.СформироватьЦифровойНомер(Данные.Номер));
	//ДатаДокумента = ?(ЗначениеЗаполнено(Данные.ДатаВходящегоДокумента), Данные.ДатаВходящегоДокумента, Данные.Дата);
	//Представление = Представление + " от " + Формат(ДатаДокумента, "ДЛФ=D");	
КонецПроцедуры

Процедура УстановитьРеквизитыПлательщикаПолучателя(Объект) Экспорт
	Объект.ИННПлательщика = Объект.Контрагент.NIF;
	Если РаботаСДокументамиКлиентСервер.ЕстьРеквизит(Объект.Контрагент, "RC") Тогда
		Объект.КПППлательщика = Объект.Контрагент.RC;
	КонецЕсли;
	Объект.ИННПолучателя = Объект.Организация.NIF;
	Объект.КПППолучателя = Объект.Организация.RC;	
КонецПроцедуры