
#Область ПрограммныйИнтерфейс

&НаКлиенте
Процедура ОповещениеОткрытьФормуВыбораФизическогоЛица(РезультатОткрытияФормы, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(РезультатОткрытияФормы) Тогда
		ВводимыйПродавец = РезультатОткрытияФормы;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОткрытьФормуВводаСерийныхНомеров(РезультатОткрытияФормы, ДополнительныеПараметры) Экспорт
	Если НЕ РезультатОткрытияФормы = Неопределено 
		И ТипЗнч(РезультатОткрытияФормы) = Тип("Массив") Тогда
		
		ПараметрыФормыУказанияСертификатов.Вставить("МассивСерийныхНомеров", РезультатОткрытияФормы);
		ИзмененыСертификаты = Истина;
		ЧислоКоличества = ПараметрыФормыУказанияСертификатов.МассивСерийныхНомеров.Количество();
		ВводимоеКоличество = Формат(ЧислоКоличества, "ЧЦ=12; ЧДЦ=3");
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КоличествоСимволовПослеЗапятой = 2;
	ПервыйВвод = Истина;
	
	Если Параметры.Свойство("Количество") Тогда
		ВводимоеКоличество = Формат(Параметры.Количество, "ЧЦ=12; ЧДЦ=3");
	КонецЕсли;
	
	Если Параметры.Свойство("Цена") Тогда
		ВводимаяЦена = Формат(Параметры.Цена, "ЧЦ=15; ЧДЦ=2");
	КонецЕсли;
	
	Если Параметры.Свойство("РедактироватьЦену") Тогда
		РедактироватьЦену = Параметры.РедактироватьЦену;
	Иначе
		РедактироватьЦену = Истина;
	КонецЕсли;

	СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша["U"], Ложь, Ложь, Ложь);
	//Если Элементы["ВводимоеКоличество"].Доступность Тогда
	//	ПервыйЭлемент = "Количество";
	//ИначеЕсли Элементы["ВводимаяЦена"].Доступность Тогда
	Если РедактироватьЦену Тогда 
		//ПервыйЭлемент = "Цена";
		ПервыйЭлемент = "Количество";
	Иначе
		Элементы.ГруппаЦена.Доступность = Ложь;
		ПервыйЭлемент = "Количество";
	КонецЕсли;
	//КонецЕсли;
	
	Если НЕ Элементы["ВводимоеКоличество"].Доступность
		И НЕ Элементы["ВводимаяЦена"].Доступность Тогда
		УстановитьНедоступностьЦифровогоВвода();
	КонецЕсли;
	
	Если Параметры.Свойство("Номенклатура") Тогда
		Элементы.МинимальнаяЦена.Видимость = Истина;
		Номенклатура = Параметры.Номенклатура;
		МинимальнаяЦена = РегистрыСведений.ЦеныНоменклатуры.ПолучитьПоследнее(ТекущаяДатаСеанса(),Новый Структура("Номенклатура,ВидЦены",Номенклатура,Справочники.ВидыЦен.МинимальнаяЦенаПродажи)).Цена;
		МинимальнаяЦена = Мин(МинимальнаяЦена,Параметры.Цена);
		Если МинимальнаяЦена <= 0 Тогда 
			МинимальнаяЦена = ПривестиСтрокуКЧислу(ВводимаяЦена);
		КонецЕсли;
	Иначе
		Элементы.МинимальнаяЦена.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ПервыйЭлемент = "Цена" Тогда
		КомандаЦена(Неопределено);
	ИначеЕсли ПервыйЭлемент = "Количество" Тогда
		КомандаКоличество(Неопределено);
	Иначе
		Отказ = Истина;
		СтруктураРезультат = Новый Структура;
		СтруктураРезультат.Вставить("Команда", "ОтказОтРедактирования");
		Закрыть(СтруктураРезультат);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Команда0(Команда)
	
	ДобавитьЦифру("0")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	
	ДобавитьЦифру("1")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда2(Команда)
	
	ДобавитьЦифру("2")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда3(Команда)
	
	ДобавитьЦифру("3")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда4(Команда)
	
	ДобавитьЦифру("4")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда5(Команда)
	
	ДобавитьЦифру("5")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда6(Команда)
	
	ДобавитьЦифру("6")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда7(Команда)
	
	ДобавитьЦифру("7")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда8(Команда)
	
	ДобавитьЦифру("8")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда9(Команда)
	
	ДобавитьЦифру("9")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда0ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("0")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда1ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("1")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда2ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("2")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда3ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("3")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда4ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("4")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда5ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("5")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда6ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("6")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда7ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("7")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда8ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("8")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда9ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("9")
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаТочка(Команда)
	
	Если ПолеРедактирования = "Количество" Тогда
		ВводимоеЧисло = ВводимоеКоличество;
	ИначеЕсли ПолеРедактирования = "Цена" Тогда
		ВводимоеЧисло = ВводимаяЦена;
	Иначе
		Возврат;
	КонецЕсли;
	
	Если ПервыйВвод Тогда
		ВводимоеЧисло = "";
		ПервыйВвод = Ложь;
	КонецЕсли;
	
	Если ВводимоеЧисло = "" Тогда
		ВводимоеЧисло = "0";
	КонецЕсли;
	
	ЧислоВхождений = СтрЧислоВхождений(ВводимоеЧисло, ",");
	
	Если Не ЧислоВхождений > 0 Тогда
		ВводимоеЧисло = ВводимоеЧисло + ",";
	КонецЕсли;
	
	Если ПолеРедактирования = "Количество" Тогда
		ВводимоеКоличество = ВводимоеЧисло;
	ИначеЕсли ПолеРедактирования = "Цена" Тогда
		ВводимаяЦена = ВводимоеЧисло;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСтереть(Команда)
	
	Если ПолеРедактирования = "Продавец" Тогда
		ВводимыйПродавец = ПредопределенноеЗначение("Справочник.ФизическиеЛица.ПустаяСсылка");
	ИначеЕсли ПолеРедактирования = "Количество" Тогда
		ВводимоеКоличество = "";
		ПервыйВвод = Ложь;
	ИначеЕсли ПолеРедактирования = "Цена" Тогда
		ВводимаяЦена = "";
		ПервыйВвод = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаEnter(Команда)
	
	КоличествоЧисло = ?(ЗначениеЗаполнено(ВводимоеКоличество),ПривестиСтрокуКЧислу(ВводимоеКоличество, Истина),0);
	//Если НЕ ЗначениеЗаполнено(КоличествоЧисло) Тогда
	//	ТекстОшибки = НСтр("en = 'Fill in the quantity'; fr = 'Remplissez la quantité'; ru = 'Заполните количество'; es = 'Llenar la cantidad'");
	//	ОбщегоНазначенияРТКлиент.ВывестиИнформациюДляРМКУправляемой(ТекстОшибки);
	//	Возврат;
	//КонецЕсли;
	
	КоличествоЦену = ?(ЗначениеЗаполнено(ВводимаяЦена),ПривестиСтрокуКЧислу(ВводимаяЦена, Истина),0);
	//Если НЕ ЗначениеЗаполнено(КоличествоЦену) Тогда
	//	ТекстОшибки = НСтр("en = 'Fill in the price'; fr = 'Remplissez le prix'; ru = 'Заполните цену'; es = 'Rellene el precio'");
	//	ОбщегоНазначенияРТКлиент.ВывестиИнформациюДляРМКУправляемой(ТекстОшибки);
	//	Возврат;
	//КонецЕсли;
	Если КоличествоЦену<МинимальнаяЦена Или МинимальнаяЦена = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	СтруктураРезультат = Новый Структура;
	//СтруктураРезультат.Вставить("Команда"      , "Редактирование");
	СтруктураРезультат.Вставить("Количество"   , КоличествоЧисло);
	СтруктураРезультат.Вставить("Цена"         , КоличествоЦену);
	//СтруктураРезультат.Вставить("Продавец"     , ВводимыйПродавец);
	//СтруктураРезультат.Вставить("ИзмененыСерии", ИзмененыСерии);
	//
	//СтруктураРезультат.Вставить("ТекущиеДанныеИдентификатор", ТекущиеДанныеИдентификатор);
	//
	//Если ИзмененыСерии Тогда
	//	СтруктураРезультат.Вставить("ПараметрыФормыУказанияСерий", ПараметрыФормыУказанияСерий);
	//КонецЕсли;
	//
	//СтруктураРезультат.Вставить("ИзмененыСертификаты", ИзмененыСертификаты);
	//Если ИзмененыСертификаты Тогда
	//	СтруктураРезультат.Вставить("ПараметрыФормыУказанияСертификатов", ПараметрыФормыУказанияСертификатов);
	//КонецЕсли;
	
	Закрыть(СтруктураРезультат)
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСторно(Команда)
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("Команда", "Сторно");
	
	
	Закрыть(СтруктураРезультат)
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаКоличество(Команда)
	ПолеРедактирования = "Количество";
	ПервыйВвод = Истина;
	КомандаКоличествоНаСервере();
	//Элементы.ВводимыйПродавец.ТолькоПросмотр   = Истина;
КонецПроцедуры

&НаСервере
Процедура КомандаКоличествоНаСервере()
	Элементы.ВводимоеКоличество.ТолькоПросмотр = Ложь;
	Элементы.ВводимаяЦена.ТолькоПросмотр       = Истина;
	Элементы.КомандаКоличество.ЦветФона = ЦветаСтиля.ЦветАктивности;
	Элементы.КомандаЦена.ЦветФона = ЦветаСтиля.ЦветФонаКнопки;
КонецПроцедуры

&НаКлиенте
Процедура КомандаЦена(Команда)
	ПолеРедактирования = "Цена";
	ПервыйВвод = Истина;
	КомандаЦенаНаСервере();
	//Элементы.ВводимыйПродавец.ТолькоПросмотр   = Истина;
КонецПроцедуры

&НаСервере
Процедура КомандаЦенаНаСервере()
	Элементы.ВводимоеКоличество.ТолькоПросмотр = Истина;
	Элементы.ВводимаяЦена.ТолькоПросмотр       = Ложь;
	Элементы.КомандаЦена.ЦветФона = ЦветаСтиля.ЦветАктивности;
	Элементы.КомандаКоличество.ЦветФона = ЦветаСтиля.ЦветФонаКнопки;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ДобавитьЦифру(ВведеннаяЦифраСтрокой)
	
	Если ПолеРедактирования = "Количество" Тогда
		ВводимоеЧисло = ВводимоеКоличество;
		КоличествоСимволовПослеЗапятой = 3;
	ИначеЕсли ПолеРедактирования = "Цена" Тогда
		ВводимоеЧисло = ВводимаяЦена;
		КоличествоСимволовПослеЗапятой = 2;
	Иначе
		Возврат;
	КонецЕсли;
	
	Если ПервыйВвод Тогда
		ВводимоеЧисло = "";
		ПервыйВвод = Ложь;
	КонецЕсли;
	
	Запятая = Сред(ВводимоеЧисло, СтрДлина(ВводимоеЧисло) - КоличествоСимволовПослеЗапятой, 1);
	
	Если НЕ Запятая = "," Тогда
		ВводимоеЧисло = ВводимоеЧисло + ВведеннаяЦифраСтрокой;
	КонецЕсли;
	
	Если ПолеРедактирования = "Количество" Тогда
		ВводимоеКоличество = ВводимоеЧисло;
	ИначеЕсли ПолеРедактирования = "Цена" Тогда
		ВводимаяЦена = ВводимоеЧисло;
		ВводимаяЦенаПриИзмененииНаСервере();
	КонецЕсли;
	
	ТекущийЭлемент = Элементы.КомандаEnter;
	
КонецПроцедуры

// Функция выполняет приведение строки к числу.
// Параметры:
//  ЧислоСтрокой           - Строка - Строка приводимая к числу.
//  ВозвращатьНеопределено - Булево - Если Истина и строка содержит некорректное значение, то возвращать Неопределено.
//
// Возвращаемое значение:
//  Число
//
&НаСервере
Функция ПривестиСтрокуКЧислу(ЧислоСтрокой, ВозвращатьНеопределено = Ложь)
	
	ОписаниеТипаЧисла = Новый ОписаниеТипов("Число");
	ЗначениеЧисла = ОписаниеТипаЧисла.ПривестиЗначение(ЧислоСтрокой);
	
	Если ВозвращатьНеопределено И (ЗначениеЧисла = 0) Тогда
		
		Стр = Строка(ЧислоСтрокой);
		Если Стр = "" Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Стр = СтрЗаменить(СокрЛП(Стр), "0", "");
		Если (Стр <> "") И (Стр <> ".") И (Стр <> ",") Тогда
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЗначениеЧисла;
	
КонецФункции

&НаСервере
Процедура УстановитьНедоступностьЦифровогоВвода()
	
	Элементы.Команда0.Доступность = Ложь;
	Элементы.Команда1.Доступность = Ложь;
	Элементы.Команда2.Доступность = Ложь;
	Элементы.Команда3.Доступность = Ложь;
	Элементы.Команда4.Доступность = Ложь;
	Элементы.Команда5.Доступность = Ложь;
	Элементы.Команда6.Доступность = Ложь;
	Элементы.Команда7.Доступность = Ложь;
	Элементы.Команда8.Доступность = Ложь;
	Элементы.Команда9.Доступность = Ложь;
	
	Элементы.Команда0ПраваяКлавиатура.Доступность = Ложь;
	Элементы.Команда1ПраваяКлавиатура.Доступность = Ложь;
	Элементы.Команда2ПраваяКлавиатура.Доступность = Ложь;
	Элементы.Команда3ПраваяКлавиатура.Доступность = Ложь;
	Элементы.Команда4ПраваяКлавиатура.Доступность = Ложь;
	Элементы.Команда5ПраваяКлавиатура.Доступность = Ложь;
	Элементы.Команда6ПраваяКлавиатура.Доступность = Ложь;
	Элементы.Команда7ПраваяКлавиатура.Доступность = Ложь;
	Элементы.Команда8ПраваяКлавиатура.Доступность = Ложь;
	Элементы.Команда9ПраваяКлавиатура.Доступность = Ложь;
	
	Элементы.КомандаТочка.Доступность = Ложь;
	Элементы.КомандаСтереть.Доступность = Ложь;
	
	Элементы.КомандаТочкаПраваяКлавиатура.Доступность = Ложь;
	Элементы.КомандаСтеретьПраваяКлавиатура.Доступность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ВводимаяЦенаПриИзменении(Элемент)
	ВводимаяЦенаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВводимаяЦенаПриИзмененииНаСервере()
	Если ПривестиСтрокуКЧислу(ВводимаяЦена)<МинимальнаяЦена Тогда 
		Элементы.ВводимаяЦена.ЦветТекста = ЦветаСтиля.Цвет_Красный;
	Иначе
		Элементы.ВводимаяЦена.ЦветТекста = Новый Цвет();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти