
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Описание.Заголовок = Нстр("fr = 'Explication'; ru = 'Описание'; en = 'Description'; es = 'Descripción'");       
	ЭтаФорма.Заголовок = Нстр("fr = 'Demande de recherche de produit'; ru = 'Заявка на поиск товара'; en = 'Product search request'; es = 'Solicitud de búsqueda de producto'"); 
	Элементы.КомандаЗаписатьЗаявкуНаПоискТовара.Заголовок = Нстр("fr = 'Faire une demande de recherche de produit'; ru = 'Оформить заявку на поиск товара'; en = 'Apply for a product search'; es = 'Solicitar la búsqueda de productos'");
    ПоисковыйЗапрос = ЭтаФорма.Параметры.ПоисковыйЗапрос;
КонецПроцедуры

&НаСервере
Процедура КомандаЗаписатьЗаявкуНаПоискТовараНаСервере()
	
	Док = Документы.ЗаявкаНаПоискТовара.СоздатьДокумент();
	Док.Дата = ТекущаяДата();  
	док.Статус = Перечисления.СтатусыЗаявокНаПоискТоваров.ОжидаетМенеджера;
	Док.Описание = Нстр("fr = 'Requête de recherche - '; ru = 'Поисковый запрос - '; en = 'Search query - '; es = 'Consulta de búsqueda - '")+
	ПоисковыйЗапрос + Символы.ПС+
	СокрЛП(Описание); 
	Док.Контрагент = ПараметрыСеанса.Контрагент;
	Док.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаписатьЗаявкуНаПоискТовара(Команда)
	КомандаЗаписатьЗаявкуНаПоискТовараНаСервере();  
	ЭтаФорма.Закрыть();
КонецПроцедуры
