
#Область Обработчики_событий_формы
 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьПараметрыСписка();
	НастроитьФорму();
КонецПроцедуры 

#КонецОбласти

#Область Обработчики_элементов_формы
                           
#КонецОбласти

#Область Дополнительно

&НаСервере
Процедура УстановитьПараметрыСписка()
	Справочники.Номенклатура.УстановитьПараметрыСписка(Элементы.Список, Список, ДЗСегменты);
	Список.Параметры.УстановитьЗначениеПараметра("НачалоПериода", ДобавитьМесяц(ТекущаяДата(),-12));
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОперацииСПодключаемымОборудованиемКлиент.ПодключитьОборудование(УникальныйИдентификатор, Истина); 
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ScanData" и ВводДоступен() Тогда 
		Штрихкод = ОперацииСПодключаемымОборудованиемКлиент.ПолучитьШтрихкод(ИмяСобытия, Параметр, Источник);
		СтруктураТОвара = ОбщегоНазначенияВызовСервера.ПолучитьНоменклатуруПоШтрихкоду(Штрихкод);
		Если СтруктураТОвара <> Неопределено И ЗначениеЗаполнено(СтруктураТОвара.Номенклатура) Тогда
			Элементы.Список.ТекущаяСтрока = СтруктураТОвара.Номенклатура;
			ОткрытьФорму("Справочник.Номенклатура.ФормаОбъекта",Новый Структура("Ключ",СтруктураТОвара.Номенклатура));
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура НастроитьФорму()
	ЭтоPDV = ЭтоPDV();
	Элементы.КодПоставщика.Видимость = не ЭтоPDV;
	Элементы.КодПроизводителя.Видимость = не ЭтоPDV;
	Элементы.ОсновнойПоставщик.Видимость = не ЭтоPDV;
	Элементы.КодСтарый.Видимость = не ЭтоPDV;
	Элементы.Продажи.Видимость = не ЭтоPDV;
КонецПроцедуры

&НаСервере
Функция ЭтоPDV()
	Возврат РольДоступна("PDV");
КонецФункции

#КонецОбласти


