
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗначениеВРеквизитФормы(РегистрыСведений.РеквизитыКонтрагентов.ПолучитьДеревоРеквизитовКонтрагента(Объект.Ссылка), "ДЗРеквизиты");
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	УстановитьПривилегированныйРежим(Истина);
	Фотография = ПолучитьНавигационнуюСсылку(ТекущийОбъект.Ссылка, "Фотография");
	Структура = РегистрыСведений.ТарифныеСтавки.ПолучитьДанныеСотрудника(ТекущийОбъект.Ссылка, ТекущаяДатаСеанса());
	Должность = Структура.Должность;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ГруппаСотрудник.Видимость = Истина;
	ОбщегоНазначенияКлиент.РазвернутьДеревоЗначений(ДЗРеквизиты, Элементы.ДЗРеквизиты);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.Наименование = СокрЛП(СокрЛП(Объект.Фамилия) + " " + СокрЛП(Объект.Имя) + " " + СокрЛП(Объект.Отчество));
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ОбщегоНазначения.ЗаписатьДанныеВХранилищеЗначения(ТекущийОбъект, "Фотография", Фотография);  
	РеквизитыКонтрагентов.ПередЗаписьюНаСервере(ТекущийОбъект, РеквизитФормыВЗначение("ДЗРеквизиты"), Отказ);
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	РеквизитыКонтрагентов.ПриЗаписиНаСервере(ТекущийОбъект, РеквизитФормыВЗначение("ДЗРеквизиты"));
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура ИзображениеНажатие(Элемент, СтандартнаяОбработка)
	ПрисоединённыеФайлыКлиент.ВыбратьИзображение(ЭтаФорма, Элемент.Имя, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьФотографию(Команда)
	ПрисоединённыеФайлыКлиент.УдалитьИзображение(ЭтаФорма, Фотография);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРеквизит(Команда)
	РеквизитыКонтрагентовКлиент.СформироватьМенюВыбораВидаРеквизита(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура КомментарийРеквизита(Команда)
	РеквизитыКонтрагентовКлиент.ОткрытьФормуВводаДополнительныхДанных(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьВАдресДоставки(Команда)
	РеквизитыКонтрагентовКлиент.Скопировать(ЭтаФорма, ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.АдресДоставки"));
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьВАдресПроживания(Команда)
	РеквизитыКонтрагентовКлиент.Скопировать(ЭтаФорма, ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.АдресПроживания"));
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьВАдресПоПрописке(Команда)
	РеквизитыКонтрагентовКлиент.Скопировать(ЭтаФорма, ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.АдресПоПрописке"));
КонецПроцедуры

&НаКлиенте
Процедура ДЗРеквизитыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	РеквизитыКонтрагентовКлиент.ВыборТаблицаФормы(ЭтаФорма, ВыбраннаяСтрока, СтандартнаяОбработка);	
КонецПроцедуры

&НаКлиенте
Процедура ДЗРеквизитыПриАктивизацииСтроки(Элемент)
	РеквизитыКонтрагентовКлиент.ПриАктивацииСтроки(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ДЗРеквизитыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	РеквизитыКонтрагентовКлиент.ОбработкаВыбораТаблицаФормы(ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка); 
КонецПроцедуры

&НаКлиенте
Процедура ДЗРеквизитыПередНачаломИзменения(Элемент, Отказ)
	РеквизитыКонтрагентовКлиент.ПередНачаломИзменения(ЭтаФорма);
КонецПроцедуры

#КонецОбласти





