
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РаботаСДокументами.МожноРедактироватьДокументВФорме(Объект.Ссылка, ЭтаФорма);
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, Объект);
	НастроитьФорму();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Не Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ОперационныеЗатраты") Тогда 
		Объект.Сумма = Объект.ТЧРасходы.Итог("Сумма");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, ТекущийОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ХозяйственнаяОперацияПриИзменении(Элемент)
	НастроитьФорму();
КонецПроцедуры

&НаСервере
Процедура НастроитьФорму()
	ЭтоОперационныеЗатраты = Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОперационныеЗатраты;
	Элементы.Контрагент.Видимость = ЭтоОперационныеЗатраты;
	Элементы.СтатьяДДС.Видимость = ЭтоОперационныеЗатраты;
	Элементы.Сумма.Видимость = ЭтоОперационныеЗатраты;
	Элементы.ТЧРасходы.Видимость = Не ЭтоОперационныеЗатраты;
КонецПроцедуры
