
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РаботаСДокументами.МожноРедактироватьДокументВФорме(Объект.Ссылка, ЭтаФорма);
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыФункциональныхОпций(ЭтаФорма);
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОперацииСПодключаемымОборудованиемКлиент.ПодключитьОборудование(УникальныйИдентификатор, Истина); 
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПоказатьСебестоимость();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить(РаботаСДокументами.СвойствоЗаписьИзФормы(), Истина);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ПоказатьСебестоимость();
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, ТекущийОбъект);
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы  

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыФункциональныхОпций(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура МестоХраненияПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыФункциональныхОпций(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ПоказатьСебестоимость();
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекСтр = Элемент.ТекущиеДанные;
		ТекСтр.КодСтроки = РаботаСДокументамиКлиентСервер.ПолучитьСледующийКодСтроки(Объект.ТЧТовары);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыУпаковкаПриИзменении(Элемент) 
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСерияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекСтр = Элементы.ТЧТовары.ТекущиеДанные;
	ДанныеОтбора = Новый Структура("МестоХранения, Номенклатура, Характеристика", Объект.МестоХранения, ТекСтр.Номенклатура, ТекСтр.Характеристика); 
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораСерии",ЭтотОбъект,ТекСтр);
	СерииИРазмещениеКлиент.ВыбратьСериюПоОстаткам(РаботаСДокументамиВызовСервера.ПолучитьГраницуДокумента(Объект), ДанныеОтбора, Оповещение, ТекСтр);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураПриИзменении(Элемент)
	РассчитатьСтоимостьПоСтроке(Элементы.ТЧТовары.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыХарактеристикаПриИзменении(Элемент)
	РассчитатьСтоимостьПоСтроке(Элементы.ТЧТовары.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыЦенаНоваяПриИзменении(Элемент)
	ТекСтрока = Элементы.ТЧТовары.ТекущиеДанные;
	ТекСтрока.СебестоимостьНовая = ТекСтрока.ЦенаНовая * ТекСтрока.Количество;	
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПриИзменении(Элемент)
	РассчитатьОбщуюСтоимость();
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСерияПриИзменении(Элемент)
	РассчитатьСтоимостьПоСтроке(Элементы.ТЧТовары.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	РаботаСДокументамиКлиент.ОбрабокаВыбораПриАвтоподбореНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, ВыбранноеЗначение, Объект, СтандартнаяОбработка);
	РассчитатьСтоимостьПоСтроке(Элементы.ТЧТовары.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ПараметрыПолученияДанных.Вставить("ВыводитьСерию",Истина);
	РаботаСДокументамиКлиент.АвтоподборНоменклатуры(ДанныеВыбора, ПараметрыПолученияДанных, Объект, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область Дополнительно

&НаСервере
Процедура ПоказатьСебестоимость()
	ТЗ = Объект.ТЧТовары.Выгрузить();
	МасНоменклатура = ТЗ.ВыгрузитьКолонку("Номенклатура");
	МасХарактеристики = ТЗ.ВыгрузитьКолонку("Характеристика");	
	МасСерии = ТЗ.ВыгрузитьКолонку("Серия");	
	ДатаЦен = РаботаСДокументамиВызовСервера.ПолучитьГраницуДокумента(Объект);
	ТЗСебестоимость = ПолучитьСтоимостьПоОстаткам(МасНоменклатура,МасХарактеристики,МасСерии,ДатаЦен,Объект.МестоХранения);
	Для Каждого Стр Из Объект.ТЧТовары Цикл
		Мас = ТЗСебестоимость.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Серия", Стр.Номенклатура, Стр.Характеристика, Стр.Серия));
		Если Мас.Количество() = 0 Тогда
			Стр.Цена = 0;	
			Стр.Себестоимость = 0;	
		Иначе
			Стр.Количество = Мас[0].Количество;
			Стр.Цена = Мас[0].Цена;	
			Стр.Себестоимость = Мас[0].Сумма;	
		КонецЕсли;	
		Стр.СебестоимостьНовая = Стр.ЦенаНовая * Стр.Количество;	
	КонецЦикла;
	РассчитатьОбщуюСтоимость();
КонецПроцедуры

&НаСервере
Процедура РассчитатьСтоимостьПоСтрокеНаСервере(Стр) 
	ДатаЦен = РаботаСДокументамиВызовСервера.ПолучитьГраницуДокумента(Объект);
	ТЗСебестоимость = ПолучитьСтоимостьПоОстаткам(Стр.Номенклатура,Стр.Характеристика,Стр.Серия,ДатаЦен,Объект.МестоХранения);
	Мас = ТЗСебестоимость.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Серия", Стр.Номенклатура, Стр.Характеристика, Стр.Серия));
	Если Мас.Количество() = 0 Тогда
		Стр.Цена = 0;	
		Стр.Себестоимость = 0;	
	Иначе
		Стр.Количество = Мас[0].Количество;
		Стр.Цена = Мас[0].Цена;	
		Стр.Себестоимость = Мас[0].Сумма;	
	КонецЕсли;	
	Стр.СебестоимостьНовая = Стр.ЦенаНовая * Стр.Количество;	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСтоимостьПоСтроке(ТекСтрока)
	Если ТекСтрока = Неопределено Тогда Возврат; КонецЕсли;
	СтруктураСтроки = Новый Структура("Номенклатура,Характеристика,Серия,Количество,Цена,Себестоимость,ЦенаНовая,СебестоимостьНовая");
	ЗаполнитьЗначенияСвойств(СтруктураСтроки,ТекСтрока);
	РассчитатьСтоимостьПоСтрокеНаСервере(СтруктураСтроки);
	ЗаполнитьЗначенияСвойств(ТекСтрока,СтруктураСтроки);
КонецПроцедуры

&НаСервере
Процедура РассчитатьОбщуюСтоимость();
	ОбщаяСебестоимость = Объект.ТЧТовары.Итог("Себестоимость");
	ОбщаяСебестоимостьНовая = Объект.ТЧТовары.Итог("СебестоимостьНовая");
КонецПроцедуры

&НаСервере
Функция ПолучитьСтоимостьПоОстаткам(Номенклатура, Характеристики, Серии, ДатаСреза, Склад) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВЗ.Номенклатура КАК Номенклатура,
	                      |	ВЗ.Характеристика КАК Характеристика,
	                      |	ВЗ.Серия КАК Серия,
	                      |	ВЗ.Количество КАК Количество,
	                      |	ВЗ.Сумма КАК Сумма,
	                      |	ВЫБОР
	                      |		КОГДА ВЗ.Количество = 0
	                      |			ТОГДА 0
	                      |		ИНАЧЕ ВЫРАЗИТЬ(ВЗ.Сумма / ВЗ.Количество КАК ЧИСЛО(12, 2))
	                      |	КОНЕЦ КАК Цена
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		ВЗ.Номенклатура КАК Номенклатура,
	                      |		ВЗ.Характеристика КАК Характеристика,
	                      |		ВЗ.Серия КАК Серия,
	                      |		СУММА(ВЗ.Количество) КАК Количество,
	                      |		СУММА(ВЗ.Сумма) КАК Сумма
	                      |	ИЗ
	                      |		(ВЫБРАТЬ
	                      |			ТоварыВНаличииОстатки.Номенклатура КАК Номенклатура,
	                      |			ТоварыВНаличииОстатки.Характеристика КАК Характеристика,
	                      |			ТоварыВНаличииОстатки.Серия КАК Серия,
	                      |			ТоварыВНаличииОстатки.КоличествоОстаток КАК Количество,
	                      |			ТоварыВНаличииОстатки.СуммаОстаток КАК Сумма
	                      |		ИЗ
	                      |			РегистрНакопления.ТоварыВНаличии.Остатки(
	                      |					&ДатаСреза,
	                      |					Номенклатура В (&Номенклатура)
	                      |						И Характеристика В (&Характеристики)
	                      |						И Серия В (&Серии)
	                      |						И МестоХранения = &Склад) КАК ТоварыВНаличииОстатки
	                      |		
	                      |		ОБЪЕДИНИТЬ ВСЕ
	                      |		
	                      |		ВЫБРАТЬ
	                      |			ИздержкиОстатки.Номенклатура,
	                      |			ИздержкиОстатки.Характеристика,
	                      |			ИздержкиОстатки.Серия,
	                      |			0,
	                      |			ИздержкиОстатки.СуммаОстаток
	                      |		ИЗ
	                      |			РегистрНакопления.ДополнительныеРасходы.Остатки(
	                      |					&ДатаСреза,
	                      |					Номенклатура В (&Номенклатура)
	                      |						И Характеристика В (&Характеристики)
	                      |						И Серия В (&Серии)
	                      |						И МестоХранения = &Склад) КАК ИздержкиОстатки) КАК ВЗ
	                      |	
	                      |	СГРУППИРОВАТЬ ПО
	                      |		ВЗ.Номенклатура,
	                      |		ВЗ.Характеристика,
	                      |		ВЗ.Серия) КАК ВЗ");
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристики", Характеристики);
	Запрос.УстановитьПараметр("Серии", Серии);
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.УстановитьПараметр("Склад", Склад);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

&НаКлиенте
Процедура ПослеВыбораСерии(РезультатЗакрытия, ДанныеСтроки) Экспорт
	Если РезультатЗакрытия = Неопределено Тогда Возврат КонецЕсли;
	ДанныеСтроки.Серия = РезультатЗакрытия.Серия;
	РассчитатьСтоимостьПоСтроке(ДанныеСтроки);
КонецПроцедуры

#КонецОбласти

#Область Оповещения

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ScanData" и ВводДоступен() Тогда 
		Штрихкод = ОперацииСПодключаемымОборудованиемКлиент.ПолучитьШтрихкод(ИмяСобытия, Параметр, Источник);
		СтруктураТОвара = ОбщегоНазначенияВызовСервера.ПолучитьНоменклатуруПоШтрихкоду(Штрихкод);
		Если СтруктураТОвара = Неопределено Тогда
			Оп = Новый ОписаниеОповещения("ПослеДобавленияНоменклатуры",ЭтаФорма,Новый Структура("Штрихкод",Штрихкод));
			ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента",Новый Структура("Штрихкод",Штрихкод),ЭтаФорма,,,,Оп,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Иначе
			РаботаСДокументамиКлиентСервер.ДобавитьНоменклатуруПоШтрихкоду(Штрихкод, Объект, СтруктураТОвара,,,ЭтаФорма);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
