
Функция ПолучитьОстатокВыплатыЗПОснованию(Основание, Проведенные = Истина) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ЕСТЬNULL(СвязанныеДокументы.Ссылка.Сумма, 0) КАК Сумма
	                      |ИЗ
	                      |	КритерийОтбора.СвязанныеДокументы(&Основание) КАК СвязанныеДокументы
	                      |ГДЕ
	                      |	(ВЫБОР
	                      |					КОГДА &Проведенные
	                      |						ТОГДА СвязанныеДокументы.Ссылка.Проведен
	                      |					ИНАЧЕ ИСТИНА
	                      |				КОНЕЦ
	                      |				И СвязанныеДокументы.Ссылка ССЫЛКА Документ.РасходныйКассовыйОрдер
	                      |			ИЛИ СвязанныеДокументы.Ссылка ССЫЛКА Документ.СписаниеБезналичныхДенежныхСредств)");	
	Запрос.УстановитьПараметр("Основание", Основание);
	Запрос.УстановитьПараметр("Проведенные", Проведенные);
	Сумма = Запрос.Выполнить().Выгрузить().Итог("Сумма");
	Возврат Сумма;
КонецФункции
