
#Область Интерфейс

Процедура УказатьСерии(ТекСтр, Объект, ВсеСерии = Ложь, КолонкаКоличество = "") Экспорт
	Если ТекСтр = Неопределено Тогда		
		ПоказатьПредупреждение(, Нстр("fr = 'Sélectionnez la ligne avec la nomenclature'; ru = 'Выделите строку с номенклатурой'; en = 'Select the line with the item'; es = 'Resalte la línea con el artículo'"),, "Внимание");
		Возврат;
	КонецЕсли; 
	КолонкаКоличество = ?(КолонкаКоличество = "","КоличествоУпаковок",КолонкаКоличество);
	ПараметрыФормы = Новый Структура;	
	ПараметрыФормы.Вставить("Ссылка", Объект.Ссылка);
	ПараметрыФормы.Вставить("ДатаДокумента", Объект.Дата);
	ПараметрыФормы.Вставить("Организация", Объект.Организация);
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Или ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ВозвратПоставщику") Тогда
		ПараметрыФормы.Вставить("Производитель", Объект.Контрагент);
	Иначе
		ПараметрыФормы.Вставить("Производитель", ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка"));	
	КонецЕсли;
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Или ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ВозвратОтПокупателя") Тогда
		ПараметрыФормы.Вставить("Клиент", Объект.Контрагент);
	Иначе
		ПараметрыФормы.Вставить("Клиент", ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка"));	
	КонецЕсли;
	ПараметрыФормы.Вставить("МестоХранения", Объект.МестоХранения);
	ПараметрыФормы.Вставить("Номенклатура", ТекСтр.Номенклатура);
	ПараметрыФормы.Вставить("Характеристика", ТекСтр.Характеристика);
	ПараметрыФормы.Вставить("Упаковка", ТекСтр.Упаковка);
	ПараметрыФормы.Вставить("Количество", ТекСтр[КолонкаКоличество]);
	ПараметрыФормы.Вставить("МасСерии", ПодготовитьМассивСерий(Объект.ТЧСерии, ТекСтр, КолонкаКоличество));
	ПараметрыФормы.Вставить("ВсеСерии", ВсеСерии);
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияФормыУстановкиСерий", СерииИРазмещениеКлиент, Новый Структура("Объект, КодСтроки", Объект, ТекСтр.КодСтроки));
	ОткрытьФорму("Справочник.СерииНоменклатуры.Форма.УстановкаСерий", ПараметрыФормы,,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры

Функция ПодготовитьМассивСерий(ТЗСерии, ТекСтр = Неопределено, КолонкаКоличество = "") Экспорт
	КолонкаКоличество = ?(КолонкаКоличество = "","КоличествоУпаковок",КолонкаКоличество);
	Результат = Новый Массив;
	Если ТекСтр = Неопределено Тогда
		Мас = ТЗСерии;
	Иначе	
		Мас = ТЗСерии.НайтиСтроки(Новый Структура("КодСтроки", ТекСтр.КодСтроки));
		Если ЗначениеЗаполнено(ТекСтр.Серия) Тогда
			Результат.Добавить(Новый Структура("Серия, Количество", ТекСтр.Серия, ТекСтр[КолонкаКоличество]));
			Мас = Новый Массив;
		КонецЕсли;		
	КонецЕсли;	
	Для Каждого Стр Из Мас Цикл
		Результат.Добавить(Новый Структура("Серия, Количество", Стр.Серия, Стр.Количество));	
	КонецЦикла;
	Возврат Результат;
КонецФункции

Процедура ВыбратьСериюПоОстаткам(ДатаОстатков = Неопределено, ДанныеОтбора, Оповещение = Неопределено, ДанныеСтроки = Неопределено) Экспорт
	Если Не ДанныеОтбора.Свойство("Производитель") Тогда
		ДанныеОтбора.Вставить("Производитель", ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка"));	
	КонецЕсли;	
	Если Не ДанныеОтбора.Свойство("Клиент") Тогда
		ДанныеОтбора.Вставить("Клиент", ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка"));	
	КонецЕсли;
	Если Не ДанныеОтбора.Свойство("ВсеСерии") Тогда
		ДанныеОтбора.Вставить("ВсеСерии", Ложь);	
	КонецЕсли;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДатаОстатков", ДатаОстатков);
	ПараметрыФормы.Вставить("МестоХранения", ДанныеОтбора.МестоХранения);
	ПараметрыФормы.Вставить("Номенклатура", ДанныеОтбора.Номенклатура);
	ПараметрыФормы.Вставить("Характеристика", ДанныеОтбора.Характеристика);
	ПараметрыФормы.Вставить("Производитель", ДанныеОтбора.Производитель);
	ПараметрыФормы.Вставить("Клиент", ДанныеОтбора.Клиент);
	ПараметрыФормы.Вставить("ВсеСерии", ДанныеОтбора.ВсеСерии);
	Если Оповещение = Неопределено Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияФормыВыбораСерии", СерииИРазмещениеКлиент, ДанныеСтроки);	
	КонецЕсли;
	ОткрытьФорму("Справочник.СерииНоменклатуры.Форма.ВыборСерииПоОстаткам", ПараметрыФормы,,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

Функция ПроверитьСоответствиеСерийТоварам(Форма, ТЧТовары, ТЧСерии, ПараметрыЗаписи, КолонкаКоличество = "КоличествоУпаковок") Экспорт
	Результат = Истина;
	ТекстОшибки = ""; 
	Для Каждого Стр Из ТЧТовары Цикл
		Мас = ТЧСерии.НайтиСтроки(Новый Структура("КодСтроки", Стр.КодСтроки));
		Если Мас.Количество() = 0 Тогда Продолжить КонецЕсли; // Серия одна, и указана в табличной части
		КоличествоВСериях = 0;
		Для Каждого МасСтр Из Мас Цикл
			КоличествоВСериях = КоличествоВСериях + МасСтр.Количество;	
		КонецЦикла;
		Если КоличествоВСериях <> Стр[КолонкаКоличество] Тогда
			ТекущаяОшибка = Нстр("ru = 'Неверно указаны серии - '; fr = 'Séries incorrectement spécifiées -'") + ОбщегоНазначенияКлиентСервер.ПредставлениеНоменклатуры(Стр.Номенклатура, Стр.Характеристика);	
			ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(ТекстОшибки, ТекущаяОшибка, Символы.ПС);
			Результат = Ложь;
		КонецЕсли;	
	КонецЦикла;
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ПоказатьПредупреждение(, ТекстОшибки,, "Ошибка"); 	
	КонецЕсли;	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область Оповещения

Процедура ПослеЗакрытияФормыВыбораСерии(РезультатЗакрытия, ДанныеСтроки) Экспорт
	Если РезультатЗакрытия = Неопределено Тогда Возврат КонецЕсли;
	ДанныеСтроки.Серия = РезультатЗакрытия.Серия;
КонецПроцедуры

Процедура ПослеЗакрытияФормыУстановкиСерий(МасСерии, ДополнительныеПараметры) Экспорт
	Если МасСерии = Неопределено Тогда Возврат КонецЕсли;
	Объект = ДополнительныеПараметры.Объект;
	РаботаСДокументамиКлиентСервер.УдалитьСвязанныеСтроки(Объект, "ТЧСерии", ДополнительныеПараметры.КодСтроки);
	Стр = Объект.ТЧТовары.НайтиСтроки(Новый Структура("КодСтроки", ДополнительныеПараметры.КодСтроки))[0];
	Если МасСерии.Количество() = 0 Тогда
		Стр.Серия = Неопределено;
		Стр.УказаноНесколькоСерий = Ложь;	
	ИначеЕсли МасСерии.Количество() = 1 Тогда
		Стр.Серия = МасСерии[0].Серия;
		Стр.УказаноНесколькоСерий = Ложь; 
	Иначе
		Стр.Серия = Неопределено;
		Стр.УказаноНесколькоСерий = Истина;
		Для Каждого Стр Из МасСерии Цикл
			НС = Объект.ТЧСерии.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Стр);
			НС.КодСтроки = ДополнительныеПараметры.КодСтроки;		
		КонецЦикла;
	КонецЕсли;		
КонецПроцедуры

#КонецОбласти

	