
#Область Обработчики_событий_формы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьРеквизитов();
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура ВидГрафикаПриИзменении(Элемент)
	СформироватьНаименование();
	УстановитьВидимостьРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура РабочийДеньЧасовПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура РабочихДнейПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ВыходныхДнейПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

#КонецОбласти

#Область Дополнительно

&НаКлиенте
Процедура УстановитьВидимостьРеквизитов()
	ЭтоСменныйГрафик = Объект.ВидГрафика = ПредопределенноеЗначение("Перечисление.ВидыГрафиковРаботы.Сменный");
	Элементы.ГруппаВариантСменногоГрафика.Видимость = ЭтоСменныйГрафик;
	Элементы.РабочихДней.АвтоОтметкаНезаполненного = ЭтоСменныйГрафик;
	Элементы.ВыходныхДней.АвтоОтметкаНезаполненного = ЭтоСменныйГрафик;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНаименование()
	Объект.Наименование = СокрЛП(Объект.ВидГрафика) + " (" + Строка(Объект.РабочийДеньЧасов) + " часов)";
	Если Объект.ВидГрафика = ПредопределенноеЗначение("Перечисление.ВидыГрафиковРаботы.Сменный") Тогда
		Объект.Наименование = Объект.Наименование + " - " + Строка(Объект.РабочихДней) + " дня через " + Строка(Объект.ВыходныхДней);	
	КонецЕсли;	
КонецПроцедуры	

#КонецОбласти
