
#Область Обработчики_событий_формы 
 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РаботаСДокументами.МожноРедактироватьДокументВФорме(Объект.Ссылка, ЭтаФорма);
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыФункциональныхОпций(ЭтаФорма);
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОперацииСПодключаемымОборудованиемКлиент.ПодключитьОборудование(УникальныйИдентификатор, Истина); 
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПоказатьСебестоимость();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить(РаботаСДокументами.СвойствоЗаписьИзФормы(), Истина);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ПоказатьСебестоимость();
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, ТекущийОбъект);
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура ТЧТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекСтр = Элемент.ТекущиеДанные;
		ТекСтр.КодСтроки = РаботаСДокументамиКлиентСервер.ПолучитьСледующийКодСтроки(Объект.ТЧТовары);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ПараметрыПолученияДанных.Вставить("ВыводитьСерию",Истина);
	РаботаСДокументамиКлиент.АвтоподборНоменклатуры(ДанныеВыбора, ПараметрыПолученияДанных, Объект, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	РаботаСДокументамиКлиент.ОбрабокаВыбораПриАвтоподбореНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, ВыбранноеЗначение, Объект, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураОприходованиеАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	РаботаСДокументамиКлиент.АвтоподборНоменклатуры(ДанныеВыбора, ПараметрыПолученияДанных, Объект, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураОприходованиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	РаботаСДокументамиКлиент.ОбрабокаВыбораПриАвтоподбореНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, ВыбранноеЗначение, Объект, СтандартнаяОбработка, "Оприходование");
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыКоличествоУпаковокПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыКоличествоУпаковокОприходованиеПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные,,, "Оприходование");
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСерияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекСтр = Элементы.ТЧТовары.ТекущиеДанные;
	ДанныеОтбора = Новый Структура("МестоХранения, Номенклатура, Характеристика", Объект.МестоХранения, ТекСтр.Номенклатура, ТекСтр.Характеристика); 
	СерииИРазмещениеКлиент.ВыбратьСериюПоОстаткам(РаботаСДокументамиВызовСервера.ПолучитьГраницуДокумента(Объект), ДанныеОтбора,, ТекСтр);
КонецПроцедуры

#КонецОбласти

#Область Дополнительно

&НаСервере
Процедура ПоказатьСебестоимость()
	ТЗСебестоимость = РегистрыНакопления.ТоварыВНаличии.ПолучитьСебестоимостьПоДокументу(Объект.Ссылка);
	ОбщаяСебестоимость = 0;
	ОбщаяСебестоимостьОприходование = 0;
	Для Каждого Стр Из Объект.ТЧТовары Цикл
		// Списание
		Мас = ТЗСебестоимость.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Серия, ВидДвижения", Стр.Номенклатура, Стр.Характеристика, Стр.Серия, ВидДвиженияНакопления.Расход));
		Если Мас.Количество() = 0 Тогда
			Стр.Себестоимость = 0;	
		Иначе
			Стр.Себестоимость = ?(Мас[0].Количество = Стр.Количество, Мас[0].Сумма, Мас[0].Сумма / Мас[0].Количество * Стр.Количество);	
		КонецЕсли;
		Стр.Цена = ?(Стр.КоличествоУпаковок = 0, 0, Стр.Себестоимость / Стр.КоличествоУпаковок);
		ОбщаяСебестоимость = ОбщаяСебестоимость + Стр.Себестоимость;
		// Оприходование
		Мас = ТЗСебестоимость.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Серия, ВидДвижения", Стр.НоменклатураОприходование, Стр.ХарактеристикаОприходование, Стр.СерияОприходование, ВидДвиженияНакопления.Приход));
		Если Мас.Количество() = 0 Тогда
			Стр.СебестоимостьОприходование = 0;	
		Иначе
			КоличествоРасчёта = ?(Стр.КоличествоОприходование > 0, Стр.КоличествоОприходование, Стр.Количество);
			Стр.СебестоимостьОприходование = ?(Мас[0].Количество = КоличествоРасчёта, Мас[0].Сумма, Мас[0].Сумма / Мас[0].Количество * КоличествоРасчёта);	
		КонецЕсли;
		ОбщаяСебестоимостьОприходование = ОбщаяСебестоимостьОприходование + Стр.СебестоимостьОприходование;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область Оповещения

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ScanData" и ВводДоступен() Тогда 
		Штрихкод = ОперацииСПодключаемымОборудованиемКлиент.ПолучитьШтрихкод(ИмяСобытия, Параметр, Источник);
		СтруктураТОвара = ОбщегоНазначенияВызовСервера.ПолучитьНоменклатуруПоШтрихкоду(Штрихкод);
		Если СтруктураТОвара = Неопределено Тогда
			Оп = Новый ОписаниеОповещения("ПослеДобавленияНоменклатуры",ЭтаФорма,Новый Структура("Штрихкод",Штрихкод));
			ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента",Новый Структура("Штрихкод",Штрихкод),ЭтаФорма,,,,Оп,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Иначе
			РаботаСДокументамиКлиентСервер.ДобавитьНоменклатуруПоШтрихкоду(Штрихкод, Объект, СтруктураТОвара,,,ЭтаФорма);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураПриИзменении(Элемент)
	// Insérer le contenu du traitement.
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураОприходованиеПриИзменении(Элемент)
	// Insérer le contenu du traitement.
КонецПроцедуры

#КонецОбласти
