
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Таб = Новый ТабличныйДокумент;
	Сформировать(ПараметрКоманды, Таб);	
	Таб.PageOrientation = PageOrientation.Portrait;
	Таб.FitToPage = True;
	Таб.ShowGrid = False;
	Таб.ShowHeaders = False;
	Таб.Protection = False;
	Таб.ПолеСверху = 5;
	Таб.ПолеСлева = 0;
	Таб.ПолеСнизу = 10;
	Таб.ПолеСправа = 0;
	Таб.ИмяПринтера = ОбщегоНазначенияВызовСервера.ПолучитьИмяПринтераЧековНаСервере();
	Таб.Напечатать(РежимИспользованияДиалогаПечати.НеИспользовать);
КонецПроцедуры

&НаСервере
Процедура Сформировать(ПараметрКоманды, Таб)
	Для Каждого Док Из ПараметрКоманды Цикл		
		Документы.ВозвратОтПокупателя.PrintTicket(Док, Таб);
	КонецЦикла;	
КонецПроцедуры
