#Область ПрограммныйИнтерфейс

// Перечисляет печатные формы объекта.
// См. ПечатныеФормы.НоваяКоллекцияКомандПечати
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - пополняемая коллекция команд печати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	Команда = КомандыПечати.Добавить();
	Команда.ИмяМакета = "EtatZ";
	Команда.Представление = НСтр("ru = 'Z-отчёт (Etat Z)'; fr = 'Etat Z';
		|en = 'State Z'; es = 'Estado Z'");

КонецПроцедуры

// Формирует запрошенные печатные формы.
// См. ПечатныеФормы.СформироватьПечатныеФормы
//
// Параметры:
//  МассивОбъектов        - Массив          - печатаемые объекты
//  ПараметрыПечати       - Структура       - параметры команды печати
//  КоллекцияПечатныхФорм - ТаблицаЗначений - заполняемая коллекция печатных форм
//  ОбъектыПечати         - СписокЗначений  - соответствие объектов областям печати
//  ПараметрыВывода       - Структура       - параметры окна печати
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	Если ПечатныеФормы.НужноПечататьМакет(КоллекцияПечатныхФорм, "EtatZ") Тогда
		Таб = Новый ТабличныйДокумент;
		Для Каждого Док Из МассивОбъектов Цикл
			НомерСтрокиНачало = Таб.ВысотаТаблицы + 1;
			ПечатьEtatZ(Док, Таб);
			ПечатныеФормы.ЗадатьОбластьПечати(Таб, НомерСтрокиНачало, ОбъектыПечати, Док);
		КонецЦикла;
		ПечатныеФормы.ВывестиТабличныйДокумент(КоллекцияПечатныхФорм, "EtatZ",
			НСтр("ru = 'Z-отчёт (Etat Z)'; fr = 'Etat Z';
			|en = 'State Z'; es = 'Estado Z'"),
			Таб, "Документ.КассоваяСмена.EtatZ");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

Function ПечатьEtatZOld(Док, Spreadsheet) Export
	Template = ПечатныеФормы.МакетПечатнойФормы("Документ.КассоваяСмена.EtatZ");
	Query = New Query;
	Query.Text =
	"ВЫБРАТЬ
	|	ДвиженияПоКассеОбороты.Период КАК Date,
	|	ДвиженияПоКассеОбороты.Регистратор КАК Регистратор,
	|	ДвиженияПоКассеОбороты.ДокументПродажи КАК ДокументПродажи,
	|	ДвиженияПоКассеОбороты.КассоваяСмена КАК КассоваяСмена,
	|	ДвиженияПоКассеОбороты.МестоХранения КАК МестоХранения,
	|	ДвиженияПоКассеОбороты.Организация КАК Organisation,
	|	ДвиженияПоКассеОбороты.ТипДвижения КАК ТипДвижения,
	|	ДвиженияПоКассеОбороты.ТипДенежныхСредств КАК ТипДенежныхСредств,
	|	ДвиженияПоКассеОбороты.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ДвиженияПоКассеОбороты.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ВЫБОР
	|		КОГДА ДвиженияПоКассеОбороты.ТипДвижения = ЗНАЧЕНИЕ(Перечисление.ТипыДвиженияДенежныхСредств.Поступление)
	|			ТОГДА 1
	|		ИНАЧЕ -1
	|	КОНЕЦ * ДвиженияПоКассеОбороты.СуммаОборот КАК Сумма
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	РегистрНакопления.ДвиженияПоКассе.Обороты(
	|			,
	|			,
	|			Регистратор,
	|			КассоваяСмена = &КассоваяСмена
	|				И ТипДенежныхСредств = ЗНАЧЕНИЕ(Справочник.TypesDePayment.Cash)) КАК ДвиженияПоКассеОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ПродажиОбороты.ВыручкаОборот) КАК Сумма
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты КАК ПродажиОбороты
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ПродажиОбороты.ДокументПродажи.КассоваяСмена = ЗНАЧЕНИЕ(Документ.КассоваяСмена.ПустаяСсылка)
	|				ТОГДА НАЧАЛОПЕРИОДА(ПродажиОбороты.ДокументПродажи.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаКассовойСмены, ДЕНЬ)
	|						И ПродажиОбороты.ДокументПродажи.МестоХранения = &МестоХранения
	|			ИНАЧЕ ПродажиОбороты.ДокументПродажи.КассоваяСмена = &КассоваяСмена
	|		КОНЕЦ
	|	И ПродажиОбороты.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ПродажиОбороты.ВыручкаОборот) КАК Сумма
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты КАК ПродажиОбороты
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ПродажиОбороты.ДокументПродажи.КассоваяСмена = ЗНАЧЕНИЕ(Документ.КассоваяСмена.ПустаяСсылка)
	|				ТОГДА НАЧАЛОПЕРИОДА(ПродажиОбороты.ДокументПродажи.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаКассовойСмены, ДЕНЬ)
	|						И ПродажиОбороты.ДокументПродажи.МестоХранения = &МестоХранения
	|			ИНАЧЕ ПродажиОбороты.ДокументПродажи.КассоваяСмена = &КассоваяСмена
	|		КОНЕЦ
	|	И ПродажиОбороты.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ.Сумма) КАК Сумма
	|ИЗ
	|	ВТ КАК ВТ
	|ГДЕ
	|	ВТ.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	СУММА(ВТ.Сумма) КАК Сумма
	|ИЗ
	|	ВТ КАК ВТ
	|ГДЕ
	|	ВТ.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПродажаВКредит)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.ХозяйственнаяОперация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	СУММА(ВТ.Сумма) КАК Сумма
	|ИЗ
	|	ВТ КАК ВТ
	|ГДЕ
	|	НЕ ВТ.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПродажаВКредит))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.ХозяйственнаяОперация";
	Query.Parameters.Insert("КассоваяСмена", Док);
	Query.Parameters.Insert("МестоХранения", Док.МестоХранения);
	Query.Parameters.Insert("ДатаКассовойСмены", Док.Дата);
	ТЗ = Query.ВыполнитьПакет();
	
	Header = Template.GetArea("Шапка");
	AreaTabularSection = Template.GetArea("Строка");
	AreaTabularSectionFooterTotal = Template.GetArea("Подвал"); 
	
	Header.Parameters.Fill(Док);
	
	FieldPhoto = Док.Организация.Логотип.Get();
	Try
		Header.Drawings[0].Picture = New Picture(FieldPhoto);
	Except
	EndTry;
	
	Spreadsheet.Put(Header);
	
	TotalSomme = 0;
	TotalSommeCA = 0;
	
	//Ventes produits
	ТЗРаздел = ТЗ.Получить(1).Выгрузить();
	AreaTabularSection.Параметры.Operation = "Ventes Produits";
	СуммаТовары = ?(ТЗРаздел.Количество() = 0, 0, ?(ЗначениеЗаполнено(ТЗРаздел.Получить(0).Сумма),ТЗРаздел.Получить(0).Сумма,0));
	AreaTabularSection.Параметры.Somme = СуммаТовары;
	Spreadsheet.Put(AreaTabularSection);
	TotalSommeCA = TotalSommeCA + СуммаТовары;
	
	//Ventes service
	ТЗРаздел = ТЗ.Получить(2).Выгрузить();
	AreaTabularSection.Параметры.Operation = "Ventes Services";
	СуммаУслуг = ?(ТЗРаздел.Количество() = 0, 0, ?(ЗначениеЗаполнено(ТЗРаздел.Получить(0).Сумма),ТЗРаздел.Получить(0).Сумма,0));
	AreaTabularSection.Параметры.Somme = СуммаУслуг;
	Spreadsheet.Put(AreaTabularSection);
	TotalSommeCA = TotalSommeCA + СуммаУслуг;
	
	//Ventes et Avoirs Encaissées
	ТЗРаздел = ТЗ.Получить(3).Выгрузить();
	AreaTabularSection.Параметры.Operation = "Ventes et Avoirs Encaissées";
	СуммаТовары = ?(ТЗРаздел.Количество() = 0, 0, ?(ЗначениеЗаполнено(ТЗРаздел.Получить(0).Сумма),ТЗРаздел.Получить(0).Сумма,0));
	AreaTabularSection.Параметры.Somme = СуммаТовары;
	Spreadsheet.Put(AreaTabularSection);
	TotalSomme = TotalSomme + СуммаТовары;

	//Credits Encaissées
	ТЗРаздел = ТЗ.Получить(4).Выгрузить();
	AreaTabularSection.Параметры.Operation = "Credits Encaissées";
	СуммаТовары = ?(ТЗРаздел.Количество() = 0, 0, ?(ЗначениеЗаполнено(ТЗРаздел.Получить(0).Сумма),ТЗРаздел.Получить(0).Сумма,0));
	AreaTabularSection.Параметры.Somme = СуммаТовары;
	Spreadsheet.Put(AreaTabularSection);
	TotalSomme = TotalSomme + СуммаТовары;
	
	ТЗРаздел = ТЗ.Получить(5).Выгрузить();
	Для Каждого Стр из ТЗРаздел Цикл 
		AreaTabularSection.Параметры.Operation = Стр.ХозяйственнаяОперация;
		AreaTabularSection.Параметры.Somme = Стр.Сумма;
		TotalSomme = TotalSomme + Стр.Сумма;
		Spreadsheet.Put(AreaTabularSection);
	КонецЦикла;
	
	Solde = ?(Док.Статус = Перечисления.СтатусыКассовойСмены.Закрыта, Док.СуммаЗакрытия, РаботаСДокументами.ПолучитьОстатокВКассе(Док.Касса));
	AreaTabularSectionFooterTotal.Parameters.Total = ""+Format(TotalSomme,"ЧДЦ=2; ЧРГ=' '; ЧН=0,00");
	AreaTabularSectionFooterTotal.Parameters.TotalCA = ""+Format(TotalSommeCA,"ЧДЦ=2; ЧРГ=' '; ЧН=0,00");
	AreaTabularSectionFooterTotal.Parameters.Solde = ""+Format(Solde,"ЧДЦ=2; ЧРГ=' '; ЧН=0,00");
	//AreaTabularSectionFooterTotal.Parameters.TotalSommePaiement =  ""+Format(TotalSommePaiement,"ЧДЦ=2; ЧРГ=' '; ЧН=0,00");
	//AreaTabularSectionFooterTotal.Parameters.ОстатокОплаты =  ""+Format(Selection.TotalSomme - TotalSommePaiement,"ЧДЦ=2; ЧРГ=' '; ЧН=0,00");
	AreaTabularSectionFooterTotal.Parameters.Дата = ТекущаяДатаСеанса();
	
	Spreadsheet.Put(AreaTabularSectionFooterTotal);
	Spreadsheet.PutHorizontalPageBreak();
	
	Return Spreadsheet;
	
	//}}
EndFunction

Function ПечатьEtatZ(Док, Spreadsheet) Export
	Template = ПечатныеФормы.МакетПечатнойФормы("Документ.КассоваяСмена.EtatZ");
	Query = New Query;
	Query.Text =
	"ВЫБРАТЬ
	|	ДвиженияПоКассеОбороты.ТипДенежныхСредств КАК ТипДенежныхСредств,
	|	СУММА(ВЫБОР
	|			КОГДА ДвиженияПоКассеОбороты.ТипДвижения = ЗНАЧЕНИЕ(Перечисление.ТипыДвиженияДенежныхСредств.Поступление)
	|				ТОГДА 1
	|			ИНАЧЕ -1
	|		КОНЕЦ * ДвиженияПоКассеОбороты.СуммаОборот) КАК Сумма
	|ИЗ
	|	РегистрНакопления.ДвиженияПоКассе.Обороты(, , Регистратор, КассоваяСмена = &КассоваяСмена) КАК ДвиженияПоКассеОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ДвиженияПоКассеОбороты.ТипДенежныхСредств
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТипДенежныхСредств
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДвиженияПоКассеОбороты.КассоваяСмена КАК КассоваяСмена,
	|	ДвиженияПоКассеОбороты.ТипДвижения КАК ТипДвижения,
	|	ДвиженияПоКассеОбороты.ТипДенежныхСредств КАК ТипДенежныхСредств,
	|	ДвиженияПоКассеОбороты.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	СУММА(ВЫБОР
	|			КОГДА ДвиженияПоКассеОбороты.ТипДвижения = ЗНАЧЕНИЕ(Перечисление.ТипыДвиженияДенежныхСредств.Поступление)
	|				ТОГДА 1
	|			ИНАЧЕ -1
	|		КОНЕЦ * ДвиженияПоКассеОбороты.СуммаОборот) КАК Сумма,
	|	ДвиженияПоКассеОбороты.Регистратор.СтатьяДДС КАК РегистраторСтатьяДДС
	|ИЗ
	|	РегистрНакопления.ДвиженияПоКассе.Обороты(, , Регистратор, КассоваяСмена = &КассоваяСмена) КАК ДвиженияПоКассеОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ДвиженияПоКассеОбороты.ТипДвижения,
	|	ДвиженияПоКассеОбороты.КассоваяСмена,
	|	ДвиженияПоКассеОбороты.ХозяйственнаяОперация,
	|	ДвиженияПоКассеОбороты.ТипДенежныхСредств,
	|	ДвиженияПоКассеОбороты.Регистратор.СтатьяДДС
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТипДвижения,
	|	ТипДенежныхСредств,
	|	РегистраторСтатьяДДС
	|ИТОГИ
	|	СУММА(Сумма)
	|ПО
	|	ТипДвижения,
	|	ТипДенежныхСредств,
	|	РегистраторСтатьяДДС";
	Query.Parameters.Insert("КассоваяСмена", Док);
	Query.Parameters.Insert("МестоХранения", Док.МестоХранения);
	Query.Parameters.Insert("ДатаКассовойСмены", Док.Дата);
	
	Header = Template.GetArea("Шапка");
	AreaTabularSection = Template.GetArea("Строка");
	AreaTabularSection1 = Template.GetArea("Строка1");
	AreaTabularSection2 = Template.GetArea("Строка2");
	AreaTabularSectionFooter = Template.GetArea("СтрокаПодвал");
	AreaTabularSectionFooterTotal = Template.GetArea("Подвал"); 
	
	Header.Parameters.Fill(Док);
	
	FieldPhoto = Док.Организация.Логотип.Get();
	Try
		Header.Drawings[0].Picture = New Picture(FieldPhoto);
	Except
	EndTry;
	
	Spreadsheet.Put(Header);
	Total = 0;
	Пакет = Query.ВыполнитьПакет();
	ТипДвижения = Пакет.Получить(1).Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	While ТипДвижения.Следующий() do 
		AreaTabularSection.Параметры.Operation = ТипДвижения.ТипДвижения;
		AreaTabularSection.Параметры.Somme = ТипДвижения.Сумма;
		Total = Total + ТипДвижения.Сумма;
		Spreadsheet.Put(AreaTabularSection);
		ТипДенежныхСредств = ТипДвижения.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ТипДенежныхСредств.Следующий() Цикл 
			AreaTabularSection1.Параметры.Operation = ТипДенежныхСредств.ТипДенежныхСредств;
			AreaTabularSection1.Параметры.Somme = ТипДенежныхСредств.Сумма;
			//TotalSomme = Total + ТипДенежныхСредств.Сумма;
			AreaTabularSection1.Области.Получить(0).ОтступСлева = 1;
			Spreadsheet.Put(AreaTabularSection1);
			РегистраторСтатьяДДС = ТипДенежныхСредств.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока РегистраторСтатьяДДС.Следующий() Цикл 
				AreaTabularSection2.Параметры.Operation = РегистраторСтатьяДДС.РегистраторСтатьяДДС;
				AreaTabularSection2.Параметры.Somme = РегистраторСтатьяДДС.Сумма;
				AreaTabularSection2.Области.Получить(0).ОтступСлева = 2;
				//TotalSomme = Total + РегистраторСтатьяДДС.Сумма;
				Spreadsheet.Put(AreaTabularSection2);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ТЗИтоги = Пакет.Получить(0).Выгрузить();
	ТЗИтоги.Свернуть("ТипДенежныхСредств","Сумма");
	Для Каждого СтрИтоги из ТЗИтоги Цикл
		AreaTabularSectionFooter.Parameters.Operation = СтрИтоги.ТипДенежныхСредств;
		AreaTabularSectionFooter.Parameters.Somme = ""+Format(СтрИтоги.Сумма,"ЧДЦ=2; ЧРГ=' '; ЧН=0,00");
		Spreadsheet.Put(AreaTabularSectionFooter);
	КонецЦикла;
	
	//AreaTabularSectionFooterTotal.Parameters.Total = ""+Format(Total,"ЧДЦ=2; ЧРГ=' '; ЧН=0,00");
	AreaTabularSectionFooterTotal.Parameters.Дата = ТекущаяДатаСеанса();
	
	Spreadsheet.Put(AreaTabularSectionFooterTotal);
	Spreadsheet.PutHorizontalPageBreak();
	
	Return Spreadsheet;
	
	//}}
EndFunction
