
Функция ПолучитьОрганизации(Приложение) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПараметрыОбменаДанными.Организация КАК Организация
	                      |ИЗ
	                      |	РегистрСведений.ПараметрыОбменаДанными КАК ПараметрыОбменаДанными
	                      |ГДЕ
	                      |	ПараметрыОбменаДанными.Приложение = &Приложение");
	Запрос.УстановитьПараметр("Приложение", Приложение);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Организация");
КонецФункции	

Функция ПолучитьДанныеПодключения(Организация, Приложение) Экспорт
	Структура = РегистрыСведений.ПараметрыОбменаДанными.Получить(Новый Структура("Организация, Приложение", Организация, Приложение));
	Структура.Вставить("Установлены", ЗначениеЗаполнено(Структура.Сервер));
	Возврат Структура;
КонецФункции	