
Процедура СформироватьДвижения(ДокОбъект) Экспорт
	Движения = ДокОбъект.Движения;  
	ХО = Перечисления.ХозяйственныеОперации;
	Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.РеализацияТоваровУслуг") 
		И ДокОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.НакладнаяПоОтгрузкамТовара Тогда
		Для Каждого Стр Из ДокОбъект.ТЧТовары Цикл
			СформироватьДвижение(Движения, ДокОбъект.Дата, ДокОбъект.Организация, ДокОбъект.Контрагент, Стр.Номенклатура, Стр.ОтгрузкаТовара, Стр.Количество, Стр.СуммаСНДС, Ложь);	
		КонецЦикла;
		Для Каждого Стр Из ДокОбъект.ТЧУслуги Цикл
			СформироватьДвижение(Движения, ДокОбъект.Дата, ДокОбъект.Организация, ДокОбъект.Контрагент, Стр.Номенклатура, Стр.ОтгрузкаТовара, Стр.Количество, Стр.СуммаСНДС, Ложь);	
		КонецЦикла;
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ОтгрузкаТовара") Тогда	
		Для Каждого Стр Из ДокОбъект.ТЧТовары Цикл
			СформироватьДвижение(Движения, ДокОбъект.Дата, ДокОбъект.Организация, ДокОбъект.Контрагент, Стр.Номенклатура, ДокОбъект.Ссылка, Стр.Количество, Стр.СуммаСНДС, Истина);	
		КонецЦикла;
		Для Каждого Стр Из ДокОбъект.ТЧУслуги Цикл
			СформироватьДвижение(Движения, ДокОбъект.Дата, ДокОбъект.Организация, ДокОбъект.Контрагент, Стр.Номенклатура, ДокОбъект.Ссылка, Стр.Количество, Стр.СуммаСНДС, Истина);	
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

Процедура СформироватьДвижение(Движения, Период, Организация, Контрагент, Номенклатура, ДокументОтгрузки, Количество, Сумма, Приход = Истина)
	Если Сумма = 0 Тогда Возврат КонецЕсли;
	Если Приход Тогда 
		НС = Движения.ОтгрузкиТоваров.ДобавитьПриход();
	Иначе
		НС = Движения.ОтгрузкиТоваров.ДобавитьРасход();
	КонецЕсли;
	НС.Период = Период;
	НС.Организация = Организация;
	НС.Контрагент = Контрагент;
	НС.Номенклатура = Номенклатура;
	НС.ДокументОтгрузки = ДокументОтгрузки;
	НС.Количество = Количество;
	НС.Сумма = Сумма;	
КонецПроцедуры
