
#Область Обработчики_событий_формы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТЗМаски.Загрузить(РегистрыСведений.РеквизитыКонтрагентов.ПолучитьМаскиТелефонныхНомеров());
	Если ЗначениеЗаполнено(Параметры.Значение) Тогда
		Данные = ОбщегоНазначенияКлиентСервер.КонвертироватьИзJSON(Параметры.Значение);
		НомерТелефона = Данные.НомерТелефона;
		ДобавочныйНомер = Данные.ДобавочныйНомер;
		Страна = Данные.Страна;
		Маска = Данные.Маска; 
		Элементы.НомерТелефона.Маска = Маска;
	КонецЕсли;
	Элементы.Страна.СписокВыбора.ЗагрузитьЗначения(ТЗМаски.Выгрузить().ВыгрузитьКолонку("Страна"));
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не ЗначениеЗаполнено(Маска) И Не ЗначениеЗаполнено(НомерТелефона) Тогда
		Мас = ТЗМаски.НайтиСтроки(Новый Структура("Страна", НСтр("fr = 'Maroc'; ru = 'Марокко'; en = 'Morocco'; es = 'Marruecos'")));
		УстановитьПараметрыНомера(Мас[0]);			
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура Подтвердить(Команда)
	Результат = Новый Структура;
	Результат.Вставить("НомерТелефона", НомерТелефона);
	Результат.Вставить("ДобавочныйНомер", ДобавочныйНомер);
	Результат.Вставить("Маска", Маска);
	Результат.Вставить("Страна", Страна);
	НомерТелефонаНабор = СтрЗаменить(НомерТелефона, "-", "");
	НомерТелефонаНабор = СтрЗаменить(НомерТелефонаНабор, "(", "");
	НомерТелефонаНабор = СтрЗаменить(НомерТелефонаНабор, ")", "");
	НомерТелефонаНабор = СтрЗаменить(НомерТелефонаНабор, " ", "");
	Результат.Вставить("НомерТелефонаНабор", НомерТелефонаНабор);	
	Результат.Вставить("Представление", СокрЛП(НомерТелефона) + ?(ЗначениеЗаполнено(ДобавочныйНомер), ", доб.(" + СокрЛП(ДобавочныйНомер) + ")", ""));
	КонтактнаяИнформация = ОбщегоНазначенияКлиентСервер.КонвертироватьВJSON(Результат);
	ОповеститьОВыборе(Новый Структура("КонтактнаяИнформация, Представление", КонтактнаяИнформация, Результат.Представление));
КонецПроцедуры

&НаКлиенте
Процедура НомерТелефонаИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	Если Элемент.Маска <> ПустаяМаска() Тогда Возврат КонецЕсли;
	Мас = ТЗМаски.НайтиСтроки(Новый Структура("Код", СокрЛП(Текст)));
	Если Мас.Количество() = 1 Тогда
		НомерТелефонаОбработкаВыбора(Элемент, Мас[0], Ложь); 
	ИначеЕсли Мас.Количество() > 1 Тогда
		Элемент.СписокВыбора.Очистить();
		Для Каждого Стр Из Мас Цикл
			НС = Элемент.СписокВыбора.Добавить();
			НС.Значение = Новый Структура("Маска, Страна", Стр.Маска, Стр.Страна);
			НС.Представление = Стр.Маска + " (" + Стр.Страна + ")";
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура НомерТелефонаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	УстановитьПараметрыНомера(ВыбранноеЗначение);
	Элемент.СписокВыбора.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура НомерТелефонаОчистка(Элемент, СтандартнаяОбработка)
	Маска = ПустаяМаска();
	Элемент.Маска = Маска;
	Страна = "";
КонецПроцедуры

&НаКлиенте
Процедура СтранаПриИзменении(Элемент)
	Мас = ?(ЗначениеЗаполнено(Страна), ТЗМаски.НайтиСтроки(Новый Структура("Страна", Страна)), Новый Массив);
	Если Мас.Количество() > 0 Тогда
		УстановитьПараметрыНомера(Мас[0]);
	Иначе
		Маска = ПустаяМаска();
		Страна = "";
		Элементы.НомерТелефона.Маска = Маска;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область Дополнительно

&НаКлиенте
Функция ПустаяМаска()
	Возврат "###############";
КонецФункции

&НаКлиенте
Процедура УстановитьПараметрыНомера(Данные)
	Маска = Данные.Маска; 
	Страна = Данные.Страна;
	Элементы.НомерТелефона.Маска = Маска;
КонецПроцедуры	

#КонецОбласти



