
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	УстановитьПривилегированныйРежим(Истина);
	РаботаСДокументами.УстановитьЗаписьВсехРегистров(Движения);
	Для Каждого Стр Из ТЧЦены Цикл
		НС = Движения.ЦеныНоменклатуры.Добавить();
		НС.Период = ЭтотОбъект.Дата;
		НС.Номенклатура = ЭтотОбъект.Номенклатура;
		НС.Цена = Стр.Цена;
		НС.ВидЦены = Стр.ВидЦены;
	КонецЦикла;
	Движения.Записать();
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Дата = ТекущаяДатаСеанса();
	РаботаСДокументами.ЗаполнитьРеквизитыПоУмолчанию(ЭтотОбъект);
КонецПроцедуры
