
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	РаботаСДокументами.МожноРедактироватьДокументВФорме(Объект.Ссылка, ЭтаФорма);
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыФункциональныхОпций(ЭтаФорма);  
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, Объект);
	Если Объект.Ссылка.Пустая() Тогда
		// Реквизита ТипЦеныПоТипуЦен у документа нет (копипаст из поступления товаров) - тип цен
		// в доп. расходах не используется.
		Объект.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
		Объект.КурсВалюты = 1;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить(РаботаСДокументами.СвойствоЗаписьИзФормы(), Истина);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, ТекущийОбъект);
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы  

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыФункциональныхОпций(ЭтаФорма);
	КонтрагентПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	ДанныеКонтрагента = ОбщегоНазначенияВызовСервера.ПолучитьДанныеКонтрагента(Объект.Контрагент, Объект.Организация, Ложь, Объект.Дата);
	Объект.Договор = ДанныеКонтрагента.Договор;
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	Объект.СуммаНДС = РаботаСДокументамиКлиентСервер.РассчитатьСуммуНДС(Объект.СтавкаНДС, Объект.Сумма, Истина);
КонецПроцедуры

&НаКлиенте
Процедура СтавкаНДСПриИзменении(Элемент)
	Объект.СуммаНДС = РаботаСДокументамиКлиентСервер.РассчитатьСуммуНДС(Объект.СтавкаНДС, Объект.Сумма, Объект.ЦенаВключаетНДС);
	Для Каждого Стр Из Объект.ТЧТовары Цикл
		Стр.СуммаНДС = РаботаСДокументамиКлиентСервер.РассчитатьСуммуНДС(Объект.СтавкаНДС, Стр.Сумма, Объект.ЦенаВключаетНДС);		
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект);
КонецПроцедуры 

&НаКлиенте
Процедура ТЧТоварыХарактеристикаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСуммаПриИзменении(Элемент)
	ТекСтр = Элементы.ТЧТовары.ТекущиеДанные;
	ТекСтр.СуммаНДС = РаботаСДокументамиКлиентСервер.РассчитатьСуммуНДС(Объект.СтавкаНДС, ТекСтр.Сумма, Объект.ЦенаВключаетНДС);
КонецПроцедуры

#КонецОбласти

	


	