
Функция ПолучитьУдостоверенияЛичности(Владелец, ДатаСреза) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПериодыДействияДокументовФизическихЛицСрезПоследних.Документ КАК Документ
	                      |ИЗ
	                      |	РегистрСведений.ПериодыДействияДокументовФизическихЛиц.СрезПоследних(&ДатаСреза, Владелец = &Владелец) КАК ПериодыДействияДокументовФизическихЛицСрезПоследних
	                      |ГДЕ
	                      |	ПериодыДействияДокументовФизическихЛицСрезПоследних.ЯвляетсяДокументомУдостоверяющимЛичность");
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Документ");
КонецФункции	

Функция ПолучитьПоВиду(Владелец, ВидДокумента, ДатаСреза) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Результат = Новый Структура("Серия, Номер, Представление");
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПериодыДействияДокументов.Документ.Серия КАК Серия,
	                      |	ПериодыДействияДокументов.Документ.Номер КАК Номер,
	                      |	ПериодыДействияДокументов.Документ.НаименованиеПолное КАК Представление
	                      |ИЗ
	                      |	РегистрСведений.ПериодыДействияДокументовФизическихЛиц.СрезПоследних(
	                      |			&ДатаСреза,
	                      |			Владелец = &Владелец
	                      |				И ВидДокумента = &ВидДокумента) КАК ПериодыДействияДокументов");
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("ВидДокумента", ВидДокумента);
	Выб = Запрос.Выполнить().Выбрать();	
	Пока Выб.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Результат, Выб);	
	КонецЦикла;	
	Возврат Результат;
КонецФункции

Процедура ЗаписатьДанныеДокумента(СпрОбъект) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПериодыДействияДокументовФизическихЛиц.Период КАК Период,
	                      |	ПериодыДействияДокументовФизическихЛиц.Владелец КАК Владелец,
	                      |	ПериодыДействияДокументовФизическихЛиц.ВидДокумента КАК ВидДокумента
	                      |ИЗ
	                      |	РегистрСведений.ПериодыДействияДокументовФизическихЛиц КАК ПериодыДействияДокументовФизическихЛиц
	                      |ГДЕ
	                      |	ПериодыДействияДокументовФизическихЛиц.Документ = &Документ");
	Запрос.УстановитьПараметр("Документ", СпрОбъект.Ссылка);
	Рез = Запрос.Выполнить();
	Если Не Рез.Пустой() Тогда
		МЗ = РегистрыСведений.ПериодыДействияДокументовФизическихЛиц.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ, Рез.Выгрузить()[0]);
		МЗ.Удалить();
	КонецЕсли;
	Если Не СпрОбъект.ПометкаУдаления Тогда
		МЗ = РегистрыСведений.ПериодыДействияДокументовФизическихЛиц.СоздатьМенеджерЗаписи();
		МЗ.Период = СпрОбъект.ДатаВыдачи;
		МЗ.Владелец = СпрОбъект.Владелец;
		МЗ.ВидДокумента = СпрОбъект.ВидДокумента;
		МЗ.Документ = СпрОбъект.Ссылка;
		МЗ.СрокДействия = СпрОбъект.СрокДействия;
		МЗ.ЯвляетсяДокументомУдостоверяющимЛичность = СпрОбъект.ЯвляетсяДокументомУдостоверяющимЛичность;
		МЗ.Записать(Ложь);
	КонецЕсли;
КонецПроцедуры	
