
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьВидимость();
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы 

&НаКлиенте
Процедура ВидЗапретаПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

#КонецОбласти

#Область Дополнительно

&НаСервере
Процедура УстановитьВидимость() 
	Элементы.ЗначениеЗапрета.СписокВыбора.Очистить(); 
	Элементы.ЗначениеЗапрета.Видимость = Истина;
	Элементы.ЗначениеЗапрета.РежимВыбораИзСписка = Ложь;
	Если Запись.ВидЗапрета = ПланыВидовХарактеристик.ВидыЗапретаРедактирования.Общая Тогда
		Запись.ЗначениеЗапрета = "";
		Элементы.ЗначениеЗапрета.Видимость = Ложь;
	ИначеЕсли Запись.ВидЗапрета = ПланыВидовХарактеристик.ВидыЗапретаРедактирования.ПоРоли Тогда	
		Элементы.ЗначениеЗапрета.РежимВыбораИзСписка = Истина;
		Для Каждого Роль Из Метаданные.Роли Цикл
			Элементы.ЗначениеЗапрета.СписокВыбора.Добавить(Роль.Синоним);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
