
Функция ПолучитьПроцентПремииПоВыполненномуПлану(ТЗКоэффициентыПремии, ВыполненныйПлан) Экспорт
	Если ТЗКоэффициентыПремии.Количество() = 0 Тогда
		ПроцентПремии = 100;	
	Иначе	
		ТЗКоэффициентыПремии.Сортировать("ВыполнениеПлана Убыв");
		ПроцентПремии = 0;
		Для Каждого Стр Из ТЗКоэффициентыПремии Цикл
			Если ВыполненныйПлан < Стр.ВыполнениеПлана Тогда Продолжить КонецЕсли;
			ПроцентПремии = Стр.ПроцентПремии;
			Прервать;		
		КонецЦикла;
	КонецЕсли;
	Возврат ПроцентПремии;
КонецФункции

Функция ПолучитьПоказателиПоСОтруднику(Сотрудник, НаДату = Неопределено) Экспорт
	ДатаРасчета = ?(НаДату = Неопределено, ТекущаяДатаСеанса(), НаДату);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПремииСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	|	ПремииСотрудниковСрезПоследних.ВидПремии КАК Показатель,
	|	ЛОЖЬ КАК SMART,
	|	0 КАК План,
	|	0 КАК Факт,
	|	ПремииСотрудниковСрезПоследних.Премия КАК Стоимость,
	|	ПремииСотрудниковСрезПоследних.Премия КАК Премия
	|ИЗ
	|	РегистрСведений.ПремииСотрудников.СрезПоследних(&ДатаРасчета, Сотрудник = &Сотрудник) КАК ПремииСотрудниковСрезПоследних";
	Запрос.УстановитьПараметр("Сотрудник",Сотрудник);
	Запрос.УстановитьПараметр("ДатаРасчета",ДатаРасчета);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
