
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ТипЗначения = Новый ОписаниеТипов("Булево"); // Всем новым устанавливаем тип булево
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ТипЗначения = Новый ОписаниеТипов("Булево"); // Всем скопированным устанавливаем тип булево
	План = Ложь;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если Не ЭтоГруппа Тогда 
		Если АнализПродажАнализировать Тогда 
			//ПроверяемыеРеквизиты.Добавить("АнализПродажВариант");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
