
Процедура СформироватьДвижения(ДокОбъект) Экспорт
	Движения = ДокОбъект.Движения;
	Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПриходныйКассовыйОрдер") Тогда
		Если Не ДокОбъект.ТипОплаты = Справочники.TypesDePayment.Cheque Тогда Возврат; КонецЕсли;
		Период = ДокОбъект.Дата;
		ТипДвижения = Перечисления.ТипыДвиженияДенежныхСредств.Поступление;
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.РасходныйКассовыйОрдер") Тогда	
		Если Не ДокОбъект.ТипОплаты = Справочники.TypesDePayment.Cheque Тогда Возврат; КонецЕсли;
		Период = ДокОбъект.Дата;
		ТипДвижения = Перечисления.ТипыДвиженияДенежныхСредств.Списание;
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПоступлениеБезналичныхДенежныхСредств") Тогда	
		Если Не ДокОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОбналичиваниеЧека Тогда Возврат; КонецЕсли;
		Период = ДокОбъект.Дата;
		ТипДвижения = Перечисления.ТипыДвиженияДенежныхСредств.Списание;
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.СписаниеБезналичныхДенежныхСредств") Тогда	
		Если Не ДокОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОбналичиваниеЧека Тогда Возврат; КонецЕсли;
		Период = ДокОбъект.Дата;
		ТипДвижения = Перечисления.ТипыДвиженияДенежныхСредств.Поступление;
	Иначе
		Возврат;
	КонецЕсли;
	// Движения Оплаты Чеками
	НС = Движения.ОплатыЧеками.Добавить();
	НС.ВидДвижения = ?(ТипДвижения = Перечисления.ТипыДвиженияДенежныхСредств.Списание, ВидДвиженияНакопления.Расход, ВидДвиженияНакопления.Приход);
	НС.Период = Период;
	НС.Чек = ДокОбъект.Чек;
	НС.Сумма = ДокОбъект.Сумма;
КонецПроцедуры
