
#Область Печать

Процедура ПечатьАктСписанияТоваров(Док, Таб) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Таб.ОтображатьСетку = Ложь;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	Таб.АвтоМасштаб = Истина;
	Таб.КлючПараметровПечати = "Параметры_печати_Документ_СписаниеТоваров_АктСписанияТоваров";
	Макет = Документы.СписаниеТоваров.ПолучитьМакет("АктСписанияТоваров");	
	оЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	оЗаголовок.Параметры.ТекстЗаголовка = РаботаСДокументами.КраткоеПредставлениеДокумента(Док, НСтр("fr = 'Sortie de marchandises'; ru = 'Списание товаров'; en = 'Write-off of goods'; es = 'Paso a pérdidas y ganancias'"));	
	Таб.Вывести(оЗаголовок);
	оРеквизитыОрганизации = Макет.ПолучитьОбласть("РеквизитыОрганизации");	
	оРеквизитыОрганизации.Параметры.ПредставлениеОрганизации = Док.Организация;
	оРеквизитыОрганизации.Параметры.ПредставлениеСклада = Док.МестоХранения;
	Таб.Вывести(оРеквизитыОрганизации);
	Таб.Вывести(Макет.ПолучитьОбласть("ШапкаТаблицы"));
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ВЗ.НомерСтроки КАК НомерСтроки,
		                      |	ВЗ.Артикул КАК Артикул,
		                      |	ВЗ.Номенклатура КАК Номенклатура,
		                      |	ВЗ.Характеристика КАК Характеристика,
		                      |	ВЗ.КоличествоМест КАК КоличествоМест,
		                      |	ВЗ.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		                      |	ВЗ.Количество КАК Количество,
		                      |	ВЗ.ЕдиницаХранения КАК ЕдиницаХранения,
		                      |	ВЗ.Сумма КАК Сумма,
		                      |	ВЫРАЗИТЬ(ВЗ.Сумма / ВЗ.Количество КАК ЧИСЛО(12, 2)) КАК Цена
		                      |ИЗ
		                      |	(ВЫБРАТЬ
		                      |		ВЗ.НомерСтроки КАК НомерСтроки,
		                      |		ВЗ.Номенклатура.Артикул КАК Артикул,
		                      |		ВЗ.Номенклатура КАК Номенклатура,
		                      |		ВЗ.Характеристика КАК Характеристика,
		                      |		ВЗ.КоличествоМест КАК КоличествоМест,
		                      |		ВЗ.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		                      |		ВЗ.Количество КАК Количество,
		                      |		ВЗ.Номенклатура.Единица КАК ЕдиницаХранения,
		                      |		ВЫБОР
		                      |			КОГДА ЕСТЬNULL(ТоварыВНаличииОбороты.КоличествоРасход, 0) = 0
		                      |				ТОГДА 0
		                      |			ИНАЧЕ ЕСТЬNULL(ТоварыВНаличииОбороты.СуммаРасход, 0) / ЕСТЬNULL(ТоварыВНаличииОбороты.КоличествоРасход, 0) * ВЗ.Количество
		                      |		КОНЕЦ КАК Сумма
		                      |	ИЗ
		                      |		(ВЫБРАТЬ
		                      |			ТЧТовары.Ссылка КАК Ссылка,
		                      |			ТЧТовары.НомерСтроки КАК НомерСтроки,
		                      |			ТЧТовары.Номенклатура КАК Номенклатура,
		                      |			ТЧТовары.Характеристика КАК Характеристика,
		                      |			ТЧТовары.КоличествоУпаковок КАК КоличествоМест,
		                      |			ВЫБОР
		                      |				КОГДА ТЧТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		                      |					ТОГДА ТЧТовары.Номенклатура.Единица
		                      |				ИНАЧЕ ТЧТовары.Упаковка
		                      |			КОНЕЦ КАК ЕдиницаИзмерения,
		                      |			ТЧТовары.Количество КАК Количество
		                      |		ИЗ
		                      |			Документ.СписаниеТоваров.ТЧТовары КАК ТЧТовары
		                      |		ГДЕ
		                      |			ТЧТовары.Ссылка = &Док) КАК ВЗ
		                      |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВНаличии.Обороты(, , Регистратор, ) КАК ТоварыВНаличииОбороты
		                      |			ПО ВЗ.Ссылка = ТоварыВНаличииОбороты.Регистратор
		                      |				И ВЗ.Номенклатура = ТоварыВНаличииОбороты.Номенклатура
		                      |				И ВЗ.Характеристика = ТоварыВНаличииОбороты.Характеристика) КАК ВЗ");
	Запрос.УстановитьПараметр("Док", Док);
	ТЗ = Запрос.Выполнить().Выгрузить();
	оСтрока = Макет.ПолучитьОбласть("Строка"); 	
	Для Каждого Стр Из ТЗ Цикл
		оСтрока.Параметры.Заполнить(Стр);
		оСтрока.Параметры.Товар = ОбщегоНазначенияКлиентСервер.ПредставлениеНоменклатуры(Стр.Номенклатура, Стр.Характеристика);
		Таб.Вывести(оСтрока);
	КонецЦикла;
	оИтого = Макет.ПолучитьОбласть("Итого");
	СуммаСписания = ТЗ.Итог("Сумма");
	оИтого.Параметры.Всего = СуммаСписания;
	Таб.Вывести(оИтого);
	оСуммаПрописью = Макет.ПолучитьОбласть("СуммаПрописью");
	//оСуммаПрописью.Параметры.ИтоговаяСтрока = "Всего наименований " + СокрЛП(ТЗ.Количество()) + ", на сумму " + Формат(СуммаСписания, "ЧЦ=12; ЧДЦ=2") + " руб.";
	оСуммаПрописью.Параметры.СуммаПрописью = Справочники.Валюты.СформироватьСуммуПрописью(СуммаСписания, Справочники.Валюты.MoroccanDirham, Перечисления.Локализации.fr_CA);
	Таб.Вывести(оСуммаПрописью);
	Таб.Вывести(Макет.ПолучитьОбласть("Подписи"));
	Таб.ВывестиГоризонтальныйРазделительСтраниц();
	Таб.ИспользуемоеИмяФайла = РаботаСДокументами.КраткоеПредставлениеДокумента(Док, "Акт списания");
КонецПроцедуры

#КонецОбласти