#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ (СальдоНаКонецДт
		ИЛИ СальдоНаКонецКт
		ИЛИ СальдоНаНачалоДт
		ИЛИ СальдоНаНачалоКт
		ИЛИ ОборотыЗаПериодДт
		ИЛИ ОборотыЗаПериодКт
		ИЛИ ОборотыСоСчетамиДт
		ИЛИ ОборотыСоСчетамиКт) Тогда
		
		ТекстСообщения = НСтр("fr = 'Données de sortie non spécifiées'; ru = 'Не указаны выводимые данные'; en = 'Output data is not specified'; es = 'No se especifican los datos de salida'");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Отчет.СальдоНаНачалоДт",, Отказ);
		
	КонецЕсли;
	
	БухгалтерскиеОтчетыВызовСервера.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
	БухгалтерскиеОтчетыВызовСервера.ОбработкаПроверкиЗаполненияОтборов(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли