
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ВозвращатьСвязь") Тогда
		ВозвращатьСвязь = Параметры.ВозвращатьСвязь;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ВозвращатьСвязь Тогда
		СтандартнаяОбработка = Ложь;
		ТекСтр = Элементы.Список.ТекущиеДанные;
		Результат = Новый Структура("Ссылка, Номенклатура, Характеристика, Упаковка", ТекСтр.Ссылка, ТекСтр.Номенклатура, ТекСтр.Характеристика, ТекСтр.Упаковка);
		Закрыть(Результат);
	КонецЕсли;	
КонецПроцедуры
