#Область ПрограммныйИнтерфейс

// Перечисляет печатные формы объекта.
// См. ПечатныеФормы.НоваяКоллекцияКомандПечати
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - пополняемая коллекция команд печати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	Команда = КомандыПечати.Добавить();
	Команда.ИмяМакета = "НакладнаяНаОприходованиеТоваров";
	Команда.Представление = НСтр("ru = 'Оприходование товаров'; fr = 'Entrée des marchandises';
		|en = 'Registration of goods'; es = 'Compra de bienes'");

КонецПроцедуры

// Формирует запрошенные печатные формы.
// См. ПечатныеФормы.СформироватьПечатныеФормы
//
// Параметры:
//  МассивОбъектов        - Массив          - печатаемые объекты
//  ПараметрыПечати       - Структура       - параметры команды печати
//  КоллекцияПечатныхФорм - ТаблицаЗначений - заполняемая коллекция печатных форм
//  ОбъектыПечати         - СписокЗначений  - соответствие объектов областям печати
//  ПараметрыВывода       - Структура       - параметры окна печати
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	Если ПечатныеФормы.НужноПечататьМакет(КоллекцияПечатныхФорм, "НакладнаяНаОприходованиеТоваров") Тогда
		Таб = Новый ТабличныйДокумент;
		Для Каждого Док Из МассивОбъектов Цикл
			НомерСтрокиНачало = Таб.ВысотаТаблицы + 1;
			ПечатьНакладнаяНаОприходованиеТоваров(Док, Таб);
			ПечатныеФормы.ЗадатьОбластьПечати(Таб, НомерСтрокиНачало, ОбъектыПечати, Док);
		КонецЦикла;
		ПечатныеФормы.ВывестиТабличныйДокумент(КоллекцияПечатныхФорм, "НакладнаяНаОприходованиеТоваров",
			НСтр("ru = 'Оприходование товаров'; fr = 'Entrée des marchandises';
			|en = 'Registration of goods'; es = 'Compra de bienes'"),
			Таб, "Документ.ОприходованиеТоваров.НакладнаяНаОприходованиеТоваров");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Печать

Процедура ПечатьНакладнаяНаОприходованиеТоваров(Док, Таб) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Таб.ОтображатьСетку = Ложь;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	Таб.АвтоМасштаб = Истина;
	Таб.КлючПараметровПечати = "Параметры_печати_Документ_ОприходованиеТоваров_НакладнаяНаОприходованиеТоваров";
	Макет = ПечатныеФормы.МакетПечатнойФормы("Документ.ОприходованиеТоваров.НакладнаяНаОприходованиеТоваров");	
	оЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	оЗаголовок.Параметры.ТекстЗаголовка = РаботаСДокументами.КраткоеПредставлениеДокумента(Док, НСтр("fr = 'Entrée des marchandises'; ru = 'Оприходование товаров'; en = 'Registration of goods'; es = 'Compra de bienes'"));
	Таб.Вывести(оЗаголовок);
	оПолучатель = Макет.ПолучитьОбласть("Получатель");	
	оПолучатель.Параметры.ПредставлениеПолучателя = Док.Организация;
	Таб.Вывести(оПолучатель);
	Таб.Вывести(Макет.ПолучитьОбласть("Шапка"));
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТЧТовары.НомерСтроки КАК НомерСтроки,
	                      |	ТЧТовары.Номенклатура.Артикул КАК Артикул,
	                      |	ТЧТовары.Номенклатура КАК Номенклатура,
	                      |	ТЧТовары.Характеристика КАК Характеристика,
	                      |	ТЧТовары.КоличествоУпаковок КАК КоличествоМест,
	                      |	ВЫБОР
	                      |		КОГДА ТЧТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	                      |			ТОГДА ТЧТовары.Номенклатура.Единица
	                      |		ИНАЧЕ ТЧТовары.Упаковка
	                      |	КОНЕЦ КАК ЕдиницаИзмерения,
	                      |	ТЧТовары.Количество КАК Количество,
	                      |	ТЧТовары.Номенклатура.Единица КАК ЕдиницаХранения,
	                      |	ТЧТовары.Цена КАК Цена,
	                      |	ТЧТовары.Сумма КАК Сумма
	                      |ИЗ
	                      |	Документ.ОприходованиеТоваров.ТЧТовары КАК ТЧТовары
	                      |ГДЕ
	                      |	ТЧТовары.Ссылка = &Док");
	Запрос.УстановитьПараметр("Док", Док);
	ТЗ = Запрос.Выполнить().Выгрузить();
	оСтрока = Макет.ПолучитьОбласть("Строка"); 	
	Для Каждого Стр Из ТЗ Цикл
		оСтрока.Параметры.Заполнить(Стр);
		оСтрока.Параметры.Товар = ОбщегоНазначенияКлиентСервер.ПредставлениеНоменклатуры(Стр.Номенклатура, Стр.Характеристика, , Истина);
		Таб.Вывести(оСтрока);
	КонецЦикла;
	оИтого = Макет.ПолучитьОбласть("Итого");
	СуммаОприходования = ТЗ.Итог("Сумма");
	оИтого.Параметры.Всего = СуммаОприходования;
	Таб.Вывести(оИтого);
	оСуммаПрописью = Макет.ПолучитьОбласть("СуммаПрописью");
	//оСуммаПрописью.Параметры.ИтоговаяСтрока = "Всего наименований " + СокрЛП(ТЗ.Количество()) + ", на сумму " + Формат(СуммаОприходования, "ЧЦ=12; ЧДЦ=2") + " руб.";
	оСуммаПрописью.Параметры.СуммаПрописью = Справочники.Валюты.СформироватьСуммуПрописью(СуммаОприходования, Справочники.Валюты.MoroccanDirham, Перечисления.Локализации.fr_CA);
	Таб.Вывести(оСуммаПрописью);
	Таб.Вывести(Макет.ПолучитьОбласть("Подписи"));
	Таб.ВывестиГоризонтальныйРазделительСтраниц();
КонецПроцедуры

#КонецОбласти
