
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	РаботаСДокументами.ЗаполнитьРеквизитыПоУмолчанию(ЭтотОбъект);
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПересчётТоваров") Тогда
		Основание = ДанныеЗаполнения;
		Организация = ДанныеЗаполнения.Организация;
		МестоХранения = ДанныеЗаполнения.МестоХранения;
		МасНоменклатура = ДанныеЗаполнения.ТЧТовары.ВыгрузитьКолонку("Номенклатура");
		ТЗЦены = РегистрыСведений.ЦеныНоменклатурыПоставщиков.ПоследнийПрайс(ТекущаяДатаСеанса(), МасНоменклатура);		
		ТЗПредыдущиеДанные = ТЧТовары.Выгрузить();
		ТЧТовары.Очистить();
		Для Каждого Стр Из ДанныеЗаполнения.ТЧТовары Цикл
			Отклонение = Стр.КоличествоУпаковокФакт - Стр.КоличествоУпаковок;
			Если Отклонение <= 0 Тогда Продолжить КонецЕсли;
			НС = ТЧТовары.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Стр);				
			НС.КоличествоУпаковок = Отклонение;
			НС.Количество = Стр.КоличествоФакт - Стр.Количество;
			Мас = ТЗПредыдущиеДанные.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Упаковка", Стр.Номенклатура, Стр.Характеристика, Стр.Упаковка));
			Если Мас.Количество() > 0 Тогда
				НС.Цена = Мас[0].Цена;
			Иначе
				Мас = ТЗЦены.НайтиСтроки(Новый Структура("Номенклатура, Характеристика", Стр.Номенклатура, Стр.Характеристика));
				Если Мас.Количество() > 0 Тогда
					НС.Цена = Мас[0].Цена * (НС.Количество / НС.КоличествоУпаковок);	
				КонецЕсли;	
			КонецЕсли;
			РаботаСДокументамиКлиентСервер.РассчитатьСтроку(НС);
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	УстановитьПривилегированныйРежим(Истина);
	РаботаСДокументами.УстановитьЗаписьВсехРегистров(Движения);
	// Данные для проведения
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ТЗТоварыССериями", СерииИРазмещение.ОбъединитьТоварыССериями(ЭтотОбъект));

	// Блокировки
	Блокировка = Новый БлокировкаДанных;
	УправляемыеБлокировки.ТоварыВНаличии(Блокировка, ТЧТовары, МестоХранения);
	Блокировка.Заблокировать();
	// Формируем
	РегистрыНакопления.ТоварыВНаличии.СформироватьДвижения(ЭтотОбъект);
	// Записываем
	Движения.Записать();
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = ПараметрыСеанса.Пользователь;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	РаботаСДокументами.МожноРедактироватьДокумент(ЭтотОбъект, Отказ);
КонецПроцедуры


