
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	БухгалтерскиеОтчетыВызовСервера.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	УправлениеФормой(ЭтаФорма);
	Отчет.ПоСубсчетам = Истина;
	Отчет.ПоСубсчетамКорСчетов = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьТекстЗаголовка(ЭтаФорма);
	
	БухгалтерскиеОтчетыКлиент.ПриОткрытии(ЭтаФорма, Отказ);
	
	ЗаполнитьРеквизитыОбъектаИзНастроек();
	ИзменениеСхемыКомпоновкиДанныхНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	БухгалтерскиеОтчетыКлиент.ПередЗакрытием(ЭтаФорма, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка, Отчет.РежимРасшифровки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	БухгалтерскиеОтчетыКлиент.ПриЗакрытии(ЭтаФорма, ЗавершениеРаботы);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки, ИспользуютсяСтандартныеНастройки)
	
	Если ИспользуютсяСтандартныеНастройки Тогда
		Возврат;
	КонецЕсли;
	
	Если Не КомпоновщикИнициализирован Тогда
		ПользовательскиеНастройки = ПоместитьВоВременноеХранилище(Настройки, УникальныйИдентификатор);
	КонецЕсли;
	
	БухгалтерскиеОтчетыВызовСервера.ПриЗагрузкеПользовательскихНастроекНаСервере(ЭтаФорма, Настройки);
	
	Если КомпоновщикИнициализирован Тогда
		ИзменениеСхемыКомпоновкиДанныхНаСервере();
	КонецЕсли;
	
	ОбновитьТекстЗаголовка(ЭтаФорма);
	
	УправлениеФормой(ЭтаФорма);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
КонецПроцедуры

&НаКлиенте
Процедура ПосчитатьСуммуВыделенных(Команда)
	РассчитатьПоказателиДинамически();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#Область Результат

&НаКлиенте
Процедура РезультатПриАктивизации(Элемент)
	
	ПодключитьОбработчикОжидания("РассчитатьПоказателиДинамически", 0.2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	БухгалтерскиеОтчетыКлиент.ОбработкаРасшифровкиСтандартногоОтчета(ЭтаФорма, Элемент, Расшифровка, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаДополнительнойРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	// Не будем обрабатывать нажатие на правую кнопку мыши.
	// Покажем стандартное контекстное меню ячейки табличного документа.
	Расшифровка = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатПриИзменении(Элемент)
	
	РучнаяКорректировка = Истина;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	Перем ОтказПроверкиЗаполнения;
	
	ОчиститьСообщения();
	
	РезультатВыполнения = СформироватьОтчетНаСервере();
	РезультатВыполнения.Свойство("ОтказПроверкиЗаполнения", ОтказПроверкиЗаполнения);
	Если Не РезультатВыполнения.ЗаданиеВыполнено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "ФормированиеОтчета");
	КонецЕсли;
	
	РучнаяКорректировка = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыОбъектаИзНастроек()
	ПараметрПериод = Новый ПараметрКомпоновкиДанных("Период"); 
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Новый ПараметрКомпоновкиДанных("Счет"));	
	МассивПараметров.Добавить(Новый ПараметрКомпоновкиДанных("Организация"));	
	МассивПараметров.Добавить(Новый ПараметрКомпоновкиДанных("ПоСубсчетам"));	
	Отчет.Группировка.Очистить();
	Для Каждого ЭлементНастройки из Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл 
		Если ТипЗнч(ЭлементНастройки) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") И ЭлементНастройки.Параметр = ПараметрПериод Тогда
			Отчет.НачалоПериода = ЭлементНастройки.Значение.ДатаНачала;
			Отчет.КонецПериода = ЭлементНастройки.Значение.ДатаОкончания;
		КонецЕсли;
		Если ТипЗнч(ЭлементНастройки) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") И Не МассивПараметров.Найти(ЭлементНастройки.Параметр) = Неопределено Тогда
			Отчет[СокрЛП(ЭлементНастройки.Параметр)] = ?(ЭлементНастройки.Использование,ЭлементНастройки.Значение,Неопределено);
		КонецЕсли;
		Если ТипЗнч(ЭлементНастройки) = Тип("СтруктураНастроекКомпоновкиДанных") Тогда
			Для Каждого СтруктураНастроки из ЭлементНастройки.Структура Цикл
				Если СтруктураНастроки.ПоляГруппировки.Элементы.Количество() = 0 Тогда 
					Продолжить;
				КонецЕсли;
				ТекПоле = СтруктураНастроки.ПоляГруппировки.Элементы.Получить(0); 
				Если ТекПоле.Поле = Новый ПолеКомпоновкиДанных("Счет")  
					Или ТекПоле.Поле = Новый ПолеКомпоновкиДанных("КорСчет") Тогда 
					Продолжить;
				КонецЕсли;
				Если Не Отчет.Группировка.НайтиСтроки(Новый Структура("Поле",СокрЛП(ТекПоле.Поле))).Количество() = 0 Тогда 
					Продолжить;
				КонецЕсли;
				СтрГруппировка = Отчет.Группировка.Добавить();
				СтрГруппировка.Использование = Истина;
				СтрГруппировка.Поле = ТекПоле.Поле;
				СтрГруппировка.ТипГруппировки = Истина;
				Если ТекПоле.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Иерархия Тогда
					СтрГруппировка.ТипГруппировки = 1;
				ИначеЕсли ТекПоле.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.ТолькоИерархия Тогда
					СтрГруппировка.ТипГруппировки = 2;
				Иначе
					СтрГруппировка.ТипГруппировки = 0;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	ОбновитьТекстЗаголовка(ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстЗаголовка(Форма)
	
	Отчет = Форма.Отчет;
	
	ТекстОрганизация = "";
	Если ЗначениеЗаполнено(Отчет.Организация) Тогда
		ТекстОрганизация = Отчет.Организация;
	КонецЕсли;
	
	Форма.Заголовок = СтрШаблон(
		НСтр("fr = 'Analyse du compte  %1%2 %3'; ru = 'Анализ счета %1%2 %3'; en = 'Account analysis %1%2%3'; es = 'Análisis de cuenta %1% 2% 3'"),
		Отчет.Счет,
		БухгалтерскиеОтчетыКлиентСервер.ПолучитьПредставлениеПериода(
			Отчет.НачалоПериода,
			Отчет.КонецПериода),
			ТекстОрганизация);

КонецПроцедуры

&НаКлиенте
Функция ПолучитьЗапрещенныеПоля(Режим = "") Экспорт
	
	СписокПолей = Новый Массив;
	
	СписокПолей.Добавить("UserFields");
	СписокПолей.Добавить("DataParameters");
	СписокПолей.Добавить("SystemFields");
	СписокПолей.Добавить("Показатели");
	СписокПолей.Добавить("Период");
	СписокПолей.Добавить("Показатель");
	СписокПолей.Добавить("БухТипРесурса");
	
	
	БухгалтерскиеОтчетыКлиент.ДобавитьПоляРесурсовВЗапрещенныеПоля(ЭтаФорма, СписокПолей);
	
	Если ЗначениеЗаполнено(Отчет.Счет) Тогда 
		КоличествоСубконто = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Отчет.Счет).КоличествоСубконто;
	Иначе
		КоличествоСубконто = 0;
	КонецЕсли;
	Для Индекс = КоличествоСубконто + 1 По 3 Цикл
		СписокПолей.Добавить("Субконто" + Индекс);
	КонецЦикла;
	
	Если Не Отчет.ПоказательВалютнаяСумма Тогда
		СписокПолей.Добавить("Валюта");
	КонецЕсли;
	
	Если Режим = "Группировка" Тогда
		СписокПолей.Добавить("Счет");
		СписокПолей.Добавить("СальдоНаНачалоПериода");
		СписокПолей.Добавить("ОборотыЗаПериод");
		СписокПолей.Добавить("СальдоНаКонецПериода");
		СписокПолей.Добавить("КорСчет");
		СписокПолей.Добавить("Регистратор");
		Для Индекс = 1 По 3 Цикл
			СписокПолей.Добавить("КорСубконто" + Индекс);
		КонецЦикла;
	ИначеЕсли Режим = "Выбор" Тогда
		СписокПолей.Добавить("СальдоНаНачалоПериода");
		СписокПолей.Добавить("ОборотыЗаПериод");
		СписокПолей.Добавить("СальдоНаКонецПериода");
	КонецЕсли;
	
	Возврат Новый ФиксированныйМассив(СписокПолей);
	
КонецФункции

&НаСервере
Функция СформироватьОтчетНаСервере() Экспорт
	
	РезультатВыполнения = Новый Структура;
	РезультатВыполнения.Вставить("ЗаданиеВыполнено", Истина);
	РезультатВыполнения.Вставить("ОтказПроверкиЗаполнения", Ложь);
	
	Если Не ПроверитьЗаполнение() Тогда
		
		РезультатВыполнения.ОтказПроверкиЗаполнения = Истина;
		Возврат РезультатВыполнения;
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеИспользовать");
	
	Если Не КомпоновщикИнициализирован Тогда
		ИнициализацияКомпоновщикаНастроек();
	КонецЕсли;
	
	Настройки = Отчет.КомпоновщикНастроек.Настройки;
	Настройки.Отбор.ИдентификаторПользовательскойНастройки              = "";
	Настройки.Порядок.ИдентификаторПользовательскойНастройки            = "";
	Настройки.УсловноеОформление.ИдентификаторПользовательскойНастройки = "";
	
	ПараметрыОтчета = Отчеты.АнализСчета.ПустыеПараметрыКомпоновкиОтчета();
	Отчеты.АнализСчета.ЗаполнитьПараметрыИзФормы(ПараметрыОтчета, ЭтотОбъект);
	
	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	БухгалтерскиеОтчетыВызовСервера.СформироватьОтчет(ПараметрыОтчета, АдресХранилища);
	
	Если РезультатВыполнения.ЗаданиеВыполнено Тогда
		ЗагрузитьПодготовленныеДанные();
	КонецЕсли;
	
	Возврат РезультатВыполнения;
	
КонецФункции

&НаСервере
Процедура СчетПриИзмененииСервер()
	
	Если Не КомпоновщикИнициализирован Тогда
		ИнициализацияКомпоновщикаНастроек();
	Иначе
		
		Если Не Отчет.РежимРасшифровки Тогда
			
			БухгалтерскиеОтчеты.СохранитьОписаниеНастроек(ЭтотОбъект, СчетИсходноеЗначение);
			
		КонецЕсли;
		
		ИзменениеСхемыКомпоновкиДанныхНаСервере();
	КонецЕсли;
	
	БухгалтерскиеОтчеты.ПрочитатьОписаниеНастроек(ЭтотОбъект, Отчет.Счет);
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ИзменениеСхемыКомпоновкиДанныхНаСервере() Экспорт
	
	Отчеты.АнализСчета.НастроитьСхемуКомпоновкиДанных(СхемаКомпоновкиДанных, Отчет.Счет);

	Отчет.КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкамиПоУмолчанию(ЗаполняемыеНастройки) Экспорт
	
	Перем ЗаполнятьКоллекцию;
	
	//Если ЗаполняемыеНастройки.Свойство("Отбор", ЗаполнятьКоллекцию) И ЗаполнятьКоллекцию Тогда
	//	
	//	БухгалтерскиеОтчеты.ПреобразоватьОтборыПоСчету(Отчет.КомпоновщикНастроек.Настройки.Отбор,
	//		СчетИсходноеЗначение, Отчет.Счет);
	//		
	//	Если ЗаполняемыеНастройки.Количество() = 1 Тогда
	//		// Заполнение отборов может вызываться отдельно из процедуры БухгалтерскиеОтчеты.ПрочитатьОписаниеНастроек() .
	//		// В этом случае нет необходимости инициализировать лишние переменные (например, ДанныеСчета).
	//		Возврат;
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
	ДанныеСчета                          = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Отчет.Счет);
	КоличествоСубконто                   = ДанныеСчета.КоличествоСубконто;
	
	//Если ЗаполняемыеНастройки.Свойство("Показатели", ЗаполнятьКоллекцию) И ЗаполнятьКоллекцию Тогда
	//	// Управление показателями.
	//	Отчет.ПоказательБУ            = Истина;
	//	Отчет.ПоказательВалютнаяСумма = Ложь; //ДанныеСчета.Валютный;
	//	Отчет.ПоказательКоличество    = ДанныеСчета.Количественный;
	//	
	//	БухгалтерскиеОтчетыПереопределяемый.ДополнительноеУправлениеПоказателями(Отчет)
	//	
	//КонецЕсли;

	//Если ЗаполняемыеНастройки.Свойство("Группировка", ЗаполнятьКоллекцию) И ЗаполнятьКоллекцию Тогда
	//	// Добавление группировок с соответствии с выбранным счетом.
	//	Отчет.Группировка.Очистить();
	//	
	//	БухгалтерскиеОтчетыПереопределяемый.ДобавитьДополнительныеГруппировки(Отчет);
	//	
	//	Если ЕстьУчетПоПодразделениям Тогда
	//		НоваяСтрока = Отчет.Группировка.Добавить();
	//		НоваяСтрока.Поле           = "Подразделение";
	//		НоваяСтрока.Использование  = Истина;
	//		НоваяСтрока.Представление  = НСтр("fr = 'Département'; ru = 'Подразделение'; en = 'Division'; es = 'Unidad'");
	//		НоваяСтрока.ТипГруппировки = 0;
	//	КонецЕсли;
	//	
	//	// По умолчанию будет включено только первое субконто счета.
	//	Использование = Истина;
	//	
	//	Для Индекс = 1 По КоличествоСубконто Цикл
	//		
	//		НоваяСтрока = Отчет.Группировка.Добавить();
	//		Поле = Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("Субконто" + Индекс));
	//		НоваяСтрока.Поле           = Поле.Поле;
	//		НоваяСтрока.Использование  = Использование;
	//		НоваяСтрока.Представление  = Поле.Заголовок;
	//		НоваяСтрока.ТипГруппировки = 0;
	//		
	//		Использование = Ложь;
	//		
	//		Если ДанныеСчета.Валютный Тогда
	//			НоваяСтрока = Отчет.Группировка.Добавить();
	//			НоваяСтрока.Поле = "Валюта";
	//			НоваяСтрока.Использование  = Использование;
	//			НоваяСтрока.Представление  = НСтр("fr = 'Devise'; ru = 'Валюта'; en = 'Currency'; es = 'Moneda'");
	//			НоваяСтрока.ТипГруппировки = 0;
	//		КонецЕсли;
	//	КонецЦикла;

	//КонецЕсли;
	//
	//Если ЗаполняемыеНастройки.Свойство("ДополнительныеПоля", ЗаполнятьКоллекцию) И ЗаполнятьКоллекцию Тогда
	//	БухгалтерскиеОтчетыВызовСервера.ЗаполнитьДополнительныеПоляИзНастроек(
	//		Отчет.КомпоновщикНастроек,
	//		Отчет.ДополнительныеПоля,
	//		Отчет.Группировка);
	//КонецЕсли;
	//	
	//Если ЗаполняемыеНастройки.Свойство("Порядок", ЗаполнятьКоллекцию) И ЗаполнятьКоллекцию Тогда
	//	Порядок = Отчет.КомпоновщикНастроек.Настройки.Порядок;
	//	БухгалтерскиеОтчеты.УдалитьНедоступныеПоля(Порядок.Элементы, Порядок.ДоступныеПоляПорядка, КоличествоСубконто);
	//КонецЕсли;	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	Отчет    = Форма.Отчет;
	
	ДанныеСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Форма.Отчет.Счет);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПодготовленныеДанные()

	РезультатВыполнения = ПолучитьИзВременногоХранилища(АдресХранилища);
	
	Результат = РезультатВыполнения.Результат;	

	ДанныеРасшифровки = РезультатВыполнения.ДанныеРасшифровки;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеИспользовать");
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПараметрыВыбораЗначенияОтбора() Экспорт
	
	СписокПараметров = Новый Структура;
	СписокПараметров.Вставить("Дата"              , Отчет.КонецПериода);
	СписокПараметров.Вставить("СчетУчета"         , Отчет.Счет);
	СписокПараметров.Вставить("Номенклатура"      , Неопределено);
	СписокПараметров.Вставить("Склад"             , Неопределено);
	СписокПараметров.Вставить("Организация"       , Отчет.Организация);
	СписокПараметров.Вставить("Контрагент"        , Неопределено);
	СписокПараметров.Вставить("ДоговорКонтрагента", Неопределено);
	
	Возврат СписокПараметров;
	
КонецФункции

&НаСервере
Процедура ИнициализацияКомпоновщикаНастроек()
	
	БухгалтерскиеОтчетыВызовСервера.ИнициализацияКомпоновщикаНастроек(ЭтаФорма, ОрганизацияИзменилась);
	
	ИзменениеСхемыКомпоновкиДанныхНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекПользовательскиеНастройкиПриИзменении(Элемент)
	ЗаполнитьРеквизитыОбъектаИзНастроек();
	ИзменениеСхемыКомпоновкиДанныхНаСервере();
КонецПроцедуры

&НаСервере
Функция ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента() Экспорт
	Сумма = 0;
	//Для Каждого Область Из Результат.ВыделенныеОбласти Цикл
	//	Если ТипЗнч(Область) = Тип("ОбластьЯчеекТабличногоДокумента") Тогда
	//		Для ИндексСтрока = Область.Верх По Область.Низ Цикл
	//			Для ИндексКолонка = Область.Лево По Область.Право Цикл
	//				Попытка
	//					Сумма = Сумма + Число(СтрЗаменить(Результат.Область("R" + Формат(ИндексСтрока, "ЧГ=0") + "C" + Формат(ИндексКолонка, "ЧГ=0")) .Текст, " ", ""));
	//				Исключение
	//				КонецПопытки;
	//			КонецЦикла;
	//		КонецЦикла;
	//	КонецЕсли;
	//КонецЦикла;
	Возврат Сумма;
КонецФункции 

&НаКлиенте
Процедура РассчитатьПоказателиДинамически()
	ТекущаяКоманда = ""; //сумма, среднее, макс,мин...
	ОбщегоНазначенияКлиентСервер.РассчитатьПоказатели(ЭтотОбъект, "Результат","ФормаПосчитатьСуммуВыделенных", ТекущаяКоманда, 2);
КонецПроцедуры

#КонецОбласти