
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Номенклатура") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("Номенклатура", Параметры.Номенклатура);
		Элементы.Номенклатура.Видимость = Ложь;
		Элементы.Владелец.Видимость = Истина;
		Элементы.Список.ТолькоПросмотр = Истина;
		ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиФормы.Нет;
		АвтоЗаголовок = Ложь;
		Заголовок = "Номенклатура контрагентов"; 
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("Номенклатура", Справочники.Номенклатура.ПустаяСсылка());
	КонецЕсли;
КонецПроцедуры
