
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОтборПоСтатусу = "Все";  
	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоСтатусуПриИзменении(Элемент)
	УдалитьОтбор(Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, "Статус");
	Если ОтборПоСтатусу = "Новый" или ОтборПоСтатусу = "ВРаботе" или ОтборПоСтатусу = "Собран"  Тогда                                     
		ДанныеВыбора = ПолучитьСтатусыЗаказовПокупателя(ОтборПоСтатусу);
		ДобавитьОтбор(Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, "Статус", ДанныеВыбора, ВидСравненияКомпоновкиДанных.Равно);		
	КонецЕсли;
КонецПроцедуры 

&НаСервере
Функция ПолучитьСтатусыЗаказовПокупателя(ОтборПоСтатусу)
	Если ОтборПоСтатусу = "Новый" Тогда
		Возврат Перечисления.СтатусыЗаказовПокупателя.Новый; 
	КонецЕсли;
	Если ОтборПоСтатусу = "ВРаботе" Тогда
		Возврат Перечисления.СтатусыЗаказовПокупателя.ВРаботе; 
	КонецЕсли;  
	Если ОтборПоСтатусу = "Собран" Тогда
		Возврат Перечисления.СтатусыЗаказовПокупателя.Собран; 
	КонецЕсли;
КонецФункции

&НаКлиенте
Функция ДобавитьОтбор(СписокОтборов, ИмяПоля, Значение, ВидСравнения = Неопределено, Использование = Истина)
	НовыйЭлемент = СписокОтборов.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
	НовыйЭлемент.ВидСравнения = ?(ВидСравнения = Неопределено, ВидСравненияКомпоновкиДанных.Равно, ВидСравнения);
	НовыйЭлемент.ПравоеЗначение = Значение;
	НовыйЭлемент.Использование = Использование;
	Возврат НовыйЭлемент;
КонецФункции

&НаКлиенте
Функция УдалитьОтбор(СписокОтборов, ИмяПоля = "")
	Если ПустаяСтрока(ИмяПоля) Тогда
		СписокОтборов.Элементы.Очистить();
		Возврат Истина;
	КонецЕсли;
	Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
	ОтборУдален = Ложь;
	Для каждого ЭлементОтбора Из СписокОтборов.Элементы Цикл
		Если ЭлементОтбора.Использование И ЭлементОтбора.ЛевоеЗначение = Поле Тогда
			СписокОтборов.Элементы.Удалить(ЭлементОтбора);
			ОтборУдален = Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат ОтборУдален;
КонецФункции

