
Процедура СформироватьДвижения(ДокОбъект) Экспорт
	Движения = ДокОбъект.Движения;
	Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПоступлениеБезналичныхДенежныхСредств") Тогда
		//Если Не ДокОбъект.ПроведеноБанком Тогда Возврат КонецЕсли;
		ТипДенежныхСредств = Справочники.TypesDePayment.VirementBanquaire; //Перечисления.ТипыДенежныхСредств.Безналичные;
		МестоХранения = ДокОбъект.БанковскийСчёт;
		ТипДвижения = Перечисления.ТипыДвиженияДенежныхСредств.Поступление;
		Период = ?(ЗначениеЗаполнено(ДокОбъект.ДатаПроведенияБанком),ДокОбъект.ДатаПроведенияБанком,ДокОбъект.Дата);
		Если ДокОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.Инкассация Тогда 
			Движение(Движения, ДокОбъект, ДокОбъект.Дата, ДокОбъект.Организация, ДокОбъект.СтатьяДДС, ДокОбъект.Касса, Перечисления.ТипыДвиженияДенежныхСредств.Списание, Справочники.TypesDePayment.Cash, ДокОбъект.Сумма,ДокОбъект.Ссылка);
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.СписаниеБезналичныхДенежныхСредств") Тогда
		//Если Не ДокОбъект.ПроведеноБанком Тогда Возврат КонецЕсли;
		ТипДенежныхСредств = Справочники.TypesDePayment.VirementBanquaire; //.ТипыДенежныхСредств.Безналичные;
		МестоХранения = ДокОбъект.БанковскийСчёт;
		ТипДвижения = Перечисления.ТипыДвиженияДенежныхСредств.Списание;
		Период = ?(ЗначениеЗаполнено(ДокОбъект.ДатаПроведенияБанком),ДокОбъект.ДатаПроведенияБанком,ДокОбъект.Дата);
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПриходныйКассовыйОрдер") Тогда
		Если ДокОбъект.ТипОплаты = Справочники.TypesDePayment.Cheque Тогда Возврат; КонецЕсли;
		ТипДенежныхСредств = ДокОбъект.ТипОплаты; //Перечисления.ТипыДенежныхСредств.Наличные;
		МестоХранения = ДокОбъект.Касса;
		ТипДвижения = Перечисления.ТипыДвиженияДенежныхСредств.Поступление;
		Период = ДокОбъект.Дата;
		Если ДокОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзКассы Тогда 
			Движение(Движения, ДокОбъект, Период, ДокОбъект.Организация, ДокОбъект.СтатьяДДС, ДокОбъект.КассаИз, Перечисления.ТипыДвиженияДенежныхСредств.Списание, ТипДенежныхСредств, ДокОбъект.Сумма,ДокОбъект.Ссылка);
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.РасходныйКассовыйОрдер") Тогда	
		ТипДенежныхСредств = ДокОбъект.ТипОплаты; //Перечисления.ТипыДенежныхСредств.Наличные;
		МестоХранения = ДокОбъект.Касса;
		ТипДвижения = Перечисления.ТипыДвиженияДенежныхСредств.Списание;
		Период = ДокОбъект.Дата;
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.НалоговаяНакладная") или ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.НалоговаяНакладнаяПокупка") Тогда
		Если ДокОбъект.РучнаяКорректировка Тогда
			ТЗОплат = ДокОбъект.ТЧСпособыОплаты.Выгрузить();
		Иначе
			ТЗОплат = ПолучитьОплаты(ДокОбъект,Истина);
		КонецЕсли;
		Для Каждого СтрОплат из ТЗОплат Цикл 
			Если СтрОплат.ТипДенежныхСредств = Справочники.TypesDePayment.Cheque Тогда Продолжить; КонецЕсли;
			Если Не ДокОбъект.РучнаяКорректировка и СтрОплат.Организация.ОсновнойУчет Тогда Продолжить; КонецЕсли;
			//Если Не ЕстьДвижение(ДокОбъект.Ссылка,СтрОплат.Регистратор) Тогда
			Если СтрОплат.ТипДенежныхСредств = Справочники.TypesDePayment.Cash Тогда 
				МестоХранения = Справочники.Кассы.ПолучитьОсновную(ДокОбъект.Организация);
			Иначе
				МестоХранения = ?(ДокОбъект.РучнаяКорректировка, Справочники.БанковскиеСчета.ПолучитьОсновной(ДокОбъект.Организация), СтрОплат.МестоХранения);
			КонецЕсли;
			ТипДвижения = ?(ДокОбъект.РучнаяКорректировка, Перечисления.ТипыДвиженияДенежныхСредств.Поступление,СтрОплат.ТипДвижения);
			ДокРегистратор = ?(ДокОбъект.РучнаяКорректировка, ДокОбъект.Ссылка, СтрОплат.Регистратор);
			Если ДокОбъект.РучнаяКорректировка Тогда
				Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.НалоговаяНакладная") Тогда 
					СтатьяДДС = ОбщегоНазначенияВызовСервера.ПолучитьСтатьюДДСПоХозяйственнойОперации(Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента);
				Иначе
					СтатьяДДС = ОбщегоНазначенияВызовСервера.ПолучитьСтатьюДДСПоХозяйственнойОперации(Перечисления.ХозяйственныеОперации.ОплатаПоставщику);
				КонецЕсли;
			Иначе
				СтатьяДДС = СтрОплат.Регистратор.СтатьяДДС;
			КонецЕсли;
			Движение(Движения, ДокОбъект, СтрОплат.Период, ДокОбъект.Организация, СтатьяДДС, МестоХранения, ТипДвижения, СтрОплат.ТипДенежныхСредств, СтрОплат.Сумма, ДокРегистратор, ДокОбъект.Ссылка, СтрОплат.Период);
			//КонецЕсли;
		КонецЦикла;
		Возврат;
	КонецЕсли;
	//Движение(Движения, ДокОбъект, Период, ДокОбъект.Организация, ДокОбъект.СтатьяДДС, МестоХранения, ТипДвижения, ТипДенежныхСредств, ДокОбъект.Сумма,ДокОбъект.Ссылка);
	ТЗОснования = ДокОбъект.ТЧОснования.Выгрузить();
	ТЗОснования.Свернуть("Основание","Сумма");
	ТЗДляДвижений  = ТЗОснования.Скопировать();
	ТЗДляДвижений.Очистить();
	Для Каждого Стр из ТЗОснования Цикл
		Накладная = ?(ТипЗнч(Стр.Основание) = Тип("ДокументСсылка.НалоговаяНакладная") или ТипЗнч(Стр.Основание) = Тип("ДокументСсылка.НалоговаяНакладнаяПокупка")  или ТипЗнч(Стр.Основание) = Тип("ДокументСсылка.ПрочиеРасходы"), Стр.Основание, Неопределено);  
		НС = ТЗДляДвижений.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Стр);
		НС.Основание = Накладная;
	КонецЦикла;
	ТЗДляДвижений.Свернуть("Основание","Сумма");
	Для Каждого Стр из ТЗДляДвижений Цикл
		Движение(Движения, ДокОбъект, Период, ДокОбъект.Организация, ДокОбъект.СтатьяДДС, МестоХранения, ТипДвижения, ТипДенежныхСредств, Стр.Сумма, ДокОбъект.Ссылка, Стр.Основание);
	КонецЦикла;
	СуммаОстаток = ДокОбъект.Сумма - ТЗОснования.Итог("Сумма");
	Если Не СуммаОстаток = 0 Тогда 
		Движение(Движения, ДокОбъект, Период, ДокОбъект.Организация, ДокОбъект.СтатьяДДС, МестоХранения, ТипДвижения, ТипДенежныхСредств, СуммаОстаток,ДокОбъект.Ссылка);
	КонецЕсли;
	//Для Каждого Стр из ДокОбъект.ТЧОснования Цикл
	//	МасНакл = РаботаСДокументами.ПолучитьДокументыПоИмениПоОснованию(Метаданные.Документы.НалоговаяНакладная.Имя,Стр.Основание,Истина);
	//	Для Каждого Эл из МасНакл Цикл
	//		Если Не Эл.Проведен тогда Продолжить; КонецЕсли;
	//		Если Не ЕстьДвижение(Эл,ДокОбъект.Ссылка) Тогда 
	//			Движение(Движения, Эл, Период, Эл.Организация, ДокОбъект.СтатьяДДС, ДокОбъект.МестоХранения, ТипДвижения, ТипДенежныхСредств, 0,ДокОбъект.Ссылка,Эл,Стр.Сумма);
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЦикла;
КонецПроцедуры

Процедура Движение(Движения, ДокОбъект, Период, Организация, СтатьяДДС, МестоХранения, ТипДвижения, ТипДенежныхСредств, Сумма, ДокументДвижения = Неопределено, Накладная = Неопределено, ДатаДвижения = Неопределено)
	Если Сумма = 0 Тогда Возврат КонецЕсли;
	// Движения денежных средств
	НС = Движения.ДвиженияДенежныхСредств.Добавить();
	НС.Период = Период;
	НС.Организация = Организация;
	НС.МестоХранения = МестоХранения;
	НС.ТипДвижения = ТипДвижения;
	НС.СтатьяДДС = СтатьяДДС;
	НС.ТипДенежныхСредств = ТипДенежныхСредств;
	НС.Сумма = Сумма;
	// Денежные средства организаций
	НС = Движения.ДенежныеСредстваОрганизаций.Добавить();
	НС.ВидДвижения = ?(ТипДвижения = Перечисления.ТипыДвиженияДенежныхСредств.Списание, ВидДвиженияНакопления.Расход, ВидДвиженияНакопления.Приход);
	НС.Период = Период;
	НС.Организация = Организация;
	НС.МестоХранения = МестоХранения;
	НС.ТипДенежныхСредств = ТипДенежныхСредств;
	НС.ДокументДвижения = ДокументДвижения;
	НС.Накладная = Накладная;
	НС.ДатаДвижения = ?(ДатаДвижения = Неопределено, ДокументДвижения.Дата, ДатаДвижения);
	НС.Сумма = Сумма;
КонецПроцедуры

функция ПолучитьОплаты(ДокОбъект, НаТекДату = Ложь) Экспорт
	Если ТипЗнч(ДокОбъект.Ссылка) = Тип("ДокументСсылка.НалоговаяНакладнаяПокупка") Тогда 
		// IG 
		//МассивНакладных = ДокОбъект.ТЧТовары.Выгрузить().ВыгрузитьКолонку("ОтгрузкаТовара");
		МассивНакладных = ДокОбъект.ТЧТовары.Выгрузить().ВыгрузитьКолонку("ПоступлениеТовара");
	иначе
		//МассивНакладных = ДокОбъект.ТЧТовары.Выгрузить().ВыгрузитьКолонку("ПоступлениеТовара");
		МассивНакладных = ДокОбъект.ТЧТовары.Выгрузить().ВыгрузитьКолонку("ОтгрузкаТовара");
	КонецЕсли;
	КолЭлементов = МассивНакладных.ВГраница();
	Для Ном = 0 по КолЭлементов Цикл
		Эл = МассивНакладных.Получить(КолЭлементов-Ном);
		Если Не ЗначениеЗаполнено(Эл) Тогда 
			МассивНакладных.Удалить(КолЭлементов-Ном);
		КонецЕсли;
	КонецЦикла;
	МассивНакладных.Добавить(ДокОбъект.Ссылка);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДвиженияПоКассеОбороты.Период КАК Период,
	|	ДвиженияПоКассеОбороты.Регистратор КАК Регистратор,
	|	ДвиженияПоКассеОбороты.ДокументПродажи КАК ДокументПродажи,
	|	ДвиженияПоКассеОбороты.ТипДвижения КАК ТипДвижения,
	|	ДвиженияПоКассеОбороты.ТипДенежныхСредств КАК ТипДенежныхСредств,
	|	СУММА(ДвиженияПоКассеОбороты.СуммаОборот) КАК Сумма,
	|	ДвиженияПоКассеОбороты.МестоХранения КАК МестоХранения,
	|	ДвиженияПоКассеОбороты.КассоваяСмена КАК КассоваяСмена,
	|	ДвиженияПоКассеОбороты.Организация КАК Организация
	|ИЗ
	|	РегистрНакопления.ДвиженияПоКассе.Обороты(, , Регистратор, ДокументПродажи В (&МассивНакладных)) КАК ДвиженияПоКассеОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДенежныеСредстваОрганизаций КАК ДенежныеСредстваОрганизаций
	|		ПО ДвиженияПоКассеОбороты.Регистратор = ДенежныеСредстваОрганизаций.Регистратор
	|			И ДвиженияПоКассеОбороты.ТипДенежныхСредств = ДенежныеСредстваОрганизаций.ТипДенежныхСредств
	|ГДЕ
	|	(ЕСТЬNULL(ДенежныеСредстваОрганизаций.Накладная, ЗНАЧЕНИЕ(Документ.НалоговаяНакладная.ПустаяСсылка)) = НЕОПРЕДЕЛЕНО
	|			ИЛИ ЕСТЬNULL(ДенежныеСредстваОрганизаций.Накладная, ЗНАЧЕНИЕ(Документ.НалоговаяНакладная.ПустаяСсылка)) = ЗНАЧЕНИЕ(Документ.НалоговаяНакладная.ПустаяСсылка)
	|			ИЛИ ЕСТЬNULL(ДенежныеСредстваОрганизаций.Накладная, ЗНАЧЕНИЕ(Документ.НалоговаяНакладная.ПустаяСсылка)) = ЗНАЧЕНИЕ(Документ.НалоговаяНакладнаяПокупка.ПустаяСсылка)
	|			ИЛИ НЕ ЕСТЬNULL(ДенежныеСредстваОрганизаций.Накладная, ЗНАЧЕНИЕ(Документ.НалоговаяНакладная.ПустаяСсылка)) = ДенежныеСредстваОрганизаций.Регистратор)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДвиженияПоКассеОбороты.Организация,
	|	ДвиженияПоКассеОбороты.КассоваяСмена,
	|	ДвиженияПоКассеОбороты.МестоХранения,
	|	ДвиженияПоКассеОбороты.ТипДенежныхСредств,
	|	ДвиженияПоКассеОбороты.ТипДвижения,
	|	ДвиженияПоКассеОбороты.ДокументПродажи,
	|	ДвиженияПоКассеОбороты.Регистратор,
	|	ДвиженияПоКассеОбороты.Период";
	Запрос.УстановитьПараметр("ДатаДок", ?(НаТекДату,ТекущаяДата(),Новый Граница(ДокОбъект.МоментВремени(), ВидГраницы.Исключая)));
	Запрос.УстановитьПараметр("МассивНакладных", МассивНакладных);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ЕстьДвижение(Эл,Ссылка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДенежныеСредстваОрганизаций.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваОрганизаций КАК ДенежныеСредстваОрганизаций
	|ГДЕ
	|	ДенежныеСредстваОрганизаций.ДокументДвижения = &ДокументДвижения
	|	И ДенежныеСредстваОрганизаций.Накладная = &Накладная";
	Запрос.УстановитьПараметр("ДокументДвижения",Ссылка);
	Запрос.УстановитьПараметр("Накладная",Эл);
	Возврат Не Запрос.Выполнить().Пустой();
КонецФункции
