
#Область События_элементов_формы

Процедура ПередЗаписьюНаСервере(ТекущийОбъект, ДЗРеквизиты, Отказ) Экспорт
	// Проверим доступность реквизитов
	РеквизитыОбъекта = ТекущийОбъект.Метаданные().Реквизиты;
	ВидКонтрагента = ?(РеквизитыОбъекта.Найти("ВидКонтрагента") = Неопределено, Перечисления.ВидыКонтрагентов.ЧастноеЛицо, ТекущийОбъект.ВидКонтрагента);
	СЗДоступные = РеквизитыКонтрагентовВызовСервера.ПолучитьДоступныеВидыРеквизитов(ТекущийОбъект.Ссылка, ВидКонтрагента, Новый Массив);
	МасДоступные = Новый Массив;
	Для Каждого Стр Из СЗДоступные Цикл
		МасДоступные.Добавить(Стр.Значение.Реквизит);	
	КонецЦикла;	
	МасУстановленные = Новый Массив;
	СформироватьМассивУстановленныхРеквизитов(МасУстановленные, ДЗРеквизиты);
	ЕстьОшибки = Ложь;
	ТекстОшибки = "";
	Для Каждого Реквизит Из МасУстановленные Цикл
		Если МасДоступные.Найти(Реквизит) <> Неопределено Тогда Продолжить КонецЕсли;
		ЕстьОшибки = Истина;
		ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(ТекстОшибки, СокрЛП(Реквизит), ", ");
	КонецЦикла;
	ТекстОшибки = "Для вида контрагента (" + ВидКонтрагента + ") запрещены следующие реквизиты: " + ТекстОшибки;
	Если ЕстьОшибки Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,, Отказ);	
	Иначе	
		// Тут заполняются реквизиты объекта. Нужны для совместимости с сервисами EDI
		Если РеквизитыОбъекта.Найти("NIF") <> Неопределено Тогда
			Стр = ДЗРеквизиты.Строки.Найти(ПланыВидовХарактеристик.ВидыРеквизитовКонтрагентов.NIF, "Реквизит", Истина);
			ТекущийОбъект.NIF = ?(Стр = Неопределено, "", СокрЛП(Стр.Представление));
		КонецЕсли;
		Если РеквизитыОбъекта.Найти("RC") <> Неопределено Тогда
			Стр = ДЗРеквизиты.Строки.Найти(ПланыВидовХарактеристик.ВидыРеквизитовКонтрагентов.RC, "Реквизит", Истина);
			ТекущийОбъект.RC = ?(Стр = Неопределено, "", СокрЛП(Стр.Представление));	
		КонецЕсли;
		Если РеквизитыОбъекта.Найти("CNSS") <> Неопределено Тогда
			Стр = ДЗРеквизиты.Строки.Найти(ПланыВидовХарактеристик.ВидыРеквизитовКонтрагентов.CNSS, "Реквизит", Истина);
			ТекущийОбъект.CNSS = ?(Стр = Неопределено, "", СокрЛП(Стр.Представление));	
		КонецЕсли;
		Если РеквизитыОбъекта.Найти("ICE") <> Неопределено Тогда
			Стр = ДЗРеквизиты.Строки.Найти(ПланыВидовХарактеристик.ВидыРеквизитовКонтрагентов.ICE, "Реквизит", Истина);
			ТекущийОбъект.ICE = ?(Стр = Неопределено, "", СокрЛП(Стр.Представление));	
		КонецЕсли;
		Если РеквизитыОбъекта.Найти("CIN") <> Неопределено Тогда
			Стр = ДЗРеквизиты.Строки.Найти(ПланыВидовХарактеристик.ВидыРеквизитовКонтрагентов.CIN, "Реквизит", Истина);
			ТекущийОбъект.CIN = ?(Стр = Неопределено, "", СокрЛП(Стр.Представление));	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписиНаСервере(ТекущийОбъект, ДЗРеквизиты) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Контрагент = ТекущийОбъект.Ссылка; 
	Разделители = Новый Соответствие;
	НЗ = РегистрыСведений.РеквизитыКонтрагентов.СоздатьНаборЗаписей();
	НЗ.Отбор.Контрагент.Установить(Контрагент);
	Для Каждого СтрГруппа Из ДЗРеквизиты.Строки Цикл
		Для Каждого Стр Из СтрГруппа.Строки Цикл
			НС = НЗ.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Стр);
			НС.Контрагент = Контрагент;
			// Разделитель
			Если Стр.Реквизит.Множественный Тогда
				Разделитель = Разделители.Получить(Стр.Реквизит);
				НС.Разделитель = ?(Разделитель = Неопределено, 1, Разделитель + 1);
				Разделители.Вставить(Стр.Реквизит, НС.Разделитель);
			КонецЕсли;
		КонецЦикла;	
	КонецЦикла;	
	НЗ.Записать(Истина);		
КонецПроцедуры

Функция ЗаполнитьРеквизитыПоИННВФорме(Форма) Экспорт
	Результат = Новый Структура("Выполнено, ОписаниеОшибки", Ложь, "");
	ДЗРеквизиты = Форма.РеквизитФормыВЗначение("ДЗРеквизиты");
	СтрРодитель = ДЗРеквизиты.Строки.Найти(ПланыВидовХарактеристик.ВидыРеквизитовКонтрагентов.РегистрационныеДанные, "Реквизит", Ложь);
	Если СтрРодитель = Неопределено Тогда
		Результат.ОписаниеОшибки = "Не введён ИНН";	
		Возврат Результат;
	КонецЕсли;
	Стр = СтрРодитель.Строки.Найти(ПланыВидовХарактеристик.ВидыРеквизитовКонтрагентов.NIF, "Реквизит", Ложь);
	Если Стр = Неопределено Или ПустаяСтрока(Стр.Представление) Тогда
		Результат.ОписаниеОшибки = "Не введён ИНН";	
		Возврат Результат;
	КонецЕсли;
	NIF = Стр.Представление;
	Если СуществуетКонтрагентСУказаннымИНН(NIF, Форма.Объект.Ссылка) Тогда 
		Результат.ОписаниеОшибки = "Контрагент с таким ИНН уже существует";	
		Возврат Результат;				
	КонецЕсли;
	Данные = РегистрыСведений.РеквизитыКонтрагентов.ЗаполнитьРеквизитыПоИНН(Форма.Объект.Ссылка, NIF);	
	Если Данные.Установлены Тогда 		
		Результат.Выполнено = Истина;
		Объект = Форма.Объект;
		Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
			Объект.Наименование = Данные.Наименование;
		КонецЕсли;
		Объект.НаименованиеПолное = Данные.НаименованиеПолное;
		Объект.ВидКонтрагента = Данные.ВидКонтрагента;
	Иначе
		Результат.ОписаниеОшибки = Данные.Сообщение;
	КонецЕсли;
	Если Результат.Выполнено Тогда	
		Форма.ЗначениеВРеквизитФормы(РегистрыСведений.РеквизитыКонтрагентов.ПолучитьДеревоРеквизитовКонтрагента(Форма.Объект.Ссылка), "ДЗРеквизиты");
	КонецЕсли;
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область Дополнительно

Процедура СформироватьМассивУстановленныхРеквизитов(Мас, ДЗРеквизиты)
	Для Каждого Стр Из ДЗРеквизиты.Строки Цикл
		Если Стр.Реквизит.ЭтоГруппа Тогда
			СформироватьМассивУстановленныхРеквизитов(Мас, Стр);	
		Иначе
			Если Мас.Найти(Стр.Реквизит) = Неопределено Тогда
				Мас.Добавить(Стр.Реквизит);
			КонецЕсли;	
		КонецЕсли;		
	КонецЦикла;	
КонецПроцедуры	

Функция СуществуетКонтрагентСУказаннымИНН(NIF, ТекущийКонтрагент)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	РеквизитыКонтрагентовСрезПоследних.Контрагент КАК Контрагент
	                      |ИЗ
	                      |	РегистрСведений.РеквизитыКонтрагентов.СрезПоследних(
	                      |			,
	                      |			Реквизит = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.NIF)
	                      |				И Представление = &NIF) КАК РеквизитыКонтрагентовСрезПоследних
	                      |ГДЕ
	                      |	РеквизитыКонтрагентовСрезПоследних.Контрагент <> &ТекущийКонтрагент
	                      |	И ВЫБОР
	                      |			КОГДА ТИПЗНАЧЕНИЯ(&ТекущийКонтрагент) = ТИП(Справочник.Организации)
	                      |				ТОГДА РеквизитыКонтрагентовСрезПоследних.Контрагент ССЫЛКА Справочник.Организации
	                      |			КОГДА ТИПЗНАЧЕНИЯ(&ТекущийКонтрагент) = ТИП(Справочник.Контрагенты)
	                      |				ТОГДА РеквизитыКонтрагентовСрезПоследних.Контрагент ССЫЛКА Справочник.Контрагенты
	                      |			ИНАЧЕ ИСТИНА
	                      |		КОНЕЦ");
	Запрос.УстановитьПараметр("NIF", NIF);
	Запрос.УстановитьПараметр("ТекущийКонтрагент", ТекущийКонтрагент);
	Рез = Запрос.Выполнить();
	Возврат Не Рез.Пустой(); 	
КонецФункции

Функция СуществуетКонтрагентСУказаннымICE(ICE, ТекущийКонтрагент) Экспорт 
	Если Не ЗначениеЗаполнено(ICE) Тогда 
		Возврат Ложь;
	КонецЕсли;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	РеквизитыКонтрагентовСрезПоследних.Контрагент КАК Контрагент
	                      |ИЗ
	                      |	РегистрСведений.РеквизитыКонтрагентов.СрезПоследних(
	                      |			,
	                      |			Реквизит = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.ICE)
	                      |				И Представление = &ICE) КАК РеквизитыКонтрагентовСрезПоследних
	                      |ГДЕ
	                      |	РеквизитыКонтрагентовСрезПоследних.Контрагент <> &ТекущийКонтрагент
	                      |	И ВЫБОР
	                      |			КОГДА ТИПЗНАЧЕНИЯ(&ТекущийКонтрагент) = ТИП(Справочник.Организации)
	                      |				ТОГДА РеквизитыКонтрагентовСрезПоследних.Контрагент ССЫЛКА Справочник.Организации
	                      |			КОГДА ТИПЗНАЧЕНИЯ(&ТекущийКонтрагент) = ТИП(Справочник.Контрагенты)
	                      |				ТОГДА РеквизитыКонтрагентовСрезПоследних.Контрагент ССЫЛКА Справочник.Контрагенты
	                      |			ИНАЧЕ ИСТИНА
	                      |		КОНЕЦ");
	Запрос.УстановитьПараметр("ICE", ICE);
	Запрос.УстановитьПараметр("ТекущийКонтрагент", ТекущийКонтрагент);
	Рез = Запрос.Выполнить();
	Возврат Не Рез.Пустой(); 	
КонецФункции

#КонецОбласти
