
Функция ПолучитьПоНомеру(НомерСчёта, БИК, СчётОрганизации) Экспорт
	Результат = Новый Структура("Наименование, НомерСчёта, БанковскийСчёт, Владелец, Банк");
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	БанковскиеСчета.Наименование КАК Наименование,
	                      |	БанковскиеСчета.НомерСчёта КАК НомерСчёта,
	                      |	БанковскиеСчета.Ссылка КАК БанковскийСчёт,
	                      |	БанковскиеСчета.Владелец КАК Владелец,
	                      |	БанковскиеСчета.Банк КАК Банк,
	                      |	ВЫБОР
	                      |		КОГДА ТИПЗНАЧЕНИЯ(БанковскиеСчета.Владелец) = ТИП(Справочник.ФизическиеЛица)
	                      |			ТОГДА 1
	                      |		ИНАЧЕ 2
	                      |	КОНЕЦ КАК Порядок
	                      |ИЗ
	                      |	Справочник.БанковскиеСчета КАК БанковскиеСчета
	                      |ГДЕ
	                      |	БанковскиеСчета.НомерСчёта = &НомерСчёта
	                      |	И БанковскиеСчета.Банк.Код = &БИК
	                      |	И ВЫБОР
	                      |			КОГДА &СчётОрганизации
	                      |				ТОГДА БанковскиеСчета.Владелец ССЫЛКА Справочник.Организации
	                      |			ИНАЧЕ НЕ БанковскиеСчета.Владелец ССЫЛКА Справочник.Организации
	                      |		КОНЕЦ
	                      |	И БанковскиеСчета.ПометкаУдаления = ЛОЖЬ
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Порядок");
	Запрос.УстановитьПараметр("НомерСчёта", НомерСчёта);
	Запрос.УстановитьПараметр("БИК", БИК);
	Запрос.УстановитьПараметр("СчётОрганизации", СчётОрганизации);
	Рез = Запрос.Выполнить();
	Если Не Рез.Пустой() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Рез.Выгрузить()[0]);
	КонецЕсли;	
	Возврат Результат;
КонецФункции

Функция ПолучитьПоНомеруДляВладельца(НомерСчёта, Владелец) Экспорт
	Результат = Новый Структура("Наименование, НомерСчёта, БанковскийСчёт, Владелец, Банк");
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	БанковскиеСчета.Наименование КАК Наименование,
	                      |	БанковскиеСчета.НомерСчёта КАК НомерСчёта,
	                      |	БанковскиеСчета.Ссылка КАК БанковскийСчёт,
	                      |	БанковскиеСчета.Владелец КАК Владелец,
	                      |	БанковскиеСчета.Банк КАК Банк
	                      |ИЗ
	                      |	Справочник.БанковскиеСчета КАК БанковскиеСчета
	                      |ГДЕ
	                      |	БанковскиеСчета.НомерСчёта = &НомерСчёта
	                      |	И БанковскиеСчета.Владелец = &Владелец
	                      |	И БанковскиеСчета.ПометкаУдаления = ЛОЖЬ");
	Запрос.УстановитьПараметр("НомерСчёта", НомерСчёта);
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Выб = Запрос.Выполнить().Выбрать();
	Пока Выб.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Результат, Выб);	
	КонецЦикла;	
	Возврат Результат;
КонецФункции

Функция ПолучитьОсновной(Владелец) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	БанковскиеСчета.Ссылка КАК Ссылка,
	                      |	БанковскиеСчета.Основной КАК Основной
	                      |ИЗ
	                      |	Справочник.БанковскиеСчета КАК БанковскиеСчета
	                      |ГДЕ
	                      |	БанковскиеСчета.Владелец = &Владелец
	                      |	И БанковскиеСчета.ПометкаУдаления = ЛОЖЬ
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Основной УБЫВ");
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Рез = Запрос.Выполнить();
	Возврат ?(Рез.Пустой(), Справочники.БанковскиеСчета.ПустаяСсылка(), Рез.Выгрузить()[0].Ссылка);
КонецФункции	

Функция СформироватьПредставлениеДляПечати(БанковскийСчёт) Экспорт
	Возврат "р/с " + СокрЛП(БанковскийСчёт.НомерСчёта) +
		" в банке " + СокрЛП(БанковскийСчёт.Банк) +
		" БИК " + СокрЛП(БанковскийСчёт.Банк.Код) +
		" к/с " + СокрЛП(БанковскийСчёт.Банк.КоррСчёт);	
КонецФункции