
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Период = ТекущаяДата();
	ПараметрыОтчёта = Новый Структура("Период", Период);
	ОтборОтчёта = Новый Структура("Номенклатура", ПараметрКоманды);
	ПользовательскиеНастройки = ОбщегоНазначенияВызовСервера.УстановитьНастройкиОтчёта("ТоварыВНаличии", ПараметрыОтчёта, ОтборОтчёта);	
	П = Новый Структура("ПользовательскиеНастройки, СформироватьПриОткрытии", ПользовательскиеНастройки, Истина);
	ОткрытьФорму("Отчет.ТоварыВНаличии.ФормаОбъекта", П);
КонецПроцедуры
