
#Область Печать

Процедура ПечатьПриходныйКассовыйОрдер(Док, Таб) Экспорт
	Таб.ТолькоПросмотр = Истина;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ОтображатьСетку = Ложь;
	Таб.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	Таб.АвтоМасштаб = Истина;
	Таб.КлючПараметровПечати = "Параметры_печати_Документ_ПриходныйКассовыйОрдер_ПриходныйКассовыйОрдер";
	КарточкаОрганизации = Справочники.Контрагенты.ПолучитьКарточку(Док.Организация, Док.Дата);
	Валюта = Справочники.Валюты.MoroccanDirham;
	Макет = Документы.ПриходныйКассовыйОрдер.ПолучитьМакет("ПриходныйКассовыйОрдер");	
	оШапка = Макет.ПолучитьОбласть("Шапка");
	оШапка.Параметры.ПредставлениеОрганизации = КарточкаОрганизации.Наименование;
	//оШапка.Параметры.ОрганизацияПоОКПО = КарточкаОрганизации.ОКПО;
	оШапка.Параметры.НомерДокумента = РаботаСДокументами.СформироватьЦифровойНомер(Док.Номер);
	оШапка.Параметры.ДатаДокумента = Формат(Док.Дата, "ДЛФ=DD");
	оШапка.Параметры.КодДебета = "50.01";
	оШапка.Параметры.Сумма = Док.Сумма;
	оШапка.Параметры.СуммаРубКоп = Док.Сумма;
	оШапка.Параметры.СуммаПрописью = Справочники.Валюты.СформироватьСуммуПрописью(Док.Сумма, Валюта, Перечисления.Локализации.fr_CA);
	оШапка.Параметры.ПринятоОт = Док.ПринятоОт;
	оШапка.Параметры.Основание = Док.ОснованиеДляПечати;
	оШапка.Параметры.Приложение = Док.Приложение;
	оШапка.Параметры.ВТомЧисле = Док.ВТомЧислеНДС;
	оШапка.Параметры.ФИОГлавногоБухгалтера = КарточкаОрганизации.ГлавныйБухгалтер.ДляПечати;
	оШапка.Параметры.ФИОКассира = Справочники.ФизическиеЛица.СформироватьПредставлениеДляПечати(Док.Кассир);
	Таб.Вывести(оШапка);
	Таб.ВывестиГоризонтальныйРазделительСтраниц();
КонецПроцедуры

Function ПечатьЧека(Док, Spreadsheet) Export
	Template = Документы.ПриходныйКассовыйОрдер.ПолучитьМакет("Ticket");
	
	Header = Template.GetArea("Шапка");
	
	Header.Parameters.Fill(Док);
	
	FieldPhoto = Док.Организация.Логотип.Get();
	Try
		Header.Drawings[0].Picture = New Picture(FieldPhoto);
	Except
	EndTry;
	
	Header.Parameters.КонтрагентЗаголовок = ?(ЗначениеЗаполнено(Док.Контрагент), НСтр("fr = 'Payeur'; ru = 'Плательщик'; en = 'The payer'; es = 'Pagador'"), "");
	Header.Parameters.Контрагент = ?(ЗначениеЗаполнено(Док.Контрагент), Док.Контрагент, "");

	Spreadsheet.Put(Header);
	
	Spreadsheet.PutHorizontalPageBreak();
	
	Return Spreadsheet;
	
	//}}
EndFunction

#КонецОбласти