 
#Область Обработчики_событий_формы 
 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТЗОбъектыРасчётов.Загрузить(РаботаСДокументами.ПолучитьЗадолженностьДляОплаты(Параметры));
	Для Каждого Док Из Параметры.ВыбранныеДокументы Цикл
		Мас = ТЗОбъектыРасчётов.НайтиСтроки(Новый Структура("ОбъектРасчётов", Док));
		Для А = 1 - Мас.Количество() По 0 Цикл
			ТЗОбъектыРасчётов.Удалить(Мас[-А]);	
		КонецЦикла;	
	КонецЦикла;	
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура Подтвердить(Команда)
	Результат = Новый Массив;
	Мас = ТЗОбъектыРасчётов.НайтиСтроки(Новый Структура("Отметка", Истина));
	Для Каждого Стр Из Мас Цикл
		Результат.Добавить(Новый Структура("ОбъектРасчётов, Сумма", Стр.ОбъектРасчётов, Стр.Сумма));
	КонецЦикла;
	Закрыть(Результат);
КонецПроцедуры

&НаКлиенте
Процедура ТЗОбъектыРасчётовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле = Элементы.ТЗОбъектыРасчётовОбъектРасчётов Или Поле = Элементы.ТЗОбъектыРасчётовСумма Тогда
		СтандартнаяОбработка = Ложь;
		Стр = ТЗОбъектыРасчётов.НайтиПоИдентификатору(ВыбраннаяСтрока);
		ПоказатьЗначение(, Стр.ОбъектРасчётов);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТЗОбъектыРасчётовПриИзменении(Элемент)
	СуммаВыбранных = 0;
	Мас = ТЗОбъектыРасчётов.НайтиСтроки(Новый Структура("Отметка", Истина));
	Для Каждого Стр Из Мас Цикл
		СуммаВыбранных = СуммаВыбранных + Стр.Сумма;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

