
&НаКлиенте
Процедура Подтвердить(Команда)
	Если ПроверитьЗаполнение() Тогда
		Чек = СоздатьЧекНаСервере();
		Если ЗначениеЗаполнено(Чек) Тогда 
			Закрыть(Новый Структура("Чек,СуммаЧека",Чек,СуммаЧека));
		Иначе
			ОбщегоНазначенияКлиент.ВывестиИнформациюДляРМКУправляемой("", Нстр("fr = ""Erreur lors de la création du chèque. Contactez l'administrateur !""; ru = 'Ошибка создания чека. Обратитесь к администратору!'; en = 'Error creating the receipt. Contact the administrator!'; es = 'Error al generar el cheque. ¡Póngase en contacto con el administrador!'"));
			Элементы.СтраницыИнформации.ТекущаяСтраница = Элементы.СтраницаИнформации;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СоздатьЧекНаСервере()
	Чек = Справочники.БанковскиеЧеки.СоздатьЭлемент();
	Чек.Банк = Банк;
	Чек.ВладелецЧека = ВладелецЧека;
	Чек.ДатаЧека = ДатаЧека;
	Чек.Наименование = НомерЧека;
	Чек.СрокЧека = СрокЧека;
	Чек.СуммаЧека = СуммаЧека;
	Чек.Организация = Организация;
	Чек.Комментарий = Комментарий;
	Чек.ВидЧека = ВидЧека;
	Чек.Тип = Перечисления.ВидыДокументов.Полученный;
	Попытка 
		Чек.Записать();
	Исключение
		Возврат Справочники.БанковскиеЧеки.ПустаяСсылка();
	КонецПопытки;
	Возврат Чек.Ссылка;
КонецФункции
