
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	РаботаСДокументами.ЗаполнитьРеквизитыПоУмолчанию(ЭтотОбъект);
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		Контрагент = ДанныеЗаполнения.Контрагент;
		Договор = ДанныеЗаполнения.Договор; 
		Организация = ДанныеЗаполнения.Организация;
		ЦенаВключаетНДС = ДанныеЗаполнения.ЦенаВключаетНДС; 
		Для Каждого Стр Из ДанныеЗаполнения.ТЧТовары Цикл
			НС = ТЧТовары.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Стр, "Номенклатура, Характеристика");			
			НС.ДокументПартии = ДанныеЗаполнения;
			НС.СуммаТовара = Стр.СуммаСНДС;
		КонецЦикла;	
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	УстановитьПривилегированныйРежим(Истина);
	РаботаСДокументами.УстановитьЗаписьВсехРегистров(Движения);
	// Блокировки
	Блокировка = Новый БлокировкаДанных;
	УправляемыеБлокировки.ДополнительныеРасходы(Блокировка, ТЧТовары);
	УправляемыеБлокировки.ВзаиморасчётыСПоставщиками(Блокировка, Контрагент);
	Блокировка.Заблокировать();		
	// Формируем
	РегистрыНакопления.ДополнительныеРасходы.РаспределитьНаСебестоимость(ЭтотОбъект);
	РегистрыНакопления.ВзаиморасчётыСПоставщиками.СформироватьДвижения(ЭтотОбъект);
	// Записываем
	Движения.Записать();
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = ПараметрыСеанса.Пользователь;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	РаботаСДокументами.МожноРедактироватьДокумент(ЭтотОбъект, Отказ);
КонецПроцедуры

