
&НаКлиенте
Процедура СделатьОсновным(Команда)
	ТекСтр = Элементы.Список.ТекущиеДанные;
	Если ТекСтр = Неопределено Тогда Возврат КонецЕсли;
	СделатьОсновнымНаСервере(ТекСтр.Ссылка);
	ОповеститьОбИзменении(Тип("СправочникСсылка.БанковскиеСчета"));
КонецПроцедуры

&НаСервере
Процедура СделатьОсновнымНаСервере(ОсновнойСчёт)
	НачатьТранзакцию();
	Попытка
		Счёт = ОсновнойСчёт.ПолучитьОбъект();
		Счёт.Основной = Не Счёт.Основной;
		Счёт.Записать();
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	БанковскиеСчета.Ссылка КАК Ссылка
		                      |ИЗ
		                      |	Справочник.БанковскиеСчета КАК БанковскиеСчета
		                      |ГДЕ
		                      |	БанковскиеСчета.Владелец = &Контрагент
		                      |	И БанковскиеСчета.Ссылка <> &ОсновнойСчёт");
		Запрос.УстановитьПараметр("Контрагент", ОсновнойСчёт.Владелец);
		Запрос.УстановитьПараметр("ОсновнойСчёт", ОсновнойСчёт);
		Выб = Запрос.Выполнить().Выбрать();
		Пока Выб.Следующий() Цикл
			Счёт = Выб.Ссылка.ПолучитьОбъект();
			Счёт.Основной = Ложь;
			Счёт.Записать();
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Сообщить(Нстр("fr = 'Impossible de faire le principal'; ru = 'Не удалось сделать основным'; en = ""Couldn't make it basic""; es = 'No se puede hacer principal'"), СтатусСообщения.ОченьВажное);
		ВызватьИсключение;	
	КонецПопытки;
КонецПроцедуры
