

#Область Обработчики_событий_формы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьРеквизитов(Неопределено);
КонецПроцедуры

#КонецОбласти
		
#Область Дополнительно

&НаКлиенте
Процедура УстановитьВидимостьРеквизитов(Элемент)
	//Элементы.ТЧАнализПродажСотрудники.Видимость = Объект.АнализПродажВариант = ПредопределенноеЗначение("Перечисление.ВариантыАнализаПоказателей.ПоСотрудникам");	
	//Элементы.ТЧАнализПродажПодразделения.Видимость = Объект.АнализПродажВариант = ПредопределенноеЗначение("Перечисление.ВариантыАнализаПоказателей.ПоПодразделениям");
	//Элементы.ГруппаОграничения.Доступность = Объект.АнализПродажАнализировать;
	Элементы.ГруппаАнализПродажЛевая.Видимость = Объект.АнализПродажАнализировать;
	//Элементы.ТЧКоэффициентыПремии.Доступность = Объект.АнализПродажАнализировать;
	//Элементы.ПоОтработаннымДням.Доступность = Не Объект.АнализПродажАнализировать;
КонецПроцедуры	

#КонецОбласти


