
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.НаименованиеПолное = СокрЛП(Объект.ВидДокумента);
	Если ЗначениеЗаполнено(Объект.Номер) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(Объект.НаименованиеПолное, "№ " + СокрЛП(Объект.Номер), ", ");
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ДатаВыдачи) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(Объект.НаименованиеПолное, "выдан: " + Формат(Объект.ДатаВыдачи, "ДЛФ=DD"), ", ");
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.КемВыдан) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(Объект.НаименованиеПолное, СокрЛП(Объект.КемВыдан), ", ");
	КонецЕсли;
	Объект.Наименование = Объект.НаименованиеПолное;
КонецПроцедуры
