
&НаКлиенте
Перем ЗакрытиеФормы;

#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РаботаСДокументами.МожноРедактироватьДокументВФорме(Объект.Ссылка, ЭтаФорма);   
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыФункциональныхОпций(ЭтаФорма);
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//РассчитатьДолиСтоимости();
	ТЧСерииПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//Если Не Объект.КоличествоУпаковок = Объект.ТЧСерии.Итог("КоличествоУпаковок") и Не Объект.ТЧСерии.Количество() = 0 Тогда 
	//	Отказ = Истина;
	//	ПоказатьПредупреждение(,"Количество списываемого товара не соответствует количеству серий!",10);
	//	Возврат;
	//КонецЕсли;
	//Если ЗакрытиеФормы = Неопределено Тогда
	//	Если Не ВесСоответствуетИсходному() Тогда
	//		Отказ = Истина;
	//		Оп = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОНесоответствииВеса", ЭтаФорма, ПараметрыЗаписи);
	//		РаботаСДокументамиКлиент.ПоказатьВопросОПроверкеДокумента(Оп, "Вес разбора не соответствует исходному");
	//	КонецЕсли;
	//КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить(РаботаСДокументами.СвойствоЗаписьИзФормы(), Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	//РассчитатьДолиСтоимости();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ПоказатьСебестоимость();
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, ТекущийОбъект);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПоказатьСебестоимость();
КонецПроцедуры

#КонецОбласти



#Область Оповещения

&НаКлиенте
Процедура ПослеЗакрытияВопросаОНесоответствииВеса(РезультатЗакрытия, ПараметрыЗаписи) Экспорт
	Если РезультатЗакрытия = Неопределено Или РезультатЗакрытия = КодВозвратаДиалога.Отмена Тогда Возврат КонецЕсли;
	ЗакрытиеФормы = Истина;
	ЭтаФорма.Записать(ПараметрыЗаписи);
	ЭтаФорма.Закрыть();
КонецПроцедуры	

#КонецОбласти





#Область Дополнительные_процедуры_и_функции

&НаКлиенте
Процедура РассчитатьКоличество()
	Структура = Новый Структура("КоличествоУпаковок, Количество, Упаковка", Объект.КоличествоУпаковок, Объект.Количество, Объект.Упаковка);
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Структура);
	Объект.Количество = Структура.Количество;	
КонецПроцедуры	

&НаСервере
Процедура РассчитатьДолиСтоимости(РассчитатьДоли = Ложь)
	//Если РассчитатьДоли Тогда
	//	Для Каждого Стр Из Объект.ТЧТовары Цикл
	//		Стр.ДоляСтоимости = ?(Стр.Характеристика.ДляВнутреннегоИспользования, 0, Стр.Количество * ?(Стр.Цена = 0, 1, Стр.Цена));
	//	КонецЦикла;	
	//КонецЕсли;	
	//ДоляВсего = Объект.ТЧТовары.Итог("ДоляСтоимости"); 	
	//Если ДоляВсего = 0 Тогда Возврат КонецЕсли;		
	//ПроцентВсего = 0;
	//КолСтрокДляРасчета = Объект.ТЧТовары.Количество() - Объект.ТЧТовары.НайтиСтроки(Новый Структура("ДоляСтоимости",0)).Количество();
	//НомерТекСтроки = 0;
	//Для Каждого Стр Из Объект.ТЧТовары Цикл
	//	Если Стр.ДоляСтоимости = 0 Тогда Продолжить; КонецЕсли;
	//	НомерТекСтроки = НомерТекСтроки + 1;
	//	Стр.ДоляСтоимостиПроцент = ?(НомерТекСтроки = КолСтрокДляРасчета, 100 - ПроцентВсего, Стр.ДоляСтоимости / ДоляВсего * 100);
	//	ПроцентВсего = ПроцентВсего + Стр.ДоляСтоимостиПроцент;
	//КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура УстановитьЦенуНоменклатуры()
	//УстановитьПривилегированныйРежим(Истина);
	//ТекСтр = Объект.ТЧТовары.НайтиПоИдентификатору(Элементы.ТЧТовары.ТекущаяСтрока);
	//Результат = РегистрыСведений.ПланируемыеЦеныЗакупки.ПолучитьПоследнее(Объект.Дата, Новый Структура("Номенклатура, Характеристика", ТекСтр.Номенклатура, ТекСтр.Характеристика));
	//ТекСтр.Цена = Результат.Цена;
КонецПроцедуры	

&НаСервере
Функция ВесСоответствуетИсходному()
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВЫРАЗИТЬ(ТЗ.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	                      |	ВЫРАЗИТЬ(ТЗ.Количество КАК ЧИСЛО) КАК Количество
	                      |ПОМЕСТИТЬ ВТ
	                      |ИЗ
	                      |	&ТЗ КАК ТЗ
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ.Номенклатура КАК Номенклатура,
	                      |	ВТ.Количество * ВЫБОР
	                      |		КОГДА ВТ.Номенклатура.Единица.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес)
	                      |			ТОГДА ВТ.Номенклатура.Единица.Числитель / ВТ.Номенклатура.Единица.Знаменатель
	                      |		ИНАЧЕ ВТ.Номенклатура.ВесЗнаменатель
	                      |	КОНЕЦ КАК Вес
	                      |ИЗ
	                      |	ВТ КАК ВТ");
	Запрос.УстановитьПараметр("ТЗ", Объект.ТЧТовары.Выгрузить());
	ТЗ = Запрос.Выполнить().Выгрузить();	
	Единица = Объект.Номенклатура.Единица;
	Если Единица.ТипИзмеряемойВеличины = Перечисления.ТипыИзмеряемыхВеличин.Вес Тогда
		Коэффициент = Единица.Числитель / Единица.Знаменатель; 
	Иначе	
		Коэффициент = Объект.Номенклатура.ВесЗнаменатель;	
	КонецЕсли;
	Возврат Объект.Количество * Коэффициент = ТЗ.Итог("Вес");	
КонецФункции

&НаСервере
Процедура ПоказатьСебестоимость()
	ТЗСебестоимость = РегистрыНакопления.ТоварыВНаличии.ПолучитьСебестоимостьПоДокументу(Объект.Ссылка);
	Для Каждого Стр Из Объект.ТЧТовары Цикл
		Если Стр.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда Продолжить; КонецЕсли;
		Мас = ТЗСебестоимость.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Серия, ВидДвижения", Стр.Номенклатура, Стр.Характеристика, Стр.Серия, ВидДвиженияНакопления.Расход));
		Если Мас.Количество() = 0 Тогда
			Стр.Себестоимость = 0;	
		Иначе
			Стр.Себестоимость = ?(Мас[0].Количество = Стр.Количество, Мас[0].Сумма, Мас[0].Сумма / Мас[0].Количество * Стр.Количество);	
		КонецЕсли;	
	КонецЦикла;
	ОбщаяСебестоимость = ТЗСебестоимость.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	Объект.Упаковка = ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(Объект.Номенклатура, "Единица");
    ЗаполнитьТехкарту();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТехкартуНаСервере()
	ТЗ = Объект.Номенклатура.ТехнологическаяКарта.Выгрузить(); 
	ТЗ.Колонки.Количество.Имя = "КоличествоЗаЕдиницу";
	
	Объект.ТЧТовары.Загрузить(ТЗ); 
	
	Для Каждого СтрокаТЧ Из Объект.ТЧТовары Цикл
		СтрокаТЧ.КодСтроки = РаботаСДокументамиКлиентСервер.ПолучитьСледующийКодСтроки(Объект.ТЧТовары);	
		СтрокаТЧ.КоличествоУпаковок = Объект.КоличествоУпаковок * СтрокаТЧ.КоличествоЗаЕдиницу;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТехкарту(Команда = Неопределено) 
	
	ЗаполнитьТехкартуНаСервере();
	
	Для Каждого СтрокаТЧ Из Объект.ТЧТовары Цикл
		УстановитьЦенуНоменклатуры(); 
		РаботаСДокументамиКлиентСервер.РассчитатьСтроку(СтрокаТЧ);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти      




#Область Обработчики_элементов_формы 

 &НаКлиенте
Процедура МестоХраненияПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыФункциональныхОпций(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыФункциональныхОпций(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	//ПараметрыПолученияДанных.Вставить("ВыводитьСерию",Истина);
	//РаботаСДокументамиКлиент.АвтоподборНоменклатуры(ДанныеВыбора, ПараметрыПолученияДанных, Объект, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	//РаботаСДокументамиКлиент.ОбрабокаВыбораПриАвтоподбореНоменклатуры(Объект, ВыбранноеЗначение, Объект, СтандартнаяОбработка);
	//Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
	//	Объект.ТЧСерии.Очистить();
	//	Если ЗначениеЗаполнено(ВыбранноеЗначение.Серия) Тогда
	//		НС = Объект.ТЧСерии.Добавить();
	//		НС.Серия =ВыбранноеЗначение.Серия;
	//	КонецЕсли;
	//	ТЧСерииПриИзменении(Неопределено);
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КоличествоУпаковокПриИзменении(Элемент)
	РассчитатьКоличество();	
КонецПроцедуры

&НаКлиенте
Процедура УпаковкаПриИзменении(Элемент)
	РассчитатьКоличество();
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекСтр = Элемент.ТекущиеДанные;
		ТекСтр.КодСтроки = РаботаСДокументамиКлиентСервер.ПолучитьСледующийКодСтроки(Объект.ТЧТовары);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	//РассчитатьДолиСтоимости(Элемент.ТекущийЭлемент <> Элементы.ТЧТоварыСтоимость);
КонецПроцедуры 

&НаКлиенте
Процедура ТЧТоварыПослеУдаления(Элемент)
	//РассчитатьДолиСтоимости();
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	//ПараметрыПолученияДанных.Вставить("ВыводитьСерию",Истина);
	//РаботаСДокументамиКлиент.АвтоподборНоменклатуры(ДанныеВыбора, ПараметрыПолученияДанных, Объект, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	//РаботаСДокументамиКлиент.ОбрабокаВыбораПриАвтоподбореНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, ВыбранноеЗначение, Объект, СтандартнаяОбработка);
	//УстановитьЦенуНоменклатуры();
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураПриИзменении(Элемент)
	УстановитьЦенуНоменклатуры();
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыХарактеристикаПриИзменении(Элемент)
	УстановитьЦенуНоменклатуры();
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыКоличествоУпаковокПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьКоличество(Элементы.ТЧТовары.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыУпаковкаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТЧСерииСерияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекСтр = Элементы.ТЧСерии.ТекущиеДанные;
	ДанныеОтбора = Новый Структура("МестоХранения, Номенклатура, Характеристика", Объект.МестоХранения, Объект.Номенклатура, Объект.Характеристика);
	СерииИРазмещениеКлиент.ВыбратьСериюПоОстаткам(РаботаСДокументамиВызовСервера.ПолучитьГраницуДокумента(Объект), ДанныеОтбора,, ТекСтр);
КонецПроцедуры

&НаКлиенте
Процедура ТЧСерииКоличествоУпаковокПриИзменении(Элемент)
	ТекСтр = Элементы.ТЧСерии.ТекущиеДанные;
	Структура = Новый Структура("КоличествоУпаковок, Количество, Упаковка", ТекСтр.КоличествоУпаковок, ТекСтр.Количество, Объект.Упаковка);
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Структура);
	ТекСтр.Количество = Структура.Количество;	
КонецПроцедуры

&НаКлиенте
Процедура ТЧСерииПриИзменении(Элемент)
	СерииВТЧ = Не Объект.ТЧСерии.Количество() = 0;
	Элементы.КоличествоУпаковок.Доступность = Не СерииВТЧ;
	Если СерииВТЧ Тогда 
		Объект.КоличествоУпаковок = Объект.ТЧСерии.Итог("КоличествоУпаковок");
		Объект.Количество = Объект.ТЧСерии.Итог("Количество");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти // Обработчики_элементов_формы

