
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	УстановитьПривилегированныйРежим(Истина);
	// Получим пользователя
	ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Пользователи.Ссылка КАК Пользователь
	                      |ИЗ
	                      |	Справочник.Пользователи КАК Пользователи
	                      |ГДЕ
	                      |	Пользователи.ИдентификаторПользователяИБ = &ИдентификаторПользователяИБ
	                      |	И Пользователи.ВходВПрограммуРазрешен = ИСТИНА");
	Запрос.УстановитьПараметр("ИдентификаторПользователяИБ", ПользовательИБ.УникальныйИдентификатор);
	Рез = Запрос.Выполнить();
	ПараметрыСеанса.Пользователь = ?(Рез.Пустой(), Справочники.Пользователи.ПустаяСсылка(), Рез.Выгрузить()[0].Пользователь);
	ПараметрыСеанса.РабочееМестоКлиента = Справочники.РабочиеМеста.ПустаяСсылка();
	// Инициализируем пустые
	ПараметрыСеанса.ПараметрыКлиентаНаСервере = Новый ФиксированнаяСтруктура(Новый Структура("ЭтоМобильныйКлиент,ЭтоВебКлиент",Ложь,Ложь));
	СтруктураПараметрыПользователя =  Новый Структура("Сотрудник,Организация,Должность,ГрафикРаботы");
	ПараметрыСеанса.ПараметрыПользователя = Новый ФиксированнаяСтруктура(СтруктураПараметрыПользователя);  
	
	// Контрагент  
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	Контрагент.Ссылка КАК Контрагент
		                      |ИЗ
		                      |	Справочник.Контрагенты КАК Контрагент
		                      |ГДЕ
		                      |	Контрагент.Пользователь = &Пользователь");
		Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.Пользователь);
		Рез = Запрос.Выполнить();
		ПараметрыСеанса.Контрагент = ?(Рез.Пустой(), Справочники.Контрагенты.ПустаяСсылка(), Рез.Выгрузить()[0].Контрагент);

	// Заполняем нужные
	Если ЗначениеЗаполнено(ПараметрыСеанса.Пользователь) Тогда
		ДанныеСотрудника = РегистрыСведений.ТарифныеСтавки.ПолучитьДанныеСотрудника(ПараметрыСеанса.Пользователь.ФизическоеЛицо, ТекущаяДата());
		ЗаполнитьЗначенияСвойств(СтруктураПараметрыПользователя, ДанныеСотрудника);
		ПараметрыСеанса.ПараметрыПользователя = Новый ФиксированнаяСтруктура(СтруктураПараметрыПользователя);
		ПараметрыСеанса.ФизическоеЛицо = ПараметрыСеанса.Пользователь.ФизическоеЛицо;
	Иначе
		ПараметрыСеанса.ПараметрыПользователя = Новый ФиксированнаяСтруктура(СтруктураПараметрыПользователя);
		ПараметрыСеанса.ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка();
	КонецЕсли;
	// обмен с сайтом
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОбменССайтомТоварами.Ссылка КАК Ссылка
	               |ИЗ
	               |	ПланОбмена.ОбменССайтомТоварами КАК ОбменССайтомТоварами
	               |ГДЕ
	               |	(ОбменССайтомТоварами.Ссылка <> &ЭтотУзел)	
				   |";
				   
	Запрос.УстановитьПараметр("ЭтотУзел", ПланыОбмена.ОбменССайтомТоварами.ЭтотУзел());
	МассивУзловДляОбменаССайтомТоварами = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	ПараметрыСеанса.ВсеУзлыДляОбменаССайтомТоварами = Новый ФиксированныйМассив(МассивУзловДляОбменаССайтомТоварами);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОбменССайтомЗаказами.Ссылка КАК Ссылка
	               |ИЗ
	               |	ПланОбмена.ОбменССайтомЗаказами КАК ОбменССайтомЗаказами
	               |ГДЕ
	               |	(ОбменССайтомЗаказами.Ссылка <> &ЭтотУзел)	
				   |";
				   
	Запрос.УстановитьПараметр("ЭтотУзел", ПланыОбмена.ОбменССайтомЗаказами.ЭтотУзел());
	МассивУзловДляОбменаССайтомЗаказами = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	ПараметрыСеанса.ВсеУзлыДляОбменаССайтомЗаказами = Новый ФиксированныйМассив(МассивУзловДляОбменаССайтомЗаказами);	

КонецПроцедуры

