#Область ОбработчикиСобытий

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ДанныеВыбора = Новый СписокЗначений;
	
	ДоступныеТипыОборудования = МенеджерОборудованияВызовСервераПереопределяемый.ПолучитьДоступныеТипыОборудования();
	ИндексЭлемента = ДоступныеТипыОборудования.Найти(Перечисления.ТипыПодключаемогоОборудования.УдалитьWebСервисОборудование);
	Если НЕ ИндексЭлемента = Неопределено Тогда
		ДоступныеТипыОборудования.Удалить(ИндексЭлемента);
	КонецЕсли;
	
	ДанныеВыбора.ЗагрузитьЗначения(ДоступныеТипыОборудования);
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецЕсли

#КонецОбласти