
Процедура СформироватьДвижения(ДокОбъект) Экспорт
	Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ОприходованиеТоваров") Тогда
		Контрагент = Справочники.Контрагенты.ПустаяСсылка();	
	Иначе	
		Если Не ОбщегоНазначенияВызовСервераПовтИсп.ЭтоРасчётыСПоставщиками(ДокОбъект.ХозяйственнаяОперация) Тогда Возврат КонецЕсли;
		Контрагент = ДокОбъект.Контрагент;
		Если Контрагент.СвояКомпания Тогда Возврат; КонецЕсли;
	КонецЕсли;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПоступлениеТоваровУслугТЧТовары.НоменклатураКонтрагента КАК НоменклатураКонтрагента,
	                      |	ПоступлениеТоваровУслугТЧТовары.Номенклатура КАК Номенклатура,
	                      |	ПоступлениеТоваровУслугТЧТовары.Характеристика КАК Характеристика,
	                      |	ПоступлениеТоваровУслугТЧТовары.Упаковка КАК Упаковка,
	                      |	ПоступлениеТоваровУслугТЧТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	                      |	ПоступлениеТоваровУслугТЧТовары.СуммаСНДС * ВЫБОР
	                      |		КОГДА ПоступлениеТоваровУслугТЧТовары.Ссылка.Валюта = &ВалютаРегл
	                      |			ТОГДА 1
	                      |		ИНАЧЕ ПоступлениеТоваровУслугТЧТовары.Ссылка.КурсВалюты
	                      |	КОНЕЦ КАК Сумма
	                      |ПОМЕСТИТЬ ВТ
	                      |ИЗ
	                      |	Документ.ПоступлениеТоваровУслуг.ТЧТовары КАК ПоступлениеТоваровУслугТЧТовары
	                      |ГДЕ
	                      |	ПоступлениеТоваровУслугТЧТовары.Ссылка = &Ссылка
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ЗНАЧЕНИЕ(Справочник.НоменклатураКонтрагентов.ПустаяСсылка),
	                      |	ОприходованиеТоваровТЧТовары.Номенклатура,
	                      |	ОприходованиеТоваровТЧТовары.Характеристика,
	                      |	ОприходованиеТоваровТЧТовары.Упаковка,
	                      |	ОприходованиеТоваровТЧТовары.КоличествоУпаковок,
	                      |	ОприходованиеТоваровТЧТовары.Сумма
	                      |ИЗ
	                      |	Документ.ОприходованиеТоваров.ТЧТовары КАК ОприходованиеТоваровТЧТовары
	                      |ГДЕ
	                      |	ОприходованиеТоваровТЧТовары.Ссылка = &Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	&Период КАК Период,
	                      |	&Контрагент КАК Контрагент,
	                      |	ВЗ.НоменклатураКонтрагента КАК НоменклатураКонтрагента,
	                      |	ВЗ.Номенклатура КАК Номенклатура,
	                      |	ВЗ.Характеристика КАК Характеристика,
	                      |	ВЗ.Упаковка КАК Упаковка,
	                      |	ВЗ.Цена КАК Цена,
	                      |	ВЗ.Цена / ВЫБОР
	                      |		КОГДА ВЗ.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	                      |			ТОГДА 1
	                      |		ИНАЧЕ ВЗ.Упаковка.Числитель / ВЗ.Упаковка.Знаменатель
	                      |	КОНЕЦ КАК ЦенаЕдиницыХранения
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		ВТ.НоменклатураКонтрагента КАК НоменклатураКонтрагента,
	                      |		ВТ.Номенклатура КАК Номенклатура,
	                      |		ВТ.Характеристика КАК Характеристика,
	                      |		ВТ.Упаковка КАК Упаковка,
	                      |		СРЕДНЕЕ(ВТ.Сумма / ВТ.КоличествоУпаковок) КАК Цена
	                      |	ИЗ
	                      |		ВТ КАК ВТ
	                      |	ГДЕ
	                      |		ВТ.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	                      |	
	                      |	СГРУППИРОВАТЬ ПО
	                      |		ВТ.НоменклатураКонтрагента,
	                      |		ВТ.Номенклатура,
	                      |		ВТ.Характеристика,
	                      |		ВТ.Упаковка) КАК ВЗ");
	Запрос.УстановитьПараметр("Ссылка", ДокОбъект.Ссылка);
	Запрос.УстановитьПараметр("Период", ДокОбъект.Дата);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ВалютаРегл", Константы.ВалютаРегламентированногоУчета.Получить());
   	ДокОбъект.Движения.ЦеныНоменклатурыПоставщиков.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

Функция ПоследнийПрайс(ДатаЦен, Номенклатура, Контрагент = Неопределено) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЦеныНоменклатурыПоставщиковСрезПоследних.Период КАК Период,
	                      |	ЦеныНоменклатурыПоставщиковСрезПоследних.Контрагент КАК Контрагент,
	                      |	ЦеныНоменклатурыПоставщиковСрезПоследних.Номенклатура КАК Номенклатура,
	                      |	ЦеныНоменклатурыПоставщиковСрезПоследних.Характеристика КАК Характеристика,
	                      |	ЦеныНоменклатурыПоставщиковСрезПоследних.НоменклатураКонтрагента КАК НоменклатураКонтрагента,
	                      |	ЦеныНоменклатурыПоставщиковСрезПоследних.ЦенаЕдиницыХранения КАК Цена
	                      |ПОМЕСТИТЬ ВТЦеныПоставщиков
	                      |ИЗ
	                      |	РегистрСведений.ЦеныНоменклатурыПоставщиков.СрезПоследних(
	                      |			&ДатаЦен,
	                      |			Номенклатура В (&Номенклатура)
	                      |				И ВЫБОР
	                      |					КОГДА &Контрагент = НЕОПРЕДЕЛЕНО
	                      |						ТОГДА ИСТИНА
	                      |					ИНАЧЕ Контрагент = &Контрагент
	                      |				КОНЕЦ) КАК ЦеныНоменклатурыПоставщиковСрезПоследних
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТЦеныПоставщиков.Контрагент КАК Контрагент,
	                      |	ВТЦеныПоставщиков.Номенклатура КАК Номенклатура,
	                      |	ВТЦеныПоставщиков.Характеристика КАК Характеристика,
	                      |	ВТЦеныПоставщиков.НоменклатураКонтрагента КАК НоменклатураКонтрагента,
	                      |	ВТЦеныПоставщиков.Цена КАК Цена,
	                      |	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) КАК Упаковка
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		ВТЦеныПоставщиков.Номенклатура КАК Номенклатура,
	                      |		ВТЦеныПоставщиков.Характеристика КАК Характеристика,
	                      |		ВТЦеныПоставщиков.Период КАК Период,
	                      |		МАКСИМУМ(ВТЦеныПоставщиков.Контрагент) КАК Контрагент
	                      |	ИЗ
	                      |		(ВЫБРАТЬ
	                      |			ВТЦеныПоставщиков.Номенклатура КАК Номенклатура,
	                      |			ВТЦеныПоставщиков.Характеристика КАК Характеристика,
	                      |			МАКСИМУМ(ВТЦеныПоставщиков.Период) КАК Период
	                      |		ИЗ
	                      |			ВТЦеныПоставщиков КАК ВТЦеныПоставщиков
	                      |		
	                      |		СГРУППИРОВАТЬ ПО
	                      |			ВТЦеныПоставщиков.Номенклатура,
	                      |			ВТЦеныПоставщиков.Характеристика) КАК ВЗ
	                      |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЦеныПоставщиков КАК ВТЦеныПоставщиков
	                      |			ПО ВЗ.Номенклатура = ВТЦеныПоставщиков.Номенклатура
	                      |				И ВЗ.Характеристика = ВТЦеныПоставщиков.Характеристика
	                      |				И ВЗ.Период = ВТЦеныПоставщиков.Период
	                      |	
	                      |	СГРУППИРОВАТЬ ПО
	                      |		ВТЦеныПоставщиков.Номенклатура,
	                      |		ВТЦеныПоставщиков.Характеристика,
	                      |		ВТЦеныПоставщиков.Период) КАК ВЗ
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЦеныПоставщиков КАК ВТЦеныПоставщиков
	                      |		ПО ВЗ.Номенклатура = ВТЦеныПоставщиков.Номенклатура
	                      |			И ВЗ.Характеристика = ВТЦеныПоставщиков.Характеристика
	                      |			И ВЗ.Период = ВТЦеныПоставщиков.Период
	                      |			И ВЗ.Контрагент = ВТЦеныПоставщиков.Контрагент");
	Запрос.УстановитьПараметр("ДатаЦен", ДатаЦен);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
