
Процедура СформироватьДвижения(ДокОбъект) Экспорт
	Движения = ДокОбъект.Движения;  
	ХО = Перечисления.ХозяйственныеОперации;
	Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПоступлениеТоваровУслуг") Тогда
		Если ДокОбъект.Контрагент = Справочники.Контрагенты.Migration тогда Возврат; КонецЕсли;
		//Запрос = Новый Запрос("ВЫБРАТЬ
		//                      |	ТЧУслуги.Ссылка.Дата КАК Период,
		//                      |	ТЧУслуги.Ссылка.Организация КАК Организация,
		//                      |	ТЧУслуги.СтатьяДДС КАК СтатьяДДС,
		//                      |	СУММА(ТЧУслуги.СуммаСНДС) КАК Сумма
		//                      |ИЗ
		//                      |	Документ.ПоступлениеТоваровУслуг.ТЧУслуги КАК ТЧУслуги
		//                      |ГДЕ
		//                      |	ТЧУслуги.Ссылка = &Док
		//                      |	И ТЧУслуги.СтатьяДДС <> ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
		//                      |
		//                      |СГРУППИРОВАТЬ ПО
		//                      |	ТЧУслуги.СтатьяДДС,
		//                      |	ТЧУслуги.Ссылка.Дата,
		//                      |	ТЧУслуги.Ссылка.Организация");
		//Запрос.УстановитьПараметр("Док", ДокОбъект.Ссылка);
		//ДокОбъект.Движения.Убытки.Загрузить(Запрос.Выполнить().Выгрузить());
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ВозвратПоставщику") Тогда	
		//ТЗ = ДокОбъект.Движения.ДополнительныеРасходы.Выгрузить();
		//ТЗ.Свернуть("СтатьяДДС", "Сумма");
		//Для Каждого Стр Из ТЗ Цикл
		//	СформироватьДвижение(Движения, ДокОбъект.Дата, ДокОбъект.Организация, Стр.СтатьяДДС, Стр.Сумма);	
		//КонецЦикла;
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.СписаниеТоваров") Тогда	
		//ТЗПартии = Движения.ТоварыВНаличии.Выгрузить();
		//ТЗДополнительныеРасходы = Движения.ДополнительныеРасходы.Выгрузить();
		//СформироватьДвижение(Движения, ДокОбъект.Дата, ДокОбъект.Организация, ДокОбъект.СтатьяДДС, ТЗПартии.Итог("Сумма") + ТЗДополнительныеРасходы.Итог("Сумма"));
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПересортицаТоваров") Тогда
		//СуммаУбытков = ДокОбъект.ДополнительныеСвойства.Убытки;
		//СформироватьДвижение(Движения, ДокОбъект.Дата, ДокОбъект.Организация, Справочники.СтатьиДвиженияДенежныхСредств.ПересортицаТоваров, СуммаУбытков);  
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.СписаниеБезналичныхДенежныхСредств") Или ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.РасходныйКассовыйОрдер") Тогда		
		Если Не ОбщегоНазначенияВызовСервераПовтИсп.ЭтоПрочееДДС(ДокОбъект.ХозяйственнаяОперация) 
			И Не ОбщегоНазначенияВызовСервераПовтИсп.ЭтоРасчётыСФизическимиЛицами(ДокОбъект.ХозяйственнаяОперация) Тогда Возврат КонецЕсли;
		Если ДокОбъект.СтатьяДДС = Справочники.СтатьиДвиженияДенежныхСредств.ВыемкаИзКассы Тогда Возврат; КонецЕсли;
		СформироватьДвижение(Движения, ДокОбъект.Дата, ДокОбъект.Организация, ДокОбъект.СтатьяДДС, ДокОбъект.МестоХранения, ДокОбъект.ХозяйственнаяОперация, ДокОбъект.Сумма);
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.УценкаТоваров") Тогда
		//ТЗДополнительныеРасходы = Движения.ДополнительныеРасходы.Выгрузить();
		//СтатьяДДС = Справочники.СтатьиДвиженияДенежныхСредств.УценкаТоваров;
		//СформироватьДвижение(Движения, ДокОбъект.Дата, ДокОбъект.Организация, СтатьяДДС, - ТЗДополнительныеРасходы.Итог("Сумма"));
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПрочиеРасходы") Тогда
		Для Каждого Стр Из ДокОбъект.ТЧРасходы Цикл
			СформироватьДвижение(Движения, ДокОбъект.Дата, ДокОбъект.Организация, Стр.СтатьяДДС, ДокОбъект.МестоХранения, ДокОбъект.ХозяйственнаяОперация, Стр.Сумма);	
		КонецЦикла;
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПрочиеРасходыВозврат") Тогда
		Для Каждого Стр Из ДокОбъект.ТЧРасходы Цикл
			СформироватьДвижение(Движения, ДокОбъект.Дата, ДокОбъект.Организация, Стр.СтатьяДДС, ДокОбъект.МестоХранения, ДокОбъект.ХозяйственнаяОперация, - Стр.Сумма);	
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

Процедура СформироватьДвижение(Движения, Период, Организация, СтатьяДДС, МестоХранения, ХозяйственнаяОперация, Сумма)
	Если Сумма = 0 Тогда Возврат КонецЕсли;
	НС = Движения.Убытки.Добавить();		
	НС.Период = Период;
	НС.Организация = Организация;
	НС.СтатьяДДС = СтатьяДДС;
	НС.ХозяйственнаяОперация = ХозяйственнаяОперация;
	НС.МестоХранения = МестоХранения;
	НС.Сумма = Сумма;	
КонецПроцедуры

Функция СформироватьТаблицуПрибылейИУбытков(Знач НачалоПериода, Знач КонецПериода) Экспорт
	НачалоПериода = ?(ЗначениеЗаполнено(НачалоПериода), НачалоПериода, Дата(2000,1,1));
	КонецПериода = ?(ЗначениеЗаполнено(КонецПериода), КонецПериода, Дата(2100,12,31));
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Месяц", Новый ОписаниеТипов("Дата"));
	ТЗ.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТЗ.Колонки.Добавить("Группа", Новый ОписаниеТипов("Строка"));
	ТЗ.Колонки.Добавить("Показатель", Новый ОписаниеТипов("Строка"));
	ТЗ.Колонки.Добавить("Регистратор");	
	ТЗ.Колонки.Добавить("Порядок", Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("Сумма", Метаданные.ОпределяемыеТипы.Сумма.Тип);
	ТЗ.Колонки.Добавить("СуммаПрибыль", Метаданные.ОпределяемыеТипы.Сумма.Тип);
	// Получим прибыль и убытки
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПродажиОбороты.Организация КАК Организация,
	                      |	ПродажиОбороты.СебестоимостьОборот КАК Себестоимость,
	                      |	ПродажиОбороты.ВыручкаОборот КАК Выручка,
	                      |	ПродажиОбороты.ВаловаяПрибыльОборот КАК ВаловаяПрибыль,
	                      |	ПродажиОбороты.Регистратор КАК Регистратор,
	                      |	ПродажиОбороты.ПериодМесяц КАК Период
	                      |ИЗ
	                      |	РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, Авто, ) КАК ПродажиОбороты
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	УбыткиОбороты.Организация КАК Организация,
	                      |	УбыткиОбороты.СтатьяДДС.ВидУбытков КАК ВидУбытков,
	                      |	УбыткиОбороты.СтатьяДДС КАК СтатьяДДС,
	                      |	УбыткиОбороты.СуммаОборот КАК Сумма,
	                      |	УбыткиОбороты.Регистратор КАК Регистратор,
	                      |	УбыткиОбороты.ПериодМесяц КАК Период
	                      |ИЗ
	                      |	РегистрНакопления.Убытки.Обороты(&НачалоПериода, &КонецПериода, Авто, ) КАК УбыткиОбороты");
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Рез = Запрос.ВыполнитьПакет();	
	// Прибыль
	Выб = Рез[0].Выбрать();
	Пока Выб.Следующий() Цикл
		ДобавитьПоказатель(ТЗ, Выб.Период, Выб.Организация, "Доход", "Выручка", Выб.Регистратор, 1, Выб.Выручка);
		ДобавитьПоказатель(ТЗ, Выб.Период, Выб.Организация, "Доход", "Себестоимость", Выб.Регистратор, 2, Выб.Себестоимость);
		ДобавитьПоказатель(ТЗ, Выб.Период, Выб.Организация, "Доход", "Валовый доход", Выб.Регистратор, 3, Выб.ВаловаяПрибыль, Выб.ВаловаяПрибыль);
	КонецЦикла;
	// Убытки
	ТЗУбытки = Рез[1].Выгрузить();
	Мас = ТЗУбытки.НайтиСтроки(Новый Структура("ВидУбытков", Перечисления.ВидыУбытков.ОперационныеЗатраты));
	Для А = 1 - Мас.Количество() По 0 Цикл
		Стр = Мас[-А];
		ДобавитьПоказатель(ТЗ, Стр.Период, Стр.Организация, "Операционные затраты", СокрЛП(Стр.СтатьяДДС), Стр.Регистратор, 4, Стр.Сумма, -Стр.Сумма);
		ТЗУбытки.Удалить(Стр);
	КонецЦикла;
	// EBITDA
	ТЗИтог = ТЗ.Скопировать();
	ТЗИтог.Свернуть("Месяц, Организация", "СуммаПрибыль");
	Для Каждого Стр Из ТЗИтог Цикл
		ДобавитьПоказатель(ТЗ, Стр.Месяц, Стр.Организация, "Итог", "EBITDA", Неопределено, 10, Стр.СуммаПрибыль);	
	КонецЦикла;	
	// Получим отчисления
	Для А = 1 - ТЗУбытки.Количество() По 0 Цикл
		Стр = ТЗУбытки[-А];
		ДобавитьПоказатель(ТЗ, Стр.Период, Стр.Организация, "Отчисления", СокрЛП(Стр.СтатьяДДС), Стр.Регистратор, 6, Стр.Сумма, -Стр.Сумма);
	КонецЦикла;
	// Чистая прибыль
	ТЗИтог = ТЗ.Скопировать();
	ТЗИтог.Свернуть("Месяц, Организация", "СуммаПрибыль");
	Для Каждого Стр Из ТЗИтог Цикл
		ДобавитьПоказатель(ТЗ, Стр.Месяц, Стр.Организация, "Итог", "Чистая Прибыль", Неопределено, 10, Стр.СуммаПрибыль);	
	КонецЦикла;
	ТЗ.Колонки.Удалить("СуммаПрибыль");
	Возврат ТЗ;
КонецФункции

Процедура ДобавитьПоказатель(ТЗ, Дата, Организация, Группа, Показатель, Регистратор, Порядок, Сумма, СуммаПрибыль = 0)
	НС = ТЗ.Добавить();
	НС.Месяц = НачалоМесяца(Дата);
	НС.Организация = Организация;
	НС.Группа = Группа;
	НС.Показатель = Показатель;
	НС.Регистратор = Регистратор;
	НС.Порядок = Порядок;
	НС.Сумма = Сумма;
	НС.СуммаПрибыль = СуммаПрибыль;
КонецПроцедуры
