
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Дата = ТекущаяДатаСеанса();
	РаботаСДокументами.ЗаполнитьРеквизитыПоУмолчанию(ЭтотОбъект);
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда 
		ТЧЦены.Загрузить(ДанныеЗаполнения.ТЧТовары.Выгрузить());
		//Для Каждого Стр из ДанныеЗаполнения.ТЧТовары Цикл
		//	НС = ТЧЦены.Добавить();
		//	НС.Номенклатура = Стр.Номенклатура;
		//	НС.Упаковка = Стр.Упаковка;
		//	НС.Характеристика = Стр.Характеристика;
		//	ПроцентНДС = ОбщегоНазначенияВызовСервераПовтИсп.ПроцентСтавкиНДС(Стр.СтавкаНДС);
		//	НС.ЦенаЗакупочная = ?(Стр.КоличествоУпаковок = 0, Стр.Цена, Стр.СуммаСНДС/Стр.КоличествоУпаковок);
		//КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	УстановитьПривилегированныйРежим(Истина);
	РаботаСДокументами.УстановитьЗаписьВсехРегистров(Движения);
	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.УстановкаЦенНоменклатуры Тогда 
		ТЗ = ТЧЦены.Выгрузить();
		ТЗ.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
		ТЗ.ЗаполнитьЗначения(Дата, "Период"); 
		ТЗ.Колонки.Добавить("ВидЦены", Новый ОписаниеТипов("СправочникСсылка.ВидыЦен"));
		ТЗ.ЗаполнитьЗначения(ВидЦены, "ВидЦены");
		ТЗ.Колонки.Добавить("ТоварнаяГруппа", Новый ОписаниеТипов("СправочникСсылка.ТоварныеГруппы"));
		//ТЗ.ЗаполнитьЗначения(ТоварнаяГруппа, "ТоварнаяГруппа");
		Для Каждого Стр из ТЗ Цикл 
			Стр.ТоварнаяГруппа = Стр.Номенклатура.ТоварнаяГруппа;
		КонецЦикла;
		Движения.ЦеныНоменклатуры.Загрузить(ТЗ);
	Иначе
		Для Каждого Стр Из ТЧЦены Цикл
			НС = Движения.ПланируемыеЦеныЗакупки.Добавить();
			НС.Период = ЭтотОбъект.Дата;
			НС.Номенклатура = Стр.Номенклатура;
			НС.Характеристика = Стр.Характеристика;
			НС.Цена = Стр.Цена;
			НС.НаправлениеИзмененияЦен = Стр.НаправлениеИзмененияЦен;
		КонецЦикла;
	КонецЕсли;
	Движения.Записать();
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Дата = ТекущаяДатаСеанса();
	Комментарий = "";
	Ответственный = ПараметрыСеанса.Пользователь;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
КонецПроцедуры
