
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, Объект);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить(РаботаСДокументами.СвойствоЗаписьИзФормы(), Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.Сумма = Объект.ТЧСотрудники.Итог("Сумма");
	СтрокаУжеРассчитанныхСотрудников = СтрокаУжеРассчитанныхСотрудников();
	Если Не СтрокаУжеРассчитанныхСотрудников = "" Тогда
		Отказ = Истина;
		ПоказатьПредупреждение(,СтрокаУжеРассчитанныхСотрудников);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, ТекущийОбъект);
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТЧСотрудникиРассчитатьИтог(Элемент)
	ТекСтр = Элементы.ТЧСотрудники.ТекущиеДанные;
	ТекСтр.Сумма = ТекСтр.Оклад + ТекСтр.Премия + ТекСтр.Прочее;
КонецПроцедуры

#КонецОбласти

#Область Дополнительно

&НаСервере
Процедура ЗаполнитьНаСервере()
	Объект.ТЧСотрудники.Очистить();
	МасСотрудники = РегистрыСведений.ТарифныеСтавки.ПолучитьВсехСотрудников(Объект.Дата, Объект.МестоХранения);	
	КэшРасчета = РегистрыНакопления.Зарплата.НовыйКэшРасчетаПремий();
	Для Каждого Сотрудник Из МасСотрудники Цикл 
		ДанныеЗарплаты = РегистрыНакопления.Зарплата.РассчитатьПоСотруднику(Сотрудник, Объект.Дата, КэшРасчета);
		НС = Объект.ТЧСотрудники.Добавить();
		НС.Сотрудник = Сотрудник;
		НС.Оклад = ДанныеЗарплаты.Оклад.Сумма;
		НС.Премия = ДанныеЗарплаты.Премия.Сумма;
		НС.Прочее = ДанныеЗарплаты.Прочее.ВсегоНачислено - ДанныеЗарплаты.Прочее.ВсегоУдержано;
		НС.Сумма = ДанныеЗарплаты.Итого;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция СтрокаУжеРассчитанныхСотрудников() 
	СтрокаУжеРассчитанныхСотрудников = "";
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НачислениеЗарплатыТЧСотрудники.Сотрудник КАК Сотрудник
	|ИЗ
	|	Документ.НачислениеЗарплаты.ТЧСотрудники КАК НачислениеЗарплатыТЧСотрудники
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(НачислениеЗарплатыТЧСотрудники.Ссылка.Дата, МЕСЯЦ) = &Дата
	|	И НачислениеЗарплатыТЧСотрудники.Сотрудник В(&МасСотрудников)
	|	И НЕ НачислениеЗарплатыТЧСотрудники.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НачислениеЗарплатыТЧСотрудники.Сотрудник.Наименование";
	Запрос.УстановитьПараметр("Дата",НачалоМесяца(Объект.Дата));
	запрос.УстановитьПараметр("МасСотрудников",Объект.ТЧСотрудники.Выгрузить().ВыгрузитьКолонку("Сотрудник"));
	Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Ном = 1;
	Пока Выборка.Следующий() Цикл
		Если СтрокаУжеРассчитанныхСотрудников = "" Тогда
			СтрокаУжеРассчитанныхСотрудников = Нстр("fr = 'Les employés suivants ont déjà un calcul de salaire:'; ru = 'По следующим сотрудникам уже есть расчет зарплаты:'; en = 'There is already a salary calculation for the following employees:'; es = 'Para los siguientes empleados ya hay un cálculo salarial:'") + Символы.ПС;
		Иначе
			СтрокаУжеРассчитанныхСотрудников = СтрокаУжеРассчитанныхСотрудников + Символы.ПС;
		КонецЕсли;
		Если Ном = 6 Тогда 
			СтрокаУжеРассчитанныхСотрудников = СтрокаУжеРассчитанныхСотрудников + Нстр("fr = 'et autres'; ru = 'и другие'; en = 'and others'; es = 'y otros'");
			Прервать;
		КонецЕсли;
		СтрокаУжеРассчитанныхСотрудников = СтрокаУжеРассчитанныхСотрудников + Выборка.Сотрудник;
		Ном = Ном + 1;
	КонецЦикла;
	Возврат СтрокаУжеРассчитанныхСотрудников;
КонецФункции

#КонецОбласти
