
&НаКлиенте
Процедура СделатьОсновной(Команда)
	ТекСтр = Элементы.Список.ТекущиеДанные;
	Если ТекСтр = Неопределено Тогда Возврат КонецЕсли;
	СделатьОсновнойНаСервере(ТекСтр.Ссылка);
	ОповеститьОбИзменении(Тип("СправочникСсылка.Кассы"));
КонецПроцедуры

&НаСервере
Процедура СделатьОсновнойНаСервере(ОсновнаяКасса)
	НачатьТранзакцию();
	Попытка
		Касса = ОсновнаяКасса.ПолучитьОбъект();
		Касса.Основная = Не Касса.Основная;
		Касса.Записать();
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	Кассы.Ссылка КАК Ссылка
		                      |ИЗ
		                      |	Справочник.Кассы КАК Кассы
		                      |ГДЕ
		                      |	Кассы.Владелец = &Организация
		                      |	И Кассы.Ссылка <> &ОсновнаяКасса");
		Запрос.УстановитьПараметр("Организация", ОсновнаяКасса.Владелец);
		Запрос.УстановитьПараметр("ОсновнаяКасса", ОсновнаяКасса);
		Выб = Запрос.Выполнить().Выбрать();
		Пока Выб.Следующий() Цикл
			Касса = Выб.Ссылка.ПолучитьОбъект();
			Касса.Основная = Ложь;
			Касса.Записать();
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Сообщить(Нстр("fr = 'Impossible de faire le principal'; ru = 'Не удалось сделать основным'; en = ""Couldn't make it basic""; es = 'No se puede hacer principal'"), СтатусСообщения.ОченьВажное);
		ВызватьИсключение;	
	КонецПопытки;
КонецПроцедуры