
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Ссылка = Параметры.Ссылка;	
	ДатаДокумента = Параметры.ДатаДокумента;
	Организация = Параметры.Организация;	
	Производитель = Параметры.Производитель;
	Клиент = Параметры.Клиент;
	МестоХранения = Параметры.МестоХранения;	
	Номенклатура = Параметры.Номенклатура;	
	Характеристика = Параметры.Характеристика;	
	Упаковка = ?(ЗначениеЗаполнено(Параметры.Упаковка), Параметры.Упаковка, Номенклатура.Единица);
	Количество = Параметры.Количество;	
	ВсеСерии = Параметры.ВсеСерии;
	Для Каждого Стр Из Параметры.МасСерии Цикл
		НС = ТЗСерии.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Стр);
	КонецЦикла;
	ЭтоСписание = ТипЗнч(Ссылка) <> Тип("ДокументСсылка.ПоступлениеТоваровУслуг") и
				  ТипЗнч(Ссылка) <> Тип("ДокументСсылка.ОприходованиеТоваров");
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыФункциональныхОпций(ЭтаФорма);
	Заголовок = ОбщегоНазначенияКлиентСервер.ПредставлениеНоменклатуры(Номенклатура, Характеристика) + "; " + Количество + " " + Упаковка + "";
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПроверитьКорректностьДанных();
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура ТЗСерииПриИзменении(Элемент)
	ПроверитьКорректностьДанных();
КонецПроцедуры

&НаКлиенте
Процедура ТЗСерииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле = Элементы.ТЗСерииСерия Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьЗначение(, ТЗСерии.НайтиПоИдентификатору(ВыбраннаяСтрока).Серия); 
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Подтвердить(Команда)
	Если Не ПроверитьКорректностьДанных() Тогда
		ПоказатьПредупреждение(, Нстр("fr = 'Les données saisies sont incorrectes'; ru = 'Введённые данные некорректны'; en = 'The entered data is incorrect'; es = 'Los datos introducidos son incorrectos'"),, "Ошибка");
		Возврат;
	КонецЕсли;
	Результат = СерииИРазмещениеКлиент.ПодготовитьМассивСерий(ТЗСерии);
	Закрыть(Результат);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСерию(Команда)
	Если Количество - ТЗСерии.Итог("Количество") = 0 Тогда
		ПоказатьПредупреждение(, Нстр("fr = 'Séries par quantité déjà sélectionnées'; ru = 'Серии по количеству уже подобраны'; en = 'The series have already been selected by number'; es = 'Las Series por número ya han sido seleccionadas'"),, "Внимание");
		Возврат;	
	КонецЕсли;
	Оп = Новый ОписаниеОповещения("ПослеЗакрытияФормыВыбораСерии", ЭтаФорма);
	Если ЭтоСписание Тогда
		ДанныеОтбора = Новый Структура("Организация, МестоХранения, Номенклатура, Характеристика", Организация, МестоХранения, Номенклатура, Характеристика); 
		ДанныеОтбора.Вставить("Производитель", ?(ЗначениеЗаполнено(Производитель), Производитель, ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка")));
		ДанныеОтбора.Вставить("Клиент", Клиент);		
		ДанныеОтбора.Вставить("ВсеСерии", ВсеСерии);		
		СерииИРазмещениеКлиент.ВыбратьСериюПоОстаткам(ДатаДокумента - 1, ДанныеОтбора, Оп);
	Иначе
		П = Новый Структура;
		ДанныеОтбора = Новый Структура;
		Если ЗначениеЗаполнено(Производитель) Тогда
			ДанныеОтбора.Вставить("Производитель", Производитель);
		КонецЕсли;
		Если ЗначениеЗаполнено(Клиент) Тогда
			ДанныеОтбора.Вставить("Клиент", Клиент);
		КонецЕсли;
		Если ДанныеОтбора.Количество() > 0 Тогда
			П.Вставить("Отбор", ДанныеОтбора);	
		КонецЕсли;	
		ОткрытьФорму("Справочник.СерииНоменклатуры.ФормаВыбора", П, ЭтаФорма,,,, Оп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);			
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПустую(Команда)
	КоличествоДобавления = Количество - ТЗСерии.Итог("Количество");
	Если КоличествоДобавления <= 0 Тогда Возврат КонецЕсли;
	НС = ТЗСерии.Добавить();
	НС.Количество = КоличествоДобавления;
	ПроверитьКорректностьДанных();
КонецПроцедуры

#КонецОбласти

#Область Оповещения

&НаКлиенте
Процедура ПослеЗакрытияФормыВыбораСерии(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если РезультатЗакрытия = Неопределено Тогда Возврат КонецЕсли;
	Если ТипЗнч(РезультатЗакрытия) = Тип("Структура") Тогда 
		ВыбСерия = РезультатЗакрытия.Серия;
		ВыбКоличество = РезультатЗакрытия.Количество;
	Иначе
		ВыбСерия = РезультатЗакрытия;
		ВыбКоличество = Количество;
	КонецЕсли;
	Если ТЗСерии.НайтиСтроки(Новый Структура("Серия", РезультатЗакрытия)).Количество() > 0 Тогда
		ПоказатьПредупреждение(, Нстр("fr = 'La série sélectionnée est déjà indiquée'; ru = 'Выбранная серия уже указана'; en = 'The selected series has already been specified'; es = 'La serie seleccionada ya está especificada'"),, "Внимание");
		Возврат;
	КонецЕсли;	
	ДобавляемоеКоличество = ?(ВыбКоличество > Количество, Количество, ВыбКоличество);
	ДобавляемоеКоличество = ДобавляемоеКоличество - ТЗСерии.Итог("Количество");	
	НС = ТЗСерии.Добавить();
	НС.Серия = ВыбСерия;
	НС.Количество = ДобавляемоеКоличество;
	ПроверитьКорректностьДанных();
КонецПроцедуры

#КонецОбласти

#Область Дополнительно

&НаКлиенте
Функция ПроверитьКорректностьДанных()
	СерииВерны = ТЗСерии.Итог("Количество") = Количество и ТЗСерии.НайтиСтроки(Новый Структура("Количество", 0)).Количество() = 0;	
	Элементы.НадписьОшибка.Видимость = Не СерииВерны;
	Возврат СерииВерны;
КонецФункции

#КонецОбласти
