#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Проверки = БухгалтерскиеОтчетыВызовСервера.СтандартныеПроверкиЗаполнения();
	Проверки.Вставить("СписокВидовСубконто", Истина);
	
	БухгалтерскиеОтчетыВызовСервера.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, Проверки);
	
	Если СписокВидовСубконто.Количество() > 0
	   И Не ЗначениеЗаполнено(СписокВидовСубконто[0].Значение) Тогда
	   
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("fr = 'Le champ ""Type de subconto"" n''est pas renseigné.'; ru = 'Поле ""Вид субконто"" не заполнено.'; en = 'The ""Subconto view"" field is not filled in.'; es = 'El campo vista subconto no está completo.'"), , "ВидСубконто", , Отказ);
			
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли