
&НаКлиенте
Перем ЗакрытиеФормы;

#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	РаботаСДокументами.МожноРедактироватьДокументВФорме(Объект.Ссылка, ЭтаФорма); 
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыФункциональныхОпций(ЭтаФорма);
	Если Объект.Ссылка.Пустая() Тогда 
		УстановитьВидЦеныПоДоговору();
	иначе
		Если Объект.ВидЦен.Пустая() Тогда 
			УстановитьВидЦеныПоДоговору();
		Иначе
			ВидЦены = Объект.ВидЦен;
			РаботаСДокументамиКлиентСервер.ЗаполнитьСписокВыбораВидовЦен(ВидЦены, Элементы.ТЧТоварыВидЦены);
		КонецЕсли;
	КонецЕсли;
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, Объект);
	ЕстьПравоЗаверениеЦен = РегистрыСведений.НастройкиПользователей.ЗаверениеЦен();
	ЗаполнитьСрокОплатыНаСервере();
	НастроитьФорму();
	Если ЕстьПравоЗаверениеЦен Тогда
		ЗаполнитьПоследниеЦены();
	КонецЕсли;
	ЗаполнитьОстаткиНаСервере();    
	ЗаполнитьСуммыОплатыДолга();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОперацииСПодключаемымОборудованиемКлиент.ПодключитьОборудование(УникальныйИдентификатор, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Отказ = РаботаСДокументамиКлиент.КлиентуЗапрещеноОтгружать(Объект);
	Если Отказ Тогда Возврат; КонецЕсли;
	Объект.Сумма = Объект.ТЧТовары.Итог("СуммаСНДС")+Объект.ТЧУслуги.Итог("СуммаСНДС");
	Объект.СуммаНДС = Объект.ТЧТовары.Итог("СуммаНДС")+Объект.ТЧУслуги.Итог("СуммаНДС");
	Отказ = Не СерииИРазмещениеКлиент.ПроверитьСоответствиеСерийТоварам(ЭтаФорма, Объект.ТЧТовары, Объект.ТЧСерии, ПараметрыЗаписи);
	РаботаСДокументамиКлиент.ПроверитьСуммуАвансовТоварногоДокумента(Объект, Отказ);
	Объект.ВидЦен = ВидЦены;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить(РаботаСДокументами.СвойствоЗаписьИзФормы(), Истина);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, ТекущийОбъект);
	Если ЕстьПравоЗаверениеЦен Тогда
		ЗаполнитьПоследниеЦены();
	КонецЕсли;
	ЗаполнитьСрокОплатыНаСервере();
	ЗаполнитьОстаткиНаСервере();
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	РаботаСДокументамиКлиент.ЗаполнитьДанныеПоТорговойТочке(Объект, ВидЦены, Элементы.ТЧТоварыВидЦены);	
	//УстановитьЦеныНаСервере();
	УстановитьВидЦеныПоДоговору();
	ЗаполнитьСрокОплатыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыФункциональныхОпций(ЭтаФорма);
	Объект.Договор = ОбщегоНазначенияВызовСервера.ПолучитьОсновнойДоговор(Объект.Контрагент, Объект.Организация, Истина);
	Объект.Менеджер = РаботаСДокументамиВызовСервера.ПолучитьКуратораДоговора(Объект.Договор, Объект.Дата).Менеджер;
	УстановитьВидЦеныПоДоговору();
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	Объект.Менеджер = РаботаСДокументамиВызовСервера.ПолучитьКуратораДоговора(Объект.Договор, Объект.Дата).Менеджер;
	УстановитьВидЦеныПоДоговору();
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьЦены(Команда)
	УстановитьЦеныНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьЦеныПоЗаказу(Команда)
	ПерезаполнитьЦеныПоЗаказуНаСервере();
	Для Каждого Стр Из Объект.ТЧТовары Цикл
		РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Стр, Истина);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УказатьСерии(Команда)
	СерииИРазмещениеКлиент.УказатьСерии(Элементы.ТЧТовары.ТекущиеДанные, Объект);
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьСерии(Команда)
	ЗаполнитьСерииНаСервере();
КонецПроцедуры  

&НаКлиенте
Процедура МестоХраненияПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыФункциональныхОпций(ЭтаФорма);
	ЗаполнитьОстаткиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвансыПоСуммеДокумента(Команда)
	ЗаполнитьПоОстаткамНаСервере(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвансыВсеНезакрытые(Команда)
	ЗаполнитьПоОстаткамНаСервере(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ТЧЗачётАвансовОснованиеПриИзменении(Элемент)
	ТекСтр = Элементы.ТЧЗачётАвансов.ТекущиеДанные;
	ДанныеСуммы = РаботаСДокументамиВызовСервера.ПолучитьСуммуОснованияДляПлатёжногоДокумента(ТекСтр.Основание);
	ЗаполнитьЗначенияСвойств(ТекСтр, ДанныеСуммы);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекСтр = Элемент.ТекущиеДанные;
		ТекСтр.КодСтроки = РаботаСДокументамиКлиентСервер.ПолучитьСледующийКодСтроки(Объект.ТЧТовары);
		ТекСтр.ВидЦены = ВидЦены;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	РаботаСДокументамиКлиент.ПроверитьКратностьЕдиницы(Элемент.ТекущиеДанные, Объект, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПередУдалением(Элемент, Отказ)
	Для Каждого Инд Из Элементы.ТЧТовары.ВыделенныеСтроки Цикл
		Стр = Объект.ТЧТовары.НайтиПоИдентификатору(Инд);
		РаботаСДокументамиКлиентСервер.УдалитьСвязанныеСтроки(Объект, "ТЧСерии", Стр.КодСтроки);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПриАктивизацииЯчейки(Элемент)
	ТекСтр = Элемент.ТекущиеДанные;
	Если ТекСтр = Неопределено Тогда Возврат КонецЕсли;
	Если Элемент.ТекущийЭлемент = Элементы.ТЧТоварыКоличество Тогда
		Элемент.ТекущийЭлемент.ТолькоПросмотр = Не ЗначениеЗаполнено(ТекСтр.Упаковка);	
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект);
КонецПроцедуры 

&НаКлиенте
Процедура ТЧТоварыНоменклатураАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ПараметрыАвтоподбора = РаботаСДокументамиКлиент.ПараметрыАвтободбораНоменклатуры();
	ПараметрыАвтоподбора.ВидЦены = ВидЦены;
	ПараметрыАвтоподбора.ИсключитьХарактеристикиДляВнутреннегоИспользования = Истина;
	ПараметрыПолученияДанных.Вставить("ВыводитьСерию",Истина);
	РаботаСДокументамиКлиент.АвтоподборНоменклатуры(ДанныеВыбора, ПараметрыПолученияДанных, Объект, СтандартнаяОбработка, ПараметрыАвтоподбора);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	РаботаСДокументамиКлиент.ОбрабокаВыбораПриАвтоподбореНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, ВыбранноеЗначение, Объект, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыХарактеристикаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыУпаковкаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСерияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекСтр = Элементы.ТЧТовары.ТекущиеДанные;
	ДанныеОтбора = Новый Структура("МестоХранения, Номенклатура, Характеристика, Клиент", Объект.МестоХранения, ТекСтр.Номенклатура, ТекСтр.Характеристика, Объект.Контрагент); 
	СерииИРазмещениеКлиент.ВыбратьСериюПоОстаткам(РаботаСДокументамиВызовСервера.ПолучитьГраницуДокумента(Объект), ДанныеОтбора,, ТекСтр);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыКоличествоУпаковокПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыКоличествоПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Истина, "Количество");
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыВидЦеныПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьЦенуНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыЦенаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Истина, "Цена");
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСуммаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Истина, "Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПроцентСкидкиПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСуммаСкидкиПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Истина, "Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСтавкаНДСПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСуммаНДСПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Истина, "СуммаНДС");
КонецПроцедуры

&НаКлиенте
Процедура ТЧУслугиКоличествоПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧУслуги.ТекущиеДанные, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ТЧУслугиЦенаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧУслуги.ТекущиеДанные, Истина, "Цена");
КонецПроцедуры

&НаКлиенте
Процедура ТЧУслугиСуммаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧУслуги.ТекущиеДанные, Истина, "Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ТЧУслугиСтавкаНДСПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧУслуги.ТекущиеДанные, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ТЧУслугиСуммаНДСПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Истина, "СуммаНДС");
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	РаботаСДокументамиКлиент.ЗаполнитьДанныеПоТорговойТочке(Объект, ВидЦены, Элементы.ТЧТоварыВидЦены);	
	//УстановитьЦеныНаСервере();
	ЗаполнитьСрокОплатыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ХозяйственнаяОперацияПриИзменении(Элемент)
	НастроитьФорму();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОтгрузкам(Команда)
	ЗаполнитьПоОтгрузкамНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзExcel(Команда)
	Оп = Новый ОписаниеОповещения("ПослеЗакрытияФормыЗагрузки",ЭтаФорма);
	Пар = Новый Структура("СоздаватьТовары",Ложь);
	ОткрытьФорму("Обработка.ЗагрузкаИзExcel.Форма.Форма",Пар,ЭтотОбъект,ЭтотОбъект.УникальныйИдентификатор,,,Оп,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСкидкаНаЦенуПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, , "Цена");
КонецПроцедуры

#КонецОбласти

#Область Оповещения

&НаКлиенте
Процедура ПослеЗакрытияФормыРедактированияДовоза(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если РезультатЗакрытия = Неопределено Тогда Возврат КонецЕсли;
	Если РезультатЗакрытия.Идентификатор = Неопределено Тогда
		Стр = Объект.ТЧТовары.Добавить();
		Стр.КодСтроки = РаботаСДокументамиКлиентСервер.ПолучитьСледующийКодСтроки(Объект.ТЧТовары);
	Иначе
		Стр = Объект.ТЧТовары.НайтиПоИдентификатору(РезультатЗакрытия.Идентификатор);
		РаботаСДокументамиКлиентСервер.УдалитьСвязанныеСтроки(Объект, "ТЧСерии", Стр.КодСтроки);
	КонецЕсли;	
	ЗаполнитьЗначенияСвойств(Стр, РезультатЗакрытия,, "КодСтроки");
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Стр, Истина);
КонецПроцедуры	

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ScanData" и ВводДоступен() Тогда 
		Штрихкод = ОперацииСПодключаемымОборудованиемКлиент.ПолучитьШтрихкод(ИмяСобытия, Параметр, Источник);
		РаботаСДокументамиКлиентСервер.ДобавитьНоменклатуруПоШтрихкоду(Штрихкод,Объект,,,ВидЦены,ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыЗагрузки(Результат,ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда Возврат; КонецЕсли;
	ЗаполнитьИзExcelНаСервере(Результат);
	ЗаполнитьОстаткиНаСервере();
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область Дополнительно  

&НаСервере
Процедура УстановитьЦеныНаСервере()
	РаботаСДокументами.УстановитьЦеныВТабличнойЧасти(Объект.ТЧТовары, ВидЦены, Объект.Дата);	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьЦеныПоЗаказуНаСервере()
	Если Не ЗначениеЗаполнено(Объект.Основание) Тогда Возврат КонецЕсли;
	ТЗЗаказ = Объект.Основание.ТЧТовары.Выгрузить();
	Для Каждого Стр Из Объект.ТЧТовары Цикл
		СтрЗаказ = ТЗЗаказ.Найти(Стр.КодСтроки, "КодСтроки");
		Если СтрЗаказ = Неопределено Тогда
			Стр.ВидЦены = Неопределено;
			Стр.Цена = 0;
			Стр.ЦенаSKU = 0;
		Иначе	
			Стр.ВидЦены = СтрЗаказ.ВидЦены;
			Стр.Цена = СтрЗаказ.Цена;
			Стр.ЦенаSKU = СтрЗаказ.ЦенаSKU;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСерииНаСервере()
	СерииИРазмещение.ЗаполнитьСерииПоОстаткам(Объект,Объект.Контрагент);	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоОстаткамНаСервере(ВсеНеоплаченные)
	РаботаСДокументами.ПолучитьАвансыДляЗакрытия(Объект, Истина, ВсеНеоплаченные);		
КонецПроцедуры

&НаСервере
Процедура УстановитьВидЦеныПоДоговору()
	//ВидЦены = ?(ЗначениеЗаполнено(Объект.Договор.ВидЦены),Объект.Договор.ВидЦены, Справочники.ВидыЦен.Розничная);
	ВидЦены = ?(ЗначениеЗаполнено(Объект.Контрагент.ТипЦены),Объект.Контрагент.ТипЦены, Справочники.ВидыЦен.Розничная);
	РаботаСДокументамиКлиентСервер.ЗаполнитьСписокВыбораВидовЦен(ВидЦены, Элементы.ТЧТоварыВидЦены);
КонецПроцедуры

&НаКлиенте
Процедура ТЧДополнительныеРасходыСуммаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧДополнительныеРасходы.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТЧДополнительныеРасходыСтавкаНДСПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧДополнительныеРасходы.ТекущиеДанные);
КонецПроцедуры

&НаСервере
Процедура НастроитьФорму()
	ЭтоОтгрузкаТовара = Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.НакладнаяПоОтгрузкамТовара;
	Элементы.МестоХранения.Видимость = Не ЭтоОтгрузкаТовара;
	//Элементы.СтраницаДополнительныеРасходы.Видимость = Не ЭтоОтгрузкаТовара;
	Элементы.ТЧТоварыЗаполнитьПоОтгрузкам.Видимость = ЭтоОтгрузкаТовара;
	Элементы.ТЧТоварыОтгрузкаТовара.Видимость = ЭтоОтгрузкаТовара;
	Элементы.ТЧТоварыГруппаПоследниеЦены.Видимость = ЕстьПравоЗаверениеЦен;
	Элементы.ТЧТоварыВидЦены.ТолькоПросмотр = Не ЕстьПравоЗаверениеЦен;
	Элементы.ТЧТоварыЦена.ТолькоПросмотр = Не ЕстьПравоЗаверениеЦен;
	Элементы.ТЧТоварыСумма.ТолькоПросмотр = Не ЕстьПравоЗаверениеЦен;
	Элементы.ТЧТоварыПроцентСкидки.ТолькоПросмотр = Не ЕстьПравоЗаверениеЦен;
	Элементы.ТЧТоварыСуммаСкидки.ТолькоПросмотр = Не ЕстьПравоЗаверениеЦен;
КонецПроцедуры

Процедура ЗаполнитьПоОтгрузкамНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОтгрузкаТовараТЧТовары.Ссылка КАК ОтгрузкаТовара,
	|	ОтгрузкаТовараТЧТовары.Номенклатура КАК Номенклатура,
	|	ОтгрузкаТовараТЧТовары.Характеристика КАК Характеристика,
	|	ОтгрузкаТовараТЧТовары.Упаковка КАК Упаковка,
	|	ОтгрузкаТовараТЧТовары.Серия КАК Серия,
	|	ОтгрузкаТовараТЧТовары.УказаноНесколькоСерий КАК УказаноНесколькоСерий,
	|	ОтгрузкаТовараТЧТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ОтгрузкиТоваровОстатки.КоличествоОстаток КАК Количество,
	|	ОтгрузкаТовараТЧТовары.ВидЦены КАК ВидЦены,
	|	ОтгрузкаТовараТЧТовары.ЦенаSKU КАК ЦенаSKU,
	|	ОтгрузкаТовараТЧТовары.Цена КАК Цена,
	|	ОтгрузкаТовараТЧТовары.Сумма КАК Сумма,
	|	ОтгрузкаТовараТЧТовары.ПроцентСкидки КАК ПроцентСкидки,
	|	ОтгрузкаТовараТЧТовары.СуммаСкидки КАК СуммаСкидки,
	|	ОтгрузкаТовараТЧТовары.СуммаСНДС КАК СуммаСНДС,
	|	ОтгрузкаТовараТЧТовары.СтавкаНДС КАК СтавкаНДС,
	|	ОтгрузкаТовараТЧТовары.СуммаНДС КАК СуммаНДС
	|ИЗ
	|	РегистрНакопления.ОтгрузкиТоваров.Остатки(
	|			,
	|			Организация = &Организация
	|				И Контрагент = &Контрагент) КАК ОтгрузкиТоваровОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтгрузкаТовара.ТЧТовары КАК ОтгрузкаТовараТЧТовары
	|		ПО ОтгрузкиТоваровОстатки.ДокументОтгрузки = ОтгрузкаТовараТЧТовары.Ссылка
	|			И ОтгрузкиТоваровОстатки.Номенклатура = ОтгрузкаТовараТЧТовары.Номенклатура
	|ГДЕ
	|	НЕ ОтгрузкиТоваровОстатки.КоличествоОстаток = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтгрузкаТовараТЧУслуги.Ссылка КАК ОтгрузкаТовара,
	|	ОтгрузкаТовараТЧУслуги.Номенклатура КАК Номенклатура,
	|	ОтгрузкиТоваровОстатки.КоличествоОстаток КАК Количество,
	|	ОтгрузкаТовараТЧУслуги.Цена КАК Цена,
	|	ОтгрузкаТовараТЧУслуги.Сумма КАК Сумма,
	|	ОтгрузкаТовараТЧУслуги.СуммаСНДС КАК СуммаСНДС,
	|	ОтгрузкаТовараТЧУслуги.СтавкаНДС КАК СтавкаНДС,
	|	ОтгрузкаТовараТЧУслуги.СуммаНДС КАК СуммаНДС,
	|	ОтгрузкаТовараТЧУслуги.Содержание КАК Содержание
	|ИЗ
	|	РегистрНакопления.ОтгрузкиТоваров.Остатки(
	|			,
	|			Организация = &Организация
	|				И Контрагент = &Контрагент) КАК ОтгрузкиТоваровОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтгрузкаТовара.ТЧУслуги КАК ОтгрузкаТовараТЧУслуги
	|		ПО ОтгрузкиТоваровОстатки.ДокументОтгрузки = ОтгрузкаТовараТЧУслуги.Ссылка
	|			И ОтгрузкиТоваровОстатки.Номенклатура = ОтгрузкаТовараТЧУслуги.Номенклатура
	|ГДЕ
	|	НЕ ОтгрузкиТоваровОстатки.КоличествоОстаток = 0";
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	П = Запрос.ВыполнитьПакет();
	Объект.ТЧТовары.Загрузить(П.Получить(0).Выгрузить());
	Объект.ТЧУслуги.Загрузить(П.Получить(1).Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура ВидЦеныПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзExcelНаСервере(Мас)
	Объект.ТЧТовары.Очистить();
	Для Каждого Эл из Мас Цикл
		НС = Объект.ТЧТовары.Добавить();
		ЗаполнитьЗначенияСвойств(НС,Эл);
		НС.СтавкаНДС = НС.Номенклатура.СтавкаНДС;
		Если ЗначениеЗаполнено(НС.Номенклатура) Тогда 
			НС.Упаковка = НС.Номенклатура.Единица;
		КонецЕсли;
		РаботаСДокументамиКлиентСервер.РассчитатьСтроку(НС);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоследниеЦены(Строка = Неопределено)
	ДатаЦен = ?(Объект.Ссылка.Пустая(),ТекущаяДата(),Объект.Дата);
	Номенклатура = Объект.ТЧТовары.Выгрузить().ВыгрузитьКолонку("Номенклатура");
	ТЗЦены = РегистрыСведений.ЦеныНоменклатурыПоставщиков.ПоследнийПрайс(ДатаЦен,Номенклатура,Неопределено);
	Для Каждого Стр из Объект.ТЧТовары Цикл
		СтрЦена = ТЗЦены.Найти(Стр.Номенклатура);
		Стр.ЦенаЗакупкиПоследняя = ?(СтрЦена = Неопределено, 0, СтрЦена.Цена); 
	КонецЦикла;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПродажиОбороты.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(ПродажиОбороты.Период) КАК Период
	|ПОМЕСТИТЬ ВТ_Периоды
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(
	|			,
	|			&ДатаЦен,
	|			Регистратор,
	|			Контрагент = &Контрагент
	|				И Номенклатура В (&Номенклатура)) КАК ПродажиОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажиОбороты.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Периоды.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА Продажи.Количество <> 0
	|			ТОГДА Продажи.Выручка / Продажи.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Цена
	|ИЗ
	|	ВТ_Периоды КАК ВТ_Периоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи КАК Продажи
	|		ПО ВТ_Периоды.Период = Продажи.Период
	|			И ВТ_Периоды.Номенклатура = Продажи.Номенклатура";
	Запрос.УстановитьПараметр("ДатаЦен", Новый Граница(ДатаЦен,ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	ТЗЦены = Запрос.Выполнить().Выгрузить();
	Для Каждого Стр из Объект.ТЧТовары Цикл
		СтрЦена = ТЗЦены.Найти(Стр.Номенклатура);
		Стр.ЦенаПродажиПоследняя = ?(СтрЦена = Неопределено, 0, СтрЦена.Цена); 
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСрокОплатыНаСервере()
	СрокОплаты = РаботаСДокументами.ПолучитьСрокОплаты(Объект.Контрагент,?(Объект.Ссылка.Пустая(),ТекущаяДата(),Объект.Дата));
КонецПроцедуры   

&НаСервере
Процедура ЗаполнитьСуммыОплатыДолга()     
		
		СуммаДолга = "0,00";        
		СуммаОплаты  = "0,00"; 
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ВзаиморасчётыСПокупателями.ОбъектРасчётов КАК ОбъектРасчётов,
		|	ВзаиморасчётыСПокупателями.Сумма КАК Сумма
		|ИЗ
		|	РегистрНакопления.ВзаиморасчётыСПокупателями КАК ВзаиморасчётыСПокупателями
		|ГДЕ
		|	(ВЫРАЗИТЬ(ОбъектРасчётов КАК Документ.РеализацияТоваровУслуг)) = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка",объект.Ссылка);  
		
		Выборка = Запрос.Выполнить().Выгрузить();
		
	Если Выборка.Количество() = 0 Тогда иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ВзаиморасчётыСПокупателямиОстатки.ОбъектРасчётов КАК ОбъектРасчётов,
		|	ВзаиморасчётыСПокупателямиОстатки.СуммаОстаток КАК Сумма
		|ИЗ
		|	РегистрНакопления.ВзаиморасчётыСПокупателями.Остатки(, (ВЫРАЗИТЬ(ОбъектРасчётов КАК Документ.РеализацияТоваровУслуг)) = &Ссылка) КАК ВзаиморасчётыСПокупателямиОстатки";
		Запрос.УстановитьПараметр("Ссылка",объект.Ссылка); 
		
		Выборка = Запрос.Выполнить().Выгрузить();
		
		СуммаДолга = Строка(Выборка.Итог("Сумма"));        
		СуммаОплаты  = Строка(объект.Сумма - Выборка.Итог("Сумма"));
	КонецЕсли;

КонецПроцедуры   

&НаСервере
Процедура ЗаполнитьОстаткиНаСервере()
	МестоХранения = Объект.МестоХранения;
	Если Не ЗначениеЗаполнено(МестоХранения) Тогда
		МестоХранения = РегистрыСведений.НастройкиПользователей.СкладПользователя();
	КонецЕсли;
	РегистрыНакопления.ТоварыВНаличии.ЗаполнитьОстаткиСтрок(Объект.ТЧТовары, МестоХранения);
КонецПроцедуры

#КонецОбласти
