
#Область ПрограммныйИнтерфейс

// Счета, не рекомендуемые к использованию в проводках ручной операции.
// В предке список давал модуль БП; в maERP не рекомендуются счета с пометкой удаления.
//
// Возвращаемое значение:
//   Массив из ПланСчетовСсылка.Хозрасчетный - счета, помеченные на удаление.
//
Функция НерекомендуемыеСчетаУчета() Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Ссылка
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.ПометкаУдаления");
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции

#КонецОбласти
