 
#Область Формирование_движений
 
Процедура РаспределитьНаСебестоимость(ДокОбъект) Экспорт
	Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПоступлениеДополнительныхРасходов") Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ТЧТовары.Номенклатура КАК Номенклатура,
		                      |	ТЧТовары.Характеристика КАК Характеристика,
		                      |	ТЧТовары.Серия КАК Серия,
		                      |	ТЧТовары.ДокументПартии КАК Партия,
		                      |	ТЧТовары.СтатьяДДС КАК СтатьяДДС,
		                      |	СУММА(ВЫБОР
		                      |			КОГДА ТЧТовары.Ссылка.ЦенаВключаетНДС
		                      |				ТОГДА ТЧТовары.Сумма
		                      |			ИНАЧЕ ТЧТовары.Сумма + ТЧТовары.СуммаНДС
		                      |		КОНЕЦ) КАК Сумма
		                      |ПОМЕСТИТЬ ВТ
		                      |ИЗ
		                      |	Документ.ПоступлениеДополнительныхРасходов.ТЧТовары КАК ТЧТовары
		                      |ГДЕ
		                      |	ТЧТовары.Ссылка = &Док
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	ТЧТовары.Номенклатура,
		                      |	ТЧТовары.Характеристика,
		                      |	ТЧТовары.Серия,
		                      |	ТЧТовары.ДокументПартии,
		                      |	ТЧТовары.СтатьяДДС
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	ТоварыВНаличии.МестоХранения КАК МестоХранения,
		                      |	ТоварыВНаличии.Номенклатура КАК Номенклатура,
		                      |	ТоварыВНаличии.Характеристика КАК Характеристика,
		                      |	ТоварыВНаличии.Серия КАК Серия,
		                      |	ТоварыВНаличии.Партия КАК Партия,
		                      |	ТоварыВНаличии.Количество КАК Количество,
		                      |	ТоварыВНаличии.Сумма КАК Сумма
		                      |ИЗ
		                      |	РегистрНакопления.ТоварыВНаличии КАК ТоварыВНаличии
		                      |ГДЕ
		                      |	ТоварыВНаличии.Регистратор В
		                      |			(ВЫБРАТЬ
		                      |				ВТ.Партия
		                      |			ИЗ
		                      |				ВТ)
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	ВТ.Номенклатура КАК Номенклатура,
		                      |	ВТ.Характеристика КАК Характеристика,
		                      |	ВТ.Серия КАК Серия,
		                      |	ВТ.Партия КАК Партия,
		                      |	ВТ.СтатьяДДС КАК СтатьяДДС,
		                      |	ВТ.Сумма КАК Сумма
		                      |ИЗ
		                      |	ВТ КАК ВТ");
		Запрос.УстановитьПараметр("Док", ДокОбъект.Ссылка);
		Рез = Запрос.ВыполнитьПакет();
		ТЗТовары = Рез[1].Выгрузить();
		ТЗДополнительныеРасходы = Рез[2].Выгрузить();
		РаспределитьПоПозициям(ДокОбъект, ТЗТовары, ТЗДополнительныеРасходы);
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.УценкаТоваров") Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ТЧТовары.Номенклатура КАК Номенклатура,
		                      |	ТЧТовары.Характеристика КАК Характеристика,
		                      |	ТЧТовары.Серия КАК Серия,
		                      |	ТЧТовары.ЦенаНовая КАК Цена,
		                      |	ТЧТовары.Ссылка.МестоХранения КАК МестоХранения,
		                      |	ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.УценкаТоваров) КАК СтатьяДДС
		                      |ПОМЕСТИТЬ ВТ
		                      |ИЗ
		                      |	Документ.УценкаТоваров.ТЧТовары КАК ТЧТовары
		                      |ГДЕ
		                      |	ТЧТовары.Ссылка = &Док
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	ТЧТовары.Номенклатура,
		                      |	ТЧТовары.Характеристика,
		                      |	ТЧТовары.ЦенаНовая,
		                      |	ТЧТовары.Серия,
		                      |	ТЧТовары.Ссылка.МестоХранения
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	ТоварыВНаличииОстатки.МестоХранения КАК МестоХранения,
		                      |	ТоварыВНаличииОстатки.Номенклатура КАК Номенклатура,
		                      |	ТоварыВНаличииОстатки.Характеристика КАК Характеристика,
		                      |	ТоварыВНаличииОстатки.Серия КАК Серия,
		                      |	ТоварыВНаличииОстатки.Партия КАК Партия,
		                      |	ТоварыВНаличииОстатки.КоличествоОстаток КАК Количество,
		                      |	ТоварыВНаличииОстатки.СуммаОстаток КАК Сумма
		                      |ИЗ
		                      |	РегистрНакопления.ТоварыВНаличии.Остатки(
		                      |			&Дата,
		                      |			(МестоХранения, Номенклатура, Характеристика, Серия) В
		                      |				(ВЫБРАТЬ
		                      |					ВТ.МестоХранения,
		                      |					ВТ.Номенклатура,
		                      |					ВТ.Характеристика,
		                      |					ВТ.Серия
		                      |				ИЗ
		                      |					ВТ)) КАК ТоварыВНаличииОстатки
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	ВТ.Номенклатура КАК Номенклатура,
		                      |	ВТ.Характеристика КАК Характеристика,
		                      |	ВТ.Серия КАК Серия,
		                      |	ТоварыВНаличииОстатки.КоличествоОстаток * ВТ.Цена - ЕСТЬNULL(ТоварыВНаличииОстатки.СуммаОстаток, 0) - ЕСТЬNULL(ДополнительныеРасходыОстатки.СуммаОстаток, 0) КАК Сумма,
		                      |	ВТ.СтатьяДДС КАК СтатьяДДС
		                      |ИЗ
		                      |	ВТ КАК ВТ
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВНаличии.Остатки(&Дата, ) КАК ТоварыВНаличииОстатки
		                      |		ПО ВТ.Номенклатура = ТоварыВНаличииОстатки.Номенклатура
		                      |			И ВТ.Характеристика = ТоварыВНаличииОстатки.Характеристика
		                      |			И ВТ.Серия = ТоварыВНаличииОстатки.Серия
		                      |			И ВТ.МестоХранения = ТоварыВНаличииОстатки.МестоХранения
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДополнительныеРасходы.Остатки(&Дата, ) КАК ДополнительныеРасходыОстатки
		                      |		ПО ВТ.Номенклатура = ДополнительныеРасходыОстатки.Номенклатура
		                      |			И ВТ.Характеристика = ДополнительныеРасходыОстатки.Характеристика
		                      |			И ВТ.Серия = ДополнительныеРасходыОстатки.Серия
		                      |			И ВТ.МестоХранения = ДополнительныеРасходыОстатки.МестоХранения");
		Запрос.УстановитьПараметр("Док", ДокОбъект.Ссылка);
		Запрос.УстановитьПараметр("Дата", РаботаСДокументамиВызовСервера.ПолучитьГраницуДокумента(ДокОбъект));
		Рез = Запрос.ВыполнитьПакет();
		ТЗТовары = Рез[1].Выгрузить();
		ТЗДополнительныеРасходы = Рез[2].Выгрузить();
		РаспределитьПоПозициям(ДокОбъект, ТЗТовары, ТЗДополнительныеРасходы);
	Иначе
		ТЗДополнительныеРасходы = ДокОбъект.ТЧДополнительныеРасходы.Выгрузить();
		Если ТЗДополнительныеРасходы.Колонки.Найти("СуммаСНДС") <> Неопределено Тогда 
			ТЗДополнительныеРасходы.Колонки.Удалить("Сумма");
			ТЗДополнительныеРасходы.Колонки.СуммаСНДС.Имя = "Сумма";
		КонецЕсли;
		ТЗТовары = ДокОбъект.Движения.ТоварыВНаличии.Выгрузить(); 
		РаспределитьПоПозициям(ДокОбъект, ТЗТовары, ТЗДополнительныеРасходы);		
	КонецЕсли;
КонецПроцедуры

Процедура ДобавитьПриход(Движения, ДатаДвижения, МестоХранения, Номенклатура, Характеристика, Серия, Партия, СтатьяДДС, Сумма) Экспорт
	Если Сумма = 0 Тогда Возврат КонецЕсли;
	НС = Движения.ДополнительныеРасходы.ДобавитьПриход();
	НС.Период = ДатаДвижения;
	НС.МестоХранения = МестоХранения;
	НС.Номенклатура = Номенклатура;
	НС.Характеристика = Характеристика; 
	НС.Серия = Серия;
	НС.Партия = Партия;
	НС.СтатьяДДС = СтатьяДДС;
	НС.Сумма = Сумма;	
КонецПроцедуры

Процедура ДобавитьРасход(Движения, ДатаДвижения, МестоХранения, Номенклатура, Характеристика, Серия, Партия, СтатьяДДС, Сумма) Экспорт
	Если Сумма = 0 Тогда Возврат КонецЕсли;
	НС = Движения.ДополнительныеРасходы.ДобавитьРасход();
	НС.Период = ДатаДвижения;
	НС.МестоХранения = МестоХранения;
	НС.Номенклатура = Номенклатура;
	НС.Характеристика = Характеристика; 
	НС.Серия = Серия;
	НС.Партия = Партия;
	НС.СтатьяДДС = СтатьяДДС;
	НС.Сумма = Сумма;	
КонецПроцедуры

#КонецОбласти

#Область Дополнительно

Процедура РаспределитьПоПозициям(ДокОбъект, ТЗТовары, ТЧДополнительныеРасходы) Экспорт 
	ЭтоРеализация = ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.РеализацияТоваровУслуг");
	Для Каждого СтрДопРасход Из ТЧДополнительныеРасходы Цикл	
		// Получаем основу распределения
		Если РаботаСДокументамиКлиентСервер.ЕстьРеквизит(СтрДопРасход, "Номенклатура") и  ЗначениеЗаполнено(СтрДопРасход.Номенклатура) Тогда
			МасТовары = ТЗТовары.НайтиСтроки(Новый Структура("Номенклатура, Характеристика", СтрДопРасход.Номенклатура, СтрДопРасход.Характеристика));
			СуммаТоваров = 0;
			Для Каждого Стр Из МасТовары Цикл
				СуммаТоваров = СуммаТоваров + Стр.Сумма;	
			КонецЦикла;	
		Иначе
			МасТовары = ТЗТовары;
			СуммаТоваров = ТЗТовары.Итог("Сумма");
		КонецЕсли;
		// Распределяем
		СуммаКРаспределению = СтрДопРасход.Сумма;
		КоличествоТоваров = МасТовары.Количество(); 
		Для А = 1 По КоличествоТоваров Цикл
			Стр = МасТовары[А - 1];
			СуммаНаТовар = ?(А = КоличествоТоваров, СуммаКРаспределению, Окр(СтрДопРасход.Сумма / СуммаТоваров * Стр.Сумма, 2));
			ДобавитьПриход(ДокОбъект.Движения, ДокОбъект.Дата, Стр.МестоХранения, Стр.Номенклатура, Стр.Характеристика, Стр.Серия, Стр.Партия, СтрДопРасход.СтатьяДДС, СуммаНаТовар);
			Если ЭтоРеализация Тогда
				ДобавитьРасход(ДокОбъект.Движения, ДокОбъект.Дата, Стр.МестоХранения, Стр.Номенклатура, Стр.Характеристика, Стр.Серия, Стр.Партия, СтрДопРасход.СтатьяДДС, СуммаНаТовар);	
			КонецЕсли;	
			СуммаКРаспределению = СуммаКРаспределению - СуммаНаТовар; 
		КонецЦикла;
	КонецЦикла;	
КонецПроцедуры


#КонецОбласти


