
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.РежимВыбора Тогда
		Элементы.Список.РежимВыбора = Истина;
		Элементы.Список.ПоложениеСтрокиПоиска = ПоложениеСтрокиПоиска.Верх;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Параметры.РежимВыбора Тогда
		СтандартнаяОбработка = Ложь;
		ЗакрыватьПриВыборе = Ложь;
		Закрыть(Элементы.Список.ТекущиеДанные.Контрагент);
		//ОповеститьОВыборе(Элементы.Список.ТекущиеДанные.Владелец);
		//ПоказатьЗначение(, Элементы.Список.ТекущиеДанные.Контрагент);
	ИначеЕсли Поле = Элементы.Значение Тогда
		СтандартнаяОбработка = Ложь;
		ТекСтр = Элементы.Список.ТекущиеДанные;
		ЗапуститьПриложение(ТекСтр.Значение);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	СтандартнаяОбработка =Ложь;
	Закрыть(Элементы.Список.ТекущиеДанные.Контрагент);
КонецПроцедуры
