
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Код");
	Поля.Добавить("ДатаДоговора");
	Поля.Добавить("Описание");
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Описание = ?(ЗначениеЗаполнено(Данные.Описание), " (" + Данные.Описание + ")", "");
	Представление = "№" + СокрЛП(Данные.Код) + " de " + Формат(Данные.ДатаДоговора, "ДЛФ=D") + " " + СокрЛП(Описание);
КонецПроцедуры

Функция ПолучитьОсновной(Контрагент, Организация) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ДоговорыСКонтрагентами.Ссылка КАК Ссылка,
	                      |	ДоговорыСКонтрагентами.Основной КАК Основной
	                      |ИЗ
	                      |	Справочник.ДоговорыСКонтрагентами КАК ДоговорыСКонтрагентами
	                      |ГДЕ
	                      |	ДоговорыСКонтрагентами.ПометкаУдаления = ЛОЖЬ
	                      |	И ДоговорыСКонтрагентами.Контрагент = &Контрагент
	                      |	И ДоговорыСКонтрагентами.Организация = &Организация
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Основной УБЫВ");
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	Рез = Запрос.Выполнить();
	Возврат ?(Рез.Пустой(), Справочники.ДоговорыСКонтрагентами.ПустаяСсылка(), Рез.Выгрузить()[0].Ссылка);
КонецФункции

Функция ПолучитьКуратораДоговора(Договор, Дата = Неопределено)  Экспорт
	Результат = Новый Структура("Договор, Менеджер, Ответственный, Телефон");
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КураторыДоговоровСрезПоследних.Договор КАК Договор,
	                      |	КураторыДоговоровСрезПоследних.Куратор КАК Менеджер,
	                      |	КураторыДоговоровСрезПоследних.Ответственный КАК Ответственный,
	                      |	МАКСИМУМ(ЕСТЬNULL(РеквизитыКонтрагентовТелефон.Представление, """")) КАК Телефон
	                      |ИЗ
	                      |	РегистрСведений.КураторыДоговоров.СрезПоследних(&Период, Договор = &Договор) КАК КураторыДоговоровСрезПоследних
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыКонтрагентов.СрезПоследних(&Период, ) КАК РеквизитыКонтрагентовТелефон
	                      |		ПО КураторыДоговоровСрезПоследних.Куратор = РеквизитыКонтрагентовТелефон.Контрагент
	                      |			И (РеквизитыКонтрагентовТелефон.Реквизит = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.Телефон))
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	КураторыДоговоровСрезПоследних.Договор,
	                      |	КураторыДоговоровСрезПоследних.Ответственный,
	                      |	КураторыДоговоровСрезПоследних.Куратор");
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("Период", ?(Дата = Неопределено, ТекущаяДатаСеанса(), Дата));
	Рез = Запрос.Выполнить();
	Если Не Рез.Пустой() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Рез.Выгрузить()[0]);	
	КонецЕсли;	
	Возврат Результат;	
КонецФункции 

&НаСервере
Функция СоздатьДоговор(Клиент, ВидДоговора, ВидЦены) Экспорт 
	НовыйДоговор = Справочники.ДоговорыСКонтрагентами.СоздатьЭлемент();
	НовыйДоговор.ВидДоговора = ВидДоговора;
	НовыйДоговор.ВидЦены = ВидЦены;
	НовыйДоговор.ДатаДоговора = ТекущаяДатаСеанса();
	НовыйДоговор.Контрагент = Клиент;
	НовыйДоговор.Организация = ПараметрыСеанса.Пользователь.Организация;
	НовыйДоговор.Основной = Истина;
	НовыйДоговор.Статус = Перечисления.СтатусыДоговоровКонтрагентов.Действует;
	НовыйДоговор.Описание = "Contrat";
	НовыйДоговор.Записать();
	
	Возврат НовыйДоговор.Ссылка;
КонецФункции
