
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Оп = Новый ОписаниеОповещения("ПослеЗакрытияФормыПараметровПечатиПрайса", ЭтотОбъект, ПараметрКоманды);
	ОткрытьФорму("Документ.УстановкаЦенНоменклатуры.Форма.ПараметрыПечатиПрайсЛиста",, АктивноеОкно(),,,, Оп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыПараметровПечатиПрайса(РезультатЗакрытия, МасДокументы)
	Если РезультатЗакрытия = Неопределено Тогда Возврат КонецЕсли;	
	Таб = Новый ТабличныйДокумент;
	Сформировать(Таб, МасДокументы, РезультатЗакрытия); 
	ВыводПечатныхФормКлиент.ОткрытьПредварительныйПросмотр(Таб);
КонецПроцедуры

&НаСервере
Процедура Сформировать(Таб, МасДок, Параметры)
	Для Каждого Док Из МасДок Цикл
		Документы.УстановкаЦенНоменклатуры.Печать(Таб, Док, Параметры);	
	КонецЦикла;	
КонецПроцедуры
