
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если РольДоступна("PDV") Тогда
		СкладПользователя = РегистрыСведений.НастройкиПользователей.СкладПользователя();
		ЭлементОтбора = СписокОприходование.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("МестоХраненияОприходование");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = СкладПользователя;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора = СписокСписание.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("МестоХранения");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = СкладПользователя;
		ЭлементОтбора.Использование = Истина;
	КонецЕсли;
КонецПроцедуры
