
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Контрагент = Справочники.Контрагенты.ПустаяСсылка();
	Если Параметры.Свойство("Контрагент") Тогда 
		Контрагент = Параметры.Контрагент;
	КонецЕсли;
	МестоХранения = Справочники.МестаХранения.ПустаяСсылка();
	Если Параметры.Свойство("МестоХранения") Тогда 
		МестоХранения = Параметры.МестоХранения;
	КонецЕсли;
	Операция = Перечисления.ХозяйственныеОперации.ПустаяСсылка();
	Если Параметры.Свойство("Операция") Тогда 
		Операция = Параметры.Операция;
	КонецЕсли;
	ТолькоНеоплаченные = Ложь;
	Если Параметры.Свойство("ТолькоНеоплаченные") Тогда 
		ТолькоНеоплаченные = Параметры.ТолькоНеоплаченные;
	КонецЕсли;
	МасТовары = Новый Массив;
	Если Параметры.Свойство("МасТовары") Тогда 
		МасТовары = Параметры.МасТовары;
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("Контрагент",Контрагент);
	Список.Параметры.УстановитьЗначениеПараметра("МестоХранения",МестоХранения);
	Список.Параметры.УстановитьЗначениеПараметра("Операция",Операция);
	Список.Параметры.УстановитьЗначениеПараметра("ТолькоНеоплаченные",ТолькоНеоплаченные);
	Список.Параметры.УстановитьЗначениеПараметра("МасТовары",МасТовары);
	Список.Параметры.УстановитьЗначениеПараметра("ЕстьТовары",Не МасТовары.Количество() = 0);
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекСтр = Элементы.Список.ТекущиеДанные;
	Если Не ТекСтр = Неопределено Тогда 
		СтандартнаяОбработка = Ложь;
		Закрыть(Новый Структура("Документ,Сумма,СуммаОстаток",ТекСтр.Ссылка, ТекСтр.Сумма, ТекСтр.СуммаОстаток));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	ТекСтр = Элементы.Список.ТекущиеДанные;
	Если Не ТекСтр = Неопределено Тогда 
		СтандартнаяОбработка = Ложь;
		Закрыть(Новый Структура("Документ,Сумма,СуммаОстаток",ТекСтр.Ссылка, ТекСтр.Сумма, ТекСтр.СуммаОстаток));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ТекСтр = Элементы.Список.ТекущиеДанные;
	Если ТекСтр = Неопределено Тогда 
		ТЗТовары.Очистить();
		Возврат;
	КонецЕсли;
	ЗаполнитьТовары(ТекСтр.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТовары(Док) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	ТЧТоварыРеализация = Док.ТЧТовары.Выгрузить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(&ДокРеализация КАК Документ.РеализацияТоваровУслуг) КАК Ссылка,
	|	ТЧТоварыРеализация.Номенклатура КАК Номенклатура,
	|	ТЧТоварыРеализация.Характеристика КАК Характеристика,
	|	ТЧТоварыРеализация.Серия КАК Серия,
	|	ТЧТоварыРеализация.Цена КАК Цена,
	|	ТЧТоварыРеализация.Сумма КАК Сумма,
	|	ТЧТоварыРеализация.Количество КАК Количество
	|ПОМЕСТИТЬ ТЧТоварыРеализация
	|ИЗ
	|	&ТЧТоварыРеализация КАК ТЧТоварыРеализация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЗ.Номенклатура КАК Номенклатура,
	|	ВЗ.Характеристика КАК Характеристика,
	|	ВЗ.Серия КАК Серия,
	|	СУММА(ВЗ.Сумма) КАК Сумма,
	|	СУММА(ВЗ.Количество) КАК Количество,
	|	ВЗ.ВидОперации КАК ВидОперации
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТЧТоварыРеализация.Номенклатура КАК Номенклатура,
	|		ТЧТоварыРеализация.Характеристика КАК Характеристика,
	|		ТЧТоварыРеализация.Серия КАК Серия,
	|		ТЧТоварыРеализация.Сумма КАК Сумма,
	|		ТЧТоварыРеализация.Количество КАК Количество,
	|		ТЧТоварыРеализация.Ссылка.ХозяйственнаяОперация КАК ВидОперации
	|	ИЗ
	|		ТЧТоварыРеализация КАК ТЧТоварыРеализация
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияСвязанныхДокументов.Номенклатура,
	|		ДвиженияСвязанныхДокументов.Характеристика,
	|		ДвиженияСвязанныхДокументов.Серия,
	|		ДвиженияСвязанныхДокументов.СуммаОборот,
	|		ДвиженияСвязанныхДокументов.КоличествоОборот,
	|		ДвиженияСвязанныхДокументов.Регистратор.ХозяйственнаяОперация
	|	ИЗ
	|		РегистрНакопления.ДвиженияСвязанныхДокументов.Обороты(, , Регистратор, Основание = &ДокРеализация) КАК ДвиженияСвязанныхДокументов
	|	ГДЕ
	|		НЕ ДвиженияСвязанныхДокументов.Регистратор = &Регистратор) КАК ВЗ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЗ.Характеристика,
	|	ВЗ.Номенклатура,
	|	ВЗ.Серия,
	|	ВЗ.ВидОперации";
	Запрос.УстановитьПараметр("ТЧТоварыРеализация",ТЧТоварыРеализация);
	Запрос.УстановитьПараметр("ДокРеализация",Док);
	Запрос.УстановитьПараметр("Регистратор",Док.Ссылка);
	ТЗРезультат = Запрос.Выполнить().Выгрузить();
	// Удалим нулевые
	Мас = ТЗРезультат.НайтиСтроки(Новый Структура("Количество", 0));
	Для А = 1 - Мас.Количество() По 0 Цикл
		ТЗРезультат.Удалить(Мас[-А]);	
	КонецЦикла;
	ТЗТовары.Загрузить(ТЗРезультат);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ScanData" и ВводДоступен() Тогда 
		Штрихкод = ОперацииСПодключаемымОборудованиемКлиент.ПолучитьШтрихкод(ИмяСобытия, Параметр, Источник);
		Попытка 
			УИ = Новый УникальныйИдентификатор(Штрихкод);
			Док = ПолучитьДокументНаСЕрвере(УИ);
			Если ЗначениеЗаполнено(Док) Тогда
				Элементы.Список.ТекущаяСтрока = Док;
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьДокументНаСЕрвере(УИ)
	Возврат Документы.РеализацияТоваровУслуг.ПолучитьСсылку(УИ);
КонецФункции
