
#Область Обработчики_событий_формы 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьЭлементов();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Куратор = РегистрыСведений.КураторыДоговоров.ПолучитьПоследнее(, Новый Структура("Договор", ТекущийОбъект.Ссылка)).Куратор;
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура ВалютаВзаиморасчётовПриИзменении(Элемент)
	УстановитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура СрокОплатыПриИзменении(Элемент)
КонецПроцедуры

&НаКлиенте
Процедура СпособРасчётаОтсрочкиПриИзменении(Элемент)
КонецПроцедуры

#КонецОбласти

#Область Дополнительно

&НаКлиенте
Процедура УстановитьВидимостьЭлементов()
	Элементы.РасчётыВУсловныхЕдиницах.Доступность = ЗначениеЗаполнено(Объект.ВалютаВзаиморасчётов) и Объект.ВалютаВзаиморасчётов <> ПредопределенноеЗначение("Справочник.Валюты.РоссийскийРубль");	
КонецПроцедуры

#КонецОбласти
