
Процедура СформироватьДвижения(ДокОбъект) Экспорт
	//ТЗТовары = ДокОбъект.Движения.ТоварыВНаличии.Выгрузить();
	//НЗДополнительныеРасходы = ДокОбъект.Движения.Найти("ДополнительныеРасходы");
	//Если Не НЗДополнительныеРасходы = Неопределено Тогда
	//	Для Каждого Стр из НЗДополнительныеРасходы Цикл
	//		НС = ТЗТовары.Добавить();
	//		ЗаполнитьЗначенияСвойств(НС,Стр);
	//	КонецЦикла;
	//КонецЕсли;
	//ТЗТовары.Свернуть("ВидДвижения,МестоХранения,Номенклатура","Количество,Сумма");
	//Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПоступлениеТоваровУслуг") Тогда
	//	ДвижениеПоступлениеТоваров(ДокОбъект);
	//ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ВозвратПоставщику") Тогда
	//	ДвижениеКорректировкаВозвратПоступления(ДокОбъект,ТЗТовары);
	//ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.РеализацияТоваровУслуг")
	//	Или ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ВозвратОтПокупателя") Тогда
	//	ДвижениеРеализацияТоваров(ДокОбъект,ТЗТовары); 
	//ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.СписаниеТоваров")
	//	Или ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ОприходованиеТоваров") Тогда
	//	ДвижениеСписаниеОприходованиеТоваров(ДокОбъект,ТЗТовары);
	//ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПеремещениеТоваров") Тогда 
	//	ДвижениеПеремещениеТоваров(ДокОбъект,ТЗТовары);
	//ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПересортицаТоваров") Тогда 
	//	ДвижениеПересортицаТоваров(ДокОбъект,ТЗТовары);
	//КонецЕсли;
КонецПроцедуры

Процедура ДвижениеПоступлениеТоваров(ДокОбъект) 
	Сч44111 = ПланыСчетов.Хозрасчетный.FournisseursCategorieA;
	Сч61110 = ПланыСчетов.Хозрасчетный.AchatsDeMarchandisesGroupeA;
	Сч34552 = ПланыСчетов.Хозрасчетный.EtatTVARecupérableSurCharges;
	Сч3111 = ПланыСчетов.Хозрасчетный.MarchandisesGroupeA; 
	Сч6114 = ПланыСчетов.Хозрасчетный.VariationDeStocksDeMarchandises;
	ДанныеСубконто = ОбщегоНазначенияПовтИсп.СтруктураДанныхСубконто();
	Для Каждого Стр Из ДокОбъект.ТЧТовары Цикл
		//с/с закупки
		НС = ДокОбъект.Движения.Хозрасчетный.Добавить();
		НС.Период = ДокОбъект.Дата;
		НС.Организация = ДокОбъект.Организация;
		НС.Содержание = ДокОбъект.Метаданные().ПредставлениеОбъекта;
		НС.СчетДт = Сч61110;
		НС.СубконтоДт.Номенклатура = Стр.Номенклатура;
		НС.СубконтоДт.МестаХранения = ДокОбъект.МестоХранения;
		НС.КоличествоДт = Стр.Количество;
		НС.СчетКт = Сч44111;
		НС.СубконтоКт.Контрагенты = ДокОбъект.Контрагент;
		НС.СубконтоКт.ДокументыРасчетовСКонтрагентами = ДокОбъект.Ссылка;
		НС.Сумма = Стр.Сумма;
		//НДС
		НС = ДокОбъект.Движения.Хозрасчетный.Добавить();
		НС.Период = ДокОбъект.Дата;
		НС.Организация = ДокОбъект.Организация;
		НС.Содержание = ДокОбъект.Метаданные().ПредставлениеОбъекта;
		НС.СчетДт = Сч34552;
		НС.СубконтоДт.СтавкиНДС = Стр.СтавкаНДС;
		НС.СубконтоДт.НоменклатурныеГруппы = Стр.Номенклатура.ТоварнаяГруппа;
		НС.СчетКт = Сч44111;
		НС.СубконтоКт.Контрагенты = ДокОбъект.Контрагент;
		НС.СубконтоКт.ДокументыРасчетовСКонтрагентами = ДокОбъект.Ссылка;
		НС.Сумма = Стр.СуммаНДС;
		//склад
		НС = ДокОбъект.Движения.Хозрасчетный.Добавить();
		НС.Период = ДокОбъект.Дата;
		НС.Организация = ДокОбъект.Организация;
		НС.Содержание = ДокОбъект.Метаданные().ПредставлениеОбъекта;
		НС.СчетДт = Сч3111;
		НС.СубконтоДт.Номенклатура = Стр.Номенклатура;
		НС.СубконтоДт.МестаХранения = ДокОбъект.МестоХранения;
		НС.КоличествоДт = Стр.Количество;
		НС.СчетКт = Сч6114;
		НС.СубконтоКт.Номенклатура = Стр.Номенклатура;
		НС.СубконтоКт.МестаХранения = ДокОбъект.МестоХранения;
		НС.КоличествоКт = Стр.Количество;
		НС.Сумма = Стр.Сумма;
	КонецЦикла;
	//Для Каждого СтрДопРасход Из ДокОбъект.ТЧДополнительныеРасходы Цикл	
	//	// Получаем основу распределения
	//	Если ЗначениеЗаполнено(СтрДопРасход.Номенклатура) Тогда
	//		МасТовары = ДокОбъект.ТЧТовары.НайтиСтроки(Новый Структура("Номенклатура, Характеристика", СтрДопРасход.Номенклатура, СтрДопРасход.Характеристика));
	//		СуммаТоваров = 0;
	//		Для Каждого Стр Из МасТовары Цикл
	//			СуммаТоваров = СуммаТоваров + Стр.Сумма;	
	//		КонецЦикла;	
	//	Иначе
	//		МасТовары = ДокОбъект.ТЧТовары;
	//		СуммаТоваров = ДокОбъект.ТЧТовары.Итог("Сумма");
	//	КонецЕсли;
	//	// Распределяем
	//	СуммаКРаспределению = СтрДопРасход.Сумма;
	//	КоличествоТоваров = МасТовары.Количество(); 
	//	Для А = 1 По КоличествоТоваров Цикл
	//		Стр = МасТовары[А - 1];
	//		СуммаНаТовар = ?(А = КоличествоТоваров, СуммаКРаспределению, Окр(СтрДопРасход.Сумма / СуммаТоваров * Стр.Сумма, 2));
	//		НС = ДокОбъект.Движения.Хозрасчетный.Добавить();
	//		НС.Период = ДокОбъект.Дата;
	//		НС.Организация = ДокОбъект.Организация;
	//		НС.Содержание = ДокОбъект.Метаданные().ПредставлениеОбъекта;
	//		НС.СчетДт = Сч41_1;
	//		НС.СубконтоДт.Номенклатура = Стр.Номенклатура;
	//		НС.СубконтоДт.МестаХранения = ДокОбъект.МестоХранения;
	//		НС.СчетКт = Сч60_1;
	//		НС.СубконтоКт.Контрагенты = СтрДопРасход.Контрагент;
	//		НС.СубконтоКт.Договоры = СтрДопРасход.Договор;
	//		НС.Сумма = СуммаНаТовар;
	//		СуммаКРаспределению = СуммаКРаспределению - СуммаНаТовар; 
	//	КонецЦикла;
	//КонецЦикла;	
	
	////НДС не формируем
	//ТЗНдс = ДокОбъект.ТЧТовары.Выгрузить();
	//ТЗНдс.Свернуть(,"СуммаНДС");
	//Для Каждого Стр из ТЗНдс Цикл 
	//	НС = ДокОбъект.Движения.Хозрасчетный.Добавить();
	//	НС.Период = ДокОбъект.Дата;
	//	НС.Организация = ДокОбъект.Организация;
	//	НС.СчетДт = Сч19_03;
	//	НС.СубконтоДт.Контрагенты = ДокОбъект.Контрагент;
	//	НС.СубконтоДт.СФПолученные = ДокОбъект.Ссылка;
	//	НС.СчетКт = Сч60_1;
	//	НС.СубконтоКт.Контрагенты = ДокОбъект.Контрагент;
	//	НС.СубконтоКт.Договоры = ДокОбъект.Договор;
	//	НС.Сумма = Стр.СуммаНДС;
	//КонецЦикла;
КонецПроцедуры

Процедура ДвижениеКорректировкаВозвратПоступления(ДокОбъект,ТЗТовары) 
	Сч41_1 = ПланыСчетов.Хозрасчетный.ТоварыНаСкладах;
	Сч60_1 = ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками;
	Сч19_03 = ПланыСчетов.Хозрасчетный.НДСпоПриобретеннымМПЗ; 
	Сч76_02 = ПланыСчетов.Хозрасчетный.РасчетыПоПретензиям; 
	Сч91_01 = ПланыСчетов.Хозрасчетный.ПрочиеДоходы; 
	Сч91_02 = ПланыСчетов.Хозрасчетный.ПрочиеРасходы; 
	Для Каждого Стр Из ТЗТовары Цикл
		НС = ДокОбъект.Движения.Хозрасчетный.Добавить();
		НС.Период = ДокОбъект.Дата;
		НС.Организация = ДокОбъект.Организация;
		НС.Содержание = ДокОбъект.Метаданные().ПредставлениеОбъекта;
		Приход = Стр.ВидДвижения = ВидДвиженияНакопления.Приход;
		Сумма = Стр.Сумма;
		НС.СчетДт = Сч76_02;
		НС.СубконтоДт.Контрагенты = ДокОбъект.Контрагент;
		НС.СубконтоДт.Договоры = ДокОбъект.Договор;
		НС.СчетКт = Сч41_1;
		НС.СубконтоКт.Номенклатура = Стр.Номенклатура;
		НС.СубконтоКт.МестаХранения = ДокОбъект.МестоХранения;
		НС.КоличествоКт = Стр.Количество;
		НС.Сумма = Сумма;
	КонецЦикла;
	Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ВозвратПоставщику") Тогда
		НС = ДокОбъект.Движения.Хозрасчетный.Добавить();
		НС.Содержание = ДокОбъект.Метаданные().ПредставлениеОбъекта;
		НС.Период = ДокОбъект.Дата;
		НС.Организация = ДокОбъект.Организация;
		НС.СчетДт = Сч60_1;
		НС.СубконтоДт.Контрагенты = ДокОбъект.Контрагент;
		НС.СубконтоДт.Договоры = ДокОбъект.Договор;
		НС.СчетКт = Сч76_02;
		НС.СубконтоКт.Контрагенты = ДокОбъект.Контрагент;
		НС.СубконтоКт.Договоры = ДокОбъект.Договор;
		НС.Сумма = ДокОбъект.Сумма;
		
		СуммаДохода = ДокОбъект.Сумма - ТЗТовары.Итог("Сумма");
		Если СуммаДохода>0 Тогда 
			НС = ДокОбъект.Движения.Хозрасчетный.Добавить();
			НС.Содержание = ДокОбъект.Метаданные().ПредставлениеОбъекта;
			НС.Период = ДокОбъект.Дата;
			НС.Организация = ДокОбъект.Организация;
			НС.СчетДт = Сч76_02;
			НС.СубконтоДт.Контрагенты = ДокОбъект.Контрагент;
			НС.СубконтоДт.Договоры = ДокОбъект.Договор;
			НС.СчетКт = Сч91_01;
			НС.Сумма = СуммаДохода;
		Иначе
			НС = ДокОбъект.Движения.Хозрасчетный.Добавить();
			НС.Содержание = ДокОбъект.Метаданные().ПредставлениеОбъекта;
			НС.Период = ДокОбъект.Дата;
			НС.Организация = ДокОбъект.Организация;
			НС.СчетДт = Сч91_02;
			НС.СчетКт = Сч76_02;
			НС.СубконтоКт.Контрагенты = ДокОбъект.Контрагент;
			НС.СубконтоКт.Договоры = ДокОбъект.Договор;
			НС.Сумма = -СуммаДохода;
		КонецЕсли;
	КонецЕсли;
	////НДС не формируем
	//Если ДокОбъект.ДополнительныеСвойства.Свойство("ТЗТоварыССериями") Тогда
	//	ТЗНдс = ДокОбъект.ДополнительныеСвойства.ТЗТоварыССериями.Скопировать();
	//Иначе
	//	ТЗНдс = ДокОбъект.ТЧТовары.Выгрузить();
	//КонецЕсли;
	//ТЗНдс.Свернуть(,"СуммаНДС");
	//Для Каждого Стр из ТЗНдс Цикл 
	//	НС = ДокОбъект.Движения.Хозрасчетный.Добавить();
	//	НС.Период = ДокОбъект.Дата;
	//	НС.Организация = ДокОбъект.Организация;
	//	Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.КорректировкаПоступления") Тогда
	//		НС.СчетДт = Сч19_03;
	//		НС.СубконтоДт.Контрагенты = ДокОбъект.Контрагент;
	//		НС.СубконтоДт.СФПолученные = ДокОбъект.Ссылка;
	//		НС.СчетКт = Сч60_1;
	//		НС.СубконтоКт.Контрагенты = ДокОбъект.Контрагент;
	//		НС.СубконтоКт.Договоры = ДокОбъект.Договор;
	//	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ВозвратПоставщику") Тогда
	//		НС.СчетДт = Сч60_1;
	//		НС.СубконтоДт.Контрагенты = ДокОбъект.Контрагент;
	//		НС.СубконтоДт.Договоры = ДокОбъект.Договор;
	//		НС.СчетКт = Сч19_03;
	//		НС.СубконтоКт.Контрагенты = ДокОбъект.Контрагент;
	//		НС.СубконтоКт.СФПолученные = ДокОбъект.Ссылка;
	//	КонецЕсли;
	//	НС.Сумма = ?(ЭтоКорректировка,-Стр.СуммаНДС,Стр.СуммаНДС);
	//КонецЦикла;
КонецПроцедуры

Процедура ДвижениеРеализацияТоваров(ДокОбъект,ТЗТовары) 
	Сч41_1 = ПланыСчетов.Хозрасчетный.ТоварыНаСкладах;
	Сч62_1 = ПланыСчетов.Хозрасчетный.РасчетыСПокупателями;
	Сч90_02_1 = ПланыСчетов.Хозрасчетный.СебестоимостьПродажНеЕНВД;
	Сч90_01_1 = ПланыСчетов.Хозрасчетный.ВыручкаНеЕНВД;
	Сч90_3 = ПланыСчетов.Хозрасчетный.Продажи_НДС;
	Сч68_02 = ПланыСчетов.Хозрасчетный.НДС;
	ЭтоКорректировка = Не ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.РеализацияТоваровУслуг");
	ТЗТовары.Свернуть("ВидДвижения,МестоХранения,Номенклатура","Количество,Сумма");
	Для Каждого Стр Из ТЗТовары Цикл
		НС = ДокОбъект.Движения.Хозрасчетный.Добавить();
		НС.Содержание = ДокОбъект.Метаданные().ПредставлениеОбъекта;
		НС.Период = ДокОбъект.Дата;
		НС.Организация = ДокОбъект.Организация; 
		Приход = Стр.ВидДвижения = ВидДвиженияНакопления.Приход;
		НС.СчетДт = Сч90_02_1;
		НС.СубконтоДт.НоменклатурныеГруппы = Стр.Номенклатура.ТоварнаяГруппа;
		НС.СчетКт = Сч41_1;                                            
		НС.СубконтоКт.Номенклатура = Стр.Номенклатура;
		НС.СубконтоКт.МестаХранения = ДокОбъект.МестоХранения;
		НС.КоличествоКт = ?(Приход,-Стр.Количество,Стр.Количество);
		НС.Сумма = ?(Приход,-Стр.Сумма,Стр.Сумма);
	КонецЦикла; 
	Если ДокОбъект.ДополнительныеСвойства.Свойство("ТЗТоварыССериями") Тогда
		ТЗТоварыССериями = ДокОбъект.ДополнительныеСвойства.ТЗТоварыССериями.Скопировать();
	Иначе
		ТЗТоварыССериями = ДокОбъект.ТЧТовары.Выгрузить();
	КонецЕсли;
	Для Каждого Стр из ТЗТоварыССериями Цикл 
		НС = ДокОбъект.Движения.Хозрасчетный.Добавить();
		НС.Содержание = ДокОбъект.Метаданные().ПредставлениеОбъекта;
		НС.Период = ДокОбъект.Дата;
		НС.Организация = ДокОбъект.Организация; 
		НС.СчетДт = Сч62_1;
		НС.СубконтоДт.Контрагенты = ДокОбъект.Контрагент;
		НС.СубконтоДт.Договоры = ДокОбъект.Договор;
		НС.СчетКт = Сч90_01_1;
		НС.СубконтоКт.НоменклатурныеГруппы = Стр.Номенклатура.ТоварнаяГруппа;
		НС.СубконтоКт.Номенклатура = Стр.Номенклатура;
		НС.СубконтоКт.СтавкиНДС = Стр.СтавкаНДС;
		НС.КоличествоКт = ?(ЭтоКорректировка,-Стр.Количество,Стр.Количество);
		НС.Сумма = ?(ЭтоКорректировка,-Стр.СуммаСНДС,Стр.СуммаСНДС);
	КонецЦикла;
	
	////НДС не формируем
	//ТЗНдс = ДокОбъект.ТЧТовары.Выгрузить();
	//ТЗНдс.Свернуть("Номенклатура,СтавкаНДС","СуммаНДС");
	//Если ЭтоКорректировка Тогда
	//	ТЗНдс.очистить();
	//	Для Каждого Стр из ДокОбъект.ТЧТовары Цикл
	//		Если Стр.СтавкаНДС = Стр.СтавкаНДСДоКорректировки 
	//			И Стр.СуммаНДС = Стр.СуммаНДСДоКорректировки Тогда 
	//			Продолжить;
	//		КонецЕсли;
	//		Если Стр.СтавкаНДС = Стр.СтавкаНДСДоКорректировки Тогда 
	//			НС = ТЗНдс.Добавить(); 
	//			НС.СтавкаНДС = Стр.СтавкаНДС;
	//			НС.СуммаНДС = Стр.СуммаНДСДоКорректировки - Стр.СуммаНДС;
	//		Иначе
	//			НС = ТЗНдс.Добавить(); 
	//			НС.СтавкаНДС = Стр.СтавкаНДСДоКорректировки;
	//			НС.СуммаНДС = -Стр.СуммаНДСДоКорректировки;
	//			НС = ТЗНдс.Добавить(); 
	//			НС.СтавкаНДС = Стр.СтавкаНДС;
	//			НС.СуммаНДС = Стр.СуммаНДС;
	//		КонецЕсли;
	//	КонецЦикла;
	//	ТЗНдс.Свернуть("Номенклатура,СтавкаНДС","СуммаНДС");
	//КонецЕсли;
	//ТЗНдс.Колонки.Добавить("ТоварнаяГруппа");
	//Для Каждого Стр из ТЗНдс Цикл
	//	Стр.ТоварнаяГруппа = Стр.Номенклатура.ТоварнаяГруппа;
	//КонецЦикла;
	//ТЗНдс.Свернуть("ТоварнаяГруппа,СтавкаНДС","СуммаНДС");
	//Для Каждого Стр из ТЗНдс Цикл 
	//	НС = ДокОбъект.Движения.Хозрасчетный.Добавить();
	//	НС.Период = ДокОбъект.Дата;
	//	НС.Организация = ДокОбъект.Организация;
	//	НС.СчетДт = Сч90_3;
	//	НС.СубконтоДт.НоменклатурныеГруппы = Стр.ТоварнаяГруппа;
	//	НС.СубконтоДт.СтавкиНДС = Стр.СтавкаНДС;
	//	НС.СчетКт = Сч68_02;
	//	НС.Сумма = ?(ЭтоКорректировка,-Стр.СуммаНДС,Стр.СуммаНДС);
	//КонецЦикла;
КонецПроцедуры

Процедура ДвижениеСписаниеОприходованиеТоваров(ДокОбъект,ТЗТовары)
	Сч41_1 = ПланыСчетов.Хозрасчетный.ТоварыНаСкладах;
	Сч91_01 = ПланыСчетов.Хозрасчетный.ПрочиеДоходы;
	Сч94 = ПланыСчетов.Хозрасчетный.НедостачиИПотериОтПорчиЦенностей;
	Для Каждого Стр Из ТЗТовары Цикл
		НС = ДокОбъект.Движения.Хозрасчетный.Добавить();
		НС.Содержание = ДокОбъект.Метаданные().ПредставлениеОбъекта;
		НС.Период = ДокОбъект.Дата;
		НС.Организация = ДокОбъект.Организация; 
		Если Стр.ВидДвижения = ВидДвиженияНакопления.Приход Тогда 
			НС.СчетДт = Сч41_1;
			НС.СубконтоДт.Номенклатура = Стр.Номенклатура;
			НС.СубконтоДт.МестаХранения = Стр.МестоХранения;
			НС.КоличествоДт = Стр.Количество;
			НС.СчетКт = Сч91_01;
		Иначе 
			НС.СчетДт = Сч94;
			НС.СчетКт = Сч41_1;
			НС.СубконтоКт.Номенклатура = Стр.Номенклатура;
			НС.СубконтоКт.МестаХранения = Стр.МестоХранения;
			НС.КоличествоКт = Стр.Количество;
		КонецЕсли;
		НС.Сумма = Стр.Сумма;
	КонецЦикла;
КонецПроцедуры

Процедура ДвижениеПеремещениеТоваров(ДокОбъект,ТЗТовары)
	Сч41_1 = ПланыСчетов.Хозрасчетный.ТоварыНаСкладах;
	Мас = ТЗТовары.НайтиСтроки(Новый Структура("ВидДвижения",ВидДвиженияНакопления.Расход));
	Для Каждого Стр Из Мас Цикл
		НС = ДокОбъект.Движения.Хозрасчетный.Добавить();
		НС.Содержание = "Перемещение товаров";
		НС.Период = ДокОбъект.Дата;
		НС.Организация = ДокОбъект.Организация; 
		НС.СчетДт = Сч41_1;
		НС.СубконтоДт.Номенклатура = Стр.Номенклатура;
		НС.СубконтоДт.МестаХранения = ДокОбъект.МестоХранения;
		НС.КоличествоДт = Стр.Количество;
		НС.СчетКт = Сч41_1;
		НС.СубконтоКт.Номенклатура = Стр.Номенклатура;
		НС.СубконтоКт.МестаХранения = ДокОбъект.МестоХраненияОприходование;
		НС.КоличествоКт = Стр.Количество;
		НС.Сумма = Стр.Сумма;
	КонецЦикла;
КонецПроцедуры

Процедура ДвижениеВыпускПродукции(ДокОбъект,ТЗТовары)
	Сч41_1 = ПланыСчетов.Хозрасчетный.ТоварыНаСкладах;
	Сч20 = ПланыСчетов.Хозрасчетный.ОсновноеПроизводство;
	Для Каждого Стр Из ТЗТовары Цикл
		НС = ДокОбъект.Движения.Хозрасчетный.Добавить();
		НС.Период = ДокОбъект.Дата;
		НС.Организация = ДокОбъект.Организация;
		Если Стр.ВидДвижения = ВидДвиженияНакопления.Расход Тогда 
			НС.Содержание = "Отпуск материалов в производство";
			НС.СчетДт = Сч20;
			НС.СчетКт = Сч41_1;
			НС.СубконтоКт.Номенклатура = Стр.Номенклатура;
			НС.СубконтоКт.МестаХранения = ДокОбъект.МестоХранения;
			НС.КоличествоКт = Стр.Количество;
		Иначе
			НС.Содержание = "Выпуск продукции";
			НС.СчетДт = Сч41_1;
			НС.СубконтоДт.Номенклатура = Стр.Номенклатура;
			НС.СубконтоДт.МестаХранения = ДокОбъект.МестоХраненияОприходование;
			НС.КоличествоДт = Стр.Количество;
			НС.СчетКт = Сч20;
		КонецЕсли;
		НС.Сумма = Стр.Сумма;
	КонецЦикла;
КонецПроцедуры

Процедура ДвижениеАктРазбора(ДокОбъект,ТЗТовары)
	Сч41_1 = ПланыСчетов.Хозрасчетный.ТоварыНаСкладах;
	ТЗПриход = ТЗТовары.Скопировать(Новый Структура("ВидДвижения",ВидДвиженияНакопления.Приход));
	Для Каждого Стр Из ТЗПриход Цикл
		НС = ДокОбъект.Движения.Хозрасчетный.Добавить();
		НС.Период = ДокОбъект.Дата;
		НС.Организация = ДокОбъект.Организация;
		НС.Содержание = "Акт разбора";
		НС.СчетДт = Сч41_1;
		НС.СубконтоДт.Номенклатура = Стр.Номенклатура;
		НС.СубконтоДт.МестаХранения = ДокОбъект.МестоХранения;
		НС.КоличествоДт = Стр.Количество;
		НС.СчетКт = Сч41_1;
		НС.СубконтоКт.Номенклатура = ДокОбъект.Номенклатура;
		НС.СубконтоКт.МестаХранения = ДокОбъект.МестоХранения;
		НС.КоличествоКт = ?(ТЗПриход.Индекс(Стр) = 0, Стр.Количество, 0);
		НС.Сумма = Стр.Сумма;
	КонецЦикла;
КонецПроцедуры

Процедура ДвижениеПересортицаТоваров(ДокОбъект,ТЗТовары)
	//Сч41_1 = ПланыСчетов.Хозрасчетный.ТоварыНаСкладах;
	//ТЗПриход = ТЗТовары.Скопировать(Новый Структура("ВидДвижения",ВидДвиженияНакопления.Приход));
	//Для Каждого Стр Из ТЗПриход Цикл
	//	НС = ДокОбъект.Движения.Хозрасчетный.Добавить();
	//	НС.Период = ДокОбъект.Дата;
	//	НС.Организация = ДокОбъект.Организация;
	//	НС.Содержание = "Акт разбора";
	//	НС.СчетДт = Сч41_1;
	//	НС.ПодразделениеДт = ДокОбъект.Подразделение;
	//	НС.СубконтоДт.Номенклатура = Стр.Номенклатура;
	//	НС.СубконтоДт.МестаХранения = ДокОбъект.МестоХранения;
	//	НС.КоличествоДт = Стр.Количество;
	//	НС.СчетКт = Сч41_1;
	//	НС.ПодразделениеКт = ДокОбъект.Подразделение;
	//	НС.СубконтоКт.Номенклатура = ДокОбъект.Номенклатура;
	//	НС.СубконтоКт.МестаХранения = ДокОбъект.МестоХранения;
	//	НС.КоличествоКт = ?(ТЗПриход.Индекс(Стр) = 0, Стр.Количество, 0);
	//	НС.Сумма = Стр.Сумма;
	//КонецЦикла;
КонецПроцедуры

Функция ДобавитьДвижение(ДокОбъект, СчётДт, СчётКт, Количество, Сумма, Валюта, ДанныеСубконто)
	НС = ДокОбъект.Движения.Хозрасчетный.Добавить();
	НС.Период = ДокОбъект.Дата;
	НС.Организация = ДокОбъект.Организация;
	НС.СчетДт = СчётДт;
	НС.СчетКт = СчётКт;
	Если Количество > 0 и НС.СчетДт.Количественный Тогда
		НС.КоличествоДт = Количество;	
	КонецЕсли;
	Если Количество > 0 и НС.СчетКт.Количественный Тогда
		НС.КоличествоКт = Количество;	
	КонецЕсли;
	Если СчётДт.Валютный Тогда
		НС.ВалютнаяСуммаДт = Сумма;
		НС.ВалютаДт = Валюта;
	КонецЕсли;
	Если СчётКт.Валютный Тогда
		НС.ВалютнаяСуммаКт = Сумма;
		НС.ВалютаКт = Валюта;
	КонецЕсли;
	НС.Сумма = Сумма;
	НС.Содержание = ДокОбъект.Метаданные().ПредставлениеОбъекта;
	// Заполняем субконто
	ПВХ = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные;
	// Дт
	Для Каждого Стр Из НС.СчетДт.ВидыСубконто Цикл
		ИмяСубконто = Стр.ВидСубконто.ИмяПредопределенныхДанных;
        НС.СубконтоДт.Вставить(Стр.ВидСубконто, ДанныеСубконто[ИмяСубконто]);
	КонецЦикла;
	// Кт
	Для Каждого Стр Из НС.СчетКт.ВидыСубконто Цикл
		ИмяСубконто = Стр.ВидСубконто.ИмяПредопределенныхДанных;
        НС.СубконтоКт.Вставить(Стр.ВидСубконто, ДанныеСубконто[ИмяСубконто]);
	КонецЦикла;
	Возврат НС;	
КонецФункции
