
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ДатаПоступления = ТекущаяДатаСеанса();
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ЗначениеЗаполнено(НомерГТД) Тогда
		ПроверяемыеРеквизиты.Добавить("СтранаПроисхождения");	
	КонецЕсли;	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Адресная = ТЧПокупатели.Количество()>0;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	ШК = РегистрыСведений.ШтрихкодыНоменклатуры.ПолучитьШК(Ссылка.Владелец,,Ссылка);
	Если ШК = "" Тогда
		НЗ = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();
		НЗ.Штрихкод = РегистрыСведений.ШтрихкодыНоменклатуры.СформироватьEAN13();
		НЗ.Номенклатура = Ссылка.Владелец;
		НЗ.Серия = Ссылка;
		НЗ.Записать(Истина);
	КонецЕсли;
КонецПроцедуры
