
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	РаботаСДокументами.ЗаполнитьРеквизитыПоУмолчанию(ЭтотОбъект);
	НачалоПериода = НачалоМесяца(ТекущаяДатаСеанса());
	КонецПериода = ТекущаяДатаСеанса();
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = ПараметрыСеанса.Пользователь;
КонецПроцедуры

#Область Дополнительно

Процедура ПолучитьОстаткиИОборотыПоКонтрагенту(ПоДаннымОрганизации = Истина) Экспорт
	Рез = Документы.СверкаВзаиморасчётов.ПолучитьОстаткиИОборотыПоКонтрагенту(Организация, Контрагент, Договор, НачалоПериода, КонецПериода, ПоДаннымОрганизации);
	ТЗ = Рез[0].Выгрузить();
	Если ТЗ.Количество() > 0 Тогда 
		НачальныйОстаток = ТЗ.Итог("НачальныйОстаток");
		КонечныйОстаток = ТЗ.Итог("КонечныйОстаток");
	КонецЕсли;
	Если ПоДаннымОрганизации Тогда
		ТЧПоДаннымОрганизации.Очистить();	
	Иначе
		ТЧПоДаннымКонтрагента.Очистить();	
	КонецЕсли;	
	Выб = Рез[1].Выбрать(); 
	Пока Выб.Следующий() Цикл
		Если ПоДаннымОрганизации Тогда
			НС = ТЧПоДаннымОрганизации.Добавить();
			НС.Дебет = Выб.Дебет;
			НС.Кредит = Выб.Кредит;
		Иначе
			НС = ТЧПоДаннымКонтрагента.Добавить();
			НС.Дебет = Выб.Кредит;
			НС.Кредит = Выб.Дебет;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(НС, Выб,, "Дебет, Кредит");
		НС.ДокументПредставление = СформироватьПредставлениеДокументаДляКлиента(НС.ДокументРегистратор);	
	КонецЦикла;	
КонецПроцедуры

Функция СформироватьПредставлениеДокументаДляКлиента(Док) Экспорт
	Результат = "";
	Если ТипЗнч(Док) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		ДатаДокумента = ?(ЗначениеЗаполнено(Док.ДатаВходящегоДокумента), Док.ДатаВходящегоДокумента, Док.Дата);
		Результат = "Накладная №" + 
			?(ЗначениеЗаполнено(Док.НомерВходящегоДокумента), СокрЛП(Док.НомерВходящегоДокумента), РаботаСДокументами.СформироватьЦифровойНомер(Док.Номер)) +
			" от " + Формат(ДатаДокумента, "ДФ='dd.MM.yyyy ""г.""'");
	ИначеЕсли ТипЗнч(Док) = Тип("ДокументСсылка.ВозвратПоставщику") Тогда
		Основание = Док.Основание;
		Результат = "Накладная (Возврат) №";
		Если ЗначениеЗаполнено(Основание) Тогда
	   		Результат = Результат + 
				?(ЗначениеЗаполнено(Основание.НомерВходящегоДокумента), СокрЛП(Основание.НомерВходящегоДокумента), РаботаСДокументами.СформироватьЦифровойНомер(Док.Номер)) +
				" от " + Формат(Док.Дата, "ДФ='dd.MM.yyyy ""г.""'");
		Иначе		
			Результат = Результат + РаботаСДокументами.СформироватьЦифровойНомер(Док.Номер) +	" от " + Формат(Док.Дата, "ДФ='dd.MM.yyyy ""г.""'");
		КонецЕсли;
	ИначеЕсли ТипЗнч(Док) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Результат = "Накладная №" + РаботаСДокументами.СформироватьЦифровойНомер(Док.Номер) +	" от " + Формат(Док.Дата, "ДФ='dd.MM.yyyy ""г.""'");
	ИначеЕсли ТипЗнч(Док) = Тип("ДокументСсылка.ВозвратОтПокупателя") Тогда
		Основание = Док.Основание;
		Результат = "Накладная (Возврат) №";
		Если ЗначениеЗаполнено(Основание) Тогда
	   		Результат = Результат + РаботаСДокументами.СформироватьЦифровойНомер(Основание.Номер) + " от " + Формат(Док.Дата, "ДФ='dd.MM.yyyy ""г.""'");
		Иначе		
			Результат = Результат + РаботаСДокументами.СформироватьЦифровойНомер(Док.Номер) +	" от " + Формат(Док.Дата, "ДФ='dd.MM.yyyy ""г.""'");
		КонецЕсли;	
	Иначе
		Результат = СокрЛП(Док);	
	КонецЕсли;
	Возврат Результат;
КонецФункции	

#КонецОбласти

