
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	УстановитьПривилегированныйРежим(Истина);
	РаботаСДокументами.ЗаполнитьРеквизитыПоУмолчанию(ЭтотОбъект);
	ЦенаВключаетНДС = Истина;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		РаботаСДокументами.МожноСоздатьДокументНаОсновании(Метаданные.Документы.РеализацияТоваровУслуг, ДанныеЗаполнения);
		Дата = ТекущаяДатаСеанса();
		Основание = ДанныеЗаполнения;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Договор = ДанныеЗаполнения.Договор;
		Менеджер = ДанныеЗаполнения.Менеджер;
		ЦенаВключаетНДС = ДанныеЗаполнения.ЦенаВключаетНДС;
		ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиенту;
		Комментарий = ДанныеЗаполнения.Комментарий;
		Организация = ДанныеЗаполнения.Организация;
		//Рез = Документы.ЗаказПокупателя.ПолучитьТоварыПоГруппировкам(ДанныеЗаполнения);
		//ВыбГруппа = Рез.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		//Пока ВыбГруппа.Следующий() Цикл
		//	Выб = ВыбГруппа.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		//	Пока Выб.Следующий() Цикл
		//    	СтрОснование = ДанныеЗаполнения.ТЧТовары.Найти(Выб.КодСтроки, "КодСтроки");
		//		НС = ТЧТовары.Добавить();
		//		ЗаполнитьЗначенияСвойств(НС, СтрОснование);
		//	КонецЦикла;	
		//КонецЦикла;
		ТЧТовары.Загрузить(ДанныеЗаполнения.ТЧТовары.Выгрузить());
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		Организация = ДанныеЗаполнения.Организация;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Договор = ОбщегоНазначенияВызовСервера.ПолучитьОсновнойДоговор(Контрагент, Организация, Истина); 
		МестоХранения = ДанныеЗаполнения.МестоХранения;
		Основание = ДанныеЗаполнения;		
		ЦенаВключаетНДС = ДанныеЗаполнения.ЦенаВключаетНДС;
		ТЧТовары.Загрузить(ДанныеЗаполнения.ТЧТовары.Выгрузить());
		ТЧСерии.Загрузить(ДанныеЗаполнения.ТЧСерии.Выгрузить());
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	УстановитьПривилегированныйРежим(Истина);
	РаботаСДокументами.УстановитьЗаписьВсехРегистров(Движения);
	// Данные для проведения
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ТЗТоварыССериями", СерииИРазмещение.ОбъединитьТоварыССериями(ЭтотОбъект));
	// Блокировки
	Блокировка = Новый БлокировкаДанных;
	УправляемыеБлокировки.ТоварыВНаличии(Блокировка, ТЧТовары, МестоХранения);
	УправляемыеБлокировки.ВзаиморасчётыСПокупателями(Блокировка, Контрагент);

	Блокировка.Заблокировать();
	// Формируем
	Отказ = Не РегистрыНакопления.ТоварыВНаличии.СформироватьДвижения(ЭтотОбъект);
	Если Отказ Тогда Возврат КонецЕсли;
	РегистрыНакопления.ВзаиморасчётыСПокупателями.СформироватьДвижения(ЭтотОбъект);
	РегистрыНакопления.ВзаиморасчётыСПоставщиками.СформироватьПоДопРасходам(ЭтотОбъект,Константы.ВалютаРегламентированногоУчета.Получить());
	РегистрыНакопления.Продажи.СформироватьДвижения(ЭтотОбъект); // Рассчитывается на основании списанных партий и издержек
	// Записываем
	Движения.Записать();
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	РаботаСДокументами.МожноСоздатьДокументНаОсновании(Метаданные.Документы.РеализацияТоваровУслуг, Основание);
	Ответственный = ПараметрыСеанса.Пользователь;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	РаботаСДокументами.МожноРедактироватьДокумент(ЭтотОбъект, Отказ);
	Менеджер = РегистрыСведений.КураторыДоговоров.ПолучитьПоследнее(ЭтотОбъект.Дата, Новый Структура("Договор", ЭтотОбъект.Договор)).Куратор;
	//РаботаСДокументами.ПроверкаСоответствияВозвратовРеализации(ЭтотОбъект, РежимЗаписи, Отказ);
	ЭтотОбъект.ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	РаботаСДокументами.ЗаполнитьИтогиДокумента(ЭтотОбъект);
КонецПроцедуры 

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.НакладнаяПоОтгрузкамТовара Тогда 
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("МестоХранения"));
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)    
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Основание) Тогда
		
		ЗаписыватьСтатус = Ложь;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ИсторияЗаказовПокупателейПоСтатусамСрезПоследних.ЗаказПокупателя КАК ЗаказПокупателя,
		|	ИсторияЗаказовПокупателейПоСтатусамСрезПоследних.СтатусЗаказаПокупателя КАК СтатусЗаказаПокупателя
		|ИЗ
		|	РегистрСведений.ИсторияЗаказовПокупателейПоСтатусам.СрезПоследних(, ЗаказПокупателя = &ЗаказПокупателя) КАК ИсторияЗаказовПокупателейПоСтатусамСрезПоследних";
		Запрос.УстановитьПараметр("ЗаказПокупателя",Ссылка.Основание); 
		
		Выборка = Запрос.Выполнить().Выгрузить();
		
		Если Выборка.Количество() = 0 Тогда 
			ЗаписыватьСтатус = Истина;
			СтатусЗаписи = Перечисления.СтатусыЗаказовПокупателя.Собран;  
		Иначе 
			СтатусЗаписи = Выборка[0].СтатусЗаказаПокупателя; 
			Если СтатусЗаписи = Перечисления.СтатусыЗаказовПокупателя.Новый 
				или СтатусЗаписи = Перечисления.СтатусыЗаказовПокупателя.ВРаботе Тогда 
				ЗаписыватьСтатус = Истина;
				СтатусЗаписи = Перечисления.СтатусыЗаказовПокупателя.Собран;  
			Иначе
				ЗаписыватьСтатус = Ложь;
			КонецЕсли;   
		КонецЕсли; 
		
		Если ЗаписыватьСтатус = Истина тогда
			НоваяЗапись = РегистрыСведений.ИсторияЗаказовПокупателейПоСтатусам.СоздатьМенеджерЗаписи();
			НоваяЗапись.Период = ТекущаяДата();	
			НоваяЗапись.СрокОплаты =  РаботаСДокументами.ПолучитьСрокОплаты(Контрагент,?(Ссылка.Пустая(),ТекущаяДата(),Дата));
			НоваяЗапись.ДокументПродажи = Ссылка;
			НоваяЗапись.ЗаказПокупателя = Ссылка.Основание;
			НоваяЗапись.СтатусЗаказаПокупателя = СтатусЗаписи; 
			НоваяЗапись.Записать(Ложь);	
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры
