
&НаСервере
Функция СоздатьДокументыНаСервере()
	Успешно = Истина;
	ТекДата = Объект.Период.ДатаНачала;
	ДатаПо = НачалоДня(Объект.Период.ДатаОкончания);
	Пока ТекДата <= ДатаПо Цикл
		Н = 0;
		Для Н = 1 по Объект.КоличествоДокументов Цикл
			Док = Документы.НалоговаяНакладная.СоздатьДокумент();
			Док.Дата = ТекДата;
			Док.ДатаИнвойса = ТекДата;
			Док.Организация = Объект.Организация;
			Док.Контрагент = Объект.Контрагент;
			Док.МестоХранения = Объект.МестоХранения;
			Док.Ответственный = ПараметрыСеанса.Пользователь;
			Попытка
				Док.Записать(РежимЗаписиДокумента.Запись);
			Исключение
				Успешно = Ложь;
				Прервать;
			КонецПопытки;
		КонецЦикла;
		Если Не Успешно Тогда
			Прервать;
		КонецЕсли;
		ТекДата = ТекДата + 86400;
	КонецЦикла;
	Возврат Успешно;	
КонецФункции

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	Успешно = СоздатьДокументыНаСервере();
	Если Успешно Тогда 
		ТекстСообщения = НСтр("fr = 'Documents créés'; ru = 'Документы созданы'; en = 'Documents have been created'; es = 'Documentos creados'");
		ОповеститьОбИзменении(Тип("ДокументСсылка.НалоговаяНакладная"));
	Иначе
		ТекстСообщения = НСтр("fr = 'Erreur lors de la création des documents. Contactez votre administrateur.'; ru = 'Ошибка при создании документов. Обратитесь к администратору'; en = 'Error when creating documents. Contact the administrator'; es = 'Error al crear documentos. Póngase en contacto con el administrador'");
	КонецЕсли;
	ПоказатьПредупреждение(,ТекстСообщения,10);
КонецПроцедуры
