
Функция ПолучитьВыходные(НачалоПериода, КонецПериода) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПроизводственныйКалендарь.Дата КАК Дата
	                      |ИЗ
	                      |	РегистрСведений.ПроизводственныйКалендарь КАК ПроизводственныйКалендарь
	                      |ГДЕ
	                      |	ПроизводственныйКалендарь.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Дата");
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Дата");
КонецФункции

Функция ПолучитьКалендарь(НачалоПериода, КонецПериода) Экспорт
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	ТЗ.Колонки.Добавить("ЭтоВыходной", Новый ОписаниеТипов("Булево"));
	МасВыходные = ПолучитьВыходные(НачалоПериода, КонецПериода);
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВЫРАЗИТЬ(&НачалоПериода КАК ДАТА) КАК ДатаПериода
	                      |ИТОГИ ПО
	                      |	ДатаПериода ПЕРИОДАМИ(ДЕНЬ, &НачалоПериода, &КонецПериода)");
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Выб = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ДатаПериода", "ВСЕ");
	Пока Выб.Следующий() Цикл
		НС = ТЗ.Добавить();
		НС.Дата = Выб.ДатаПериода;
		НС.ЭтоВыходной = МасВыходные.Найти(Выб.ДатаПериода) <> Неопределено; 
	КонецЦикла;	
	Возврат ТЗ;
КонецФункции

// Параметры:
//	СЗ - Список значений с датами выходных дней
// Пояснение:
//	Из списка дат берутся года по которым все данные удаляются и запишутся новые из списка дат
Процедура ПерезаписатьВыходные(СЗ) Экспорт
	ТЗДаты = Новый ТаблицаЗначений;
	ТЗДаты.Колонки.Добавить("Год", Новый ОписаниеТипов("Число"));
	ТЗДаты.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
    Для Каждого Стр Из СЗ Цикл
		НС = ТЗДаты.Добавить();
		НС.Дата = Стр.Значение;
		НС.Год = Год(Стр.Значение);
	КонецЦикла;
    ТЗДаты.Свернуть("Дата, Год");	
	ТЗГода = ТЗДаты.Скопировать();
	ТЗГода.Свернуть("Год");
	// Удаляем старые записи
	Для Каждого Стр Из ТЗГода Цикл
		НачалоПериода = НачалоГода(Дата(Стр.Год, 1, 1));
		КонецПериода = КонецДня(КонецГода(НачалоПериода));
		НЗ = РегистрыСведений.ПроизводственныйКалендарь.СоздатьНаборЗаписей();
		НЗ.Отбор.Дата.ЗначениеС = НачалоПериода;
		НЗ.Отбор.Дата.ЗначениеПо = КонецПериода;
		НЗ.Прочитать();
		НЗ.Очистить();
		МасДаты = ТЗДаты.НайтиСтроки(Новый Структура("Год", Стр.Год));
		Для Каждого МасСтр Из МасДаты Цикл
			НС = НЗ.Добавить();
			НС.Дата = МасСтр.Дата;	
		КонецЦикла;	
		НЗ.Записать(Истина);
	КонецЦикла;
КонецПроцедуры

Функция ВыходнойДень(Дата) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПроизводственныйКалендарь.Дата
	                      |ИЗ
	                      |	РегистрСведений.ПроизводственныйКалендарь КАК ПроизводственныйКалендарь
	                      |ГДЕ
	                      |	ПроизводственныйКалендарь.Дата = &Дата");
	Запрос.УстановитьПараметр("Дата", НачалоДня(Дата));
	Рез = Запрос.Выполнить();
	Возврат Не Рез.Пустой();
КонецФункции

