
Процедура ВзаиморасчётыСКонтрагентамиПрочее(Блокировка, Контрагент) Экспорт
	Эл = Блокировка.Добавить("РегистрНакопления.ВзаиморасчётыСКонтрагентамиПрочие");
	Эл.Режим = РежимБлокировкиДанных.Исключительный;
	Эл.УстановитьЗначение("Контрагент", Контрагент);
КонецПроцедуры

Процедура ВзаиморасчётыСПокупателями(Блокировка, Контрагент) Экспорт
	Эл = Блокировка.Добавить("РегистрНакопления.ВзаиморасчётыСПокупателями");
	Эл.Режим = РежимБлокировкиДанных.Исключительный;
	Эл.УстановитьЗначение("Контрагент", Контрагент);
КонецПроцедуры

Процедура ВзаиморасчётыСПоставщиками(Блокировка, Контрагент) Экспорт
	Эл = Блокировка.Добавить("РегистрНакопления.ВзаиморасчётыСПоставщиками");
	Эл.Режим = РежимБлокировкиДанных.Исключительный;
	Эл.УстановитьЗначение("Контрагент", Контрагент);
КонецПроцедуры

Процедура ТоварыВНаличии(Блокировка, ИсточникДанных, МестоХранения = Неопределено) Экспорт
	Эл = Блокировка.Добавить("РегистрНакопления.ТоварыВНаличии");
	Эл.Режим = РежимБлокировкиДанных.Исключительный;
	Эл.ИсточникДанных = ИсточникДанных;
	Если ЗначениеЗаполнено(МестоХранения) Тогда
		Эл.УстановитьЗначение("МестоХранения", МестоХранения);
	КонецЕсли;
	Эл.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	// Дополнительные расходы
	ДополнительныеРасходы(Блокировка, ИсточникДанных, МестоХранения);
КонецПроцедуры

Процедура ДополнительныеРасходы(Блокировка, ИсточникДанных, МестоХранения = Неопределено) Экспорт
	Эл = Блокировка.Добавить("РегистрНакопления.ДополнительныеРасходы");
	Эл.Режим = РежимБлокировкиДанных.Исключительный;
	Эл.ИсточникДанных = ИсточникДанных;
	Если ЗначениеЗаполнено(МестоХранения) Тогда
		Эл.УстановитьЗначение("МестоХранения", МестоХранения);
	КонецЕсли;	
	Эл.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
КонецПроцедуры

Процедура ТоварыВПереработке(Блокировка, ИсточникДанных, Контрагент) Экспорт
	Эл = Блокировка.Добавить("РегистрНакопления.ТоварыВПереработке");
	Эл.Режим = РежимБлокировкиДанных.Исключительный;
	Эл.ИсточникДанных = ИсточникДанных;
	Эл.УстановитьЗначение("Контрагент", Контрагент);
	Эл.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
КонецПроцедуры
