
#Область Формирование_движений

Процедура СформироватьДвижения(ДокОбъект) Экспорт	
	Если Не ОбщегоНазначенияВызовСервераПовтИсп.ЭтоРасчётыСКонтрагентамиПрочие(ДокОбъект.ХозяйственнаяОперация) Тогда Возврат КонецЕсли;
	Движения = ДокОбъект.Движения;
	Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПоступлениеБезналичныхДенежныхСредств") Тогда			
		СформироватьПоПлатёжномуДокументу(ДокОбъект, Ложь, ДокОбъект.Сумма);
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.СписаниеБезналичныхДенежныхСредств") Тогда			
		СформироватьПоПлатёжномуДокументу(ДокОбъект, Истина, ДокОбъект.Сумма);
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПриходныйКассовыйОрдер") Тогда
		СформироватьПоПлатёжномуДокументу(ДокОбъект, Ложь, ДокОбъект.Сумма);		
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.РасходныйКассовыйОрдер") Тогда	
		СформироватьПоПлатёжномуДокументу(ДокОбъект, Истина, ДокОбъект.Сумма);
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.КорректировкаДолга") Тогда
		Движения = ДокОбъект.Движения;
		Мас = ДокОбъект.ДополнительныеСвойства.ТЗКредиторскаяЗадолженность.НайтиСтроки(Новый Структура("Прочее", Истина));
		Для Каждого Стр Из Мас Цикл
			Движение(Движения, ДокОбъект.Дата, ДокОбъект.Организация, ДокОбъект.КонтрагентКредитор, , Стр.ОбъектРасчётов, Стр.Сумма, Ложь); 
		КонецЦикла;
		Мас = ДокОбъект.ДополнительныеСвойства.ТЗДебиторскаяЗадолженность.НайтиСтроки(Новый Структура("Прочее", Истина));	
		Для Каждого Стр Из Мас Цикл
			Движение(Движения, ДокОбъект.Дата, ДокОбъект.Организация, ДокОбъект.КонтрагентДебитор, , Стр.ОбъектРасчётов, Стр.Сумма, Истина);
		КонецЦикла;
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПрочиеРасходы") Тогда
		Движение(Движения, ДокОбъект.Дата, ДокОбъект.Организация, ДокОбъект.Контрагент, ДокОбъект.СтатьяДДС, ДокОбъект.Ссылка, ДокОбъект.Сумма, Ложь);
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПрочиеРасходыВозврат") Тогда
		Движение(Движения, ДокОбъект.Дата, ДокОбъект.Организация, ДокОбъект.Контрагент, ДокОбъект.СтатьяДДС, ДокОбъект.Ссылка, ДокОбъект.Сумма, Истина);
	КонецЕсли;
КонецПроцедуры

Процедура СформироватьПоПлатёжномуДокументу(ДокОбъект, Приход, СуммаРаспределения) 
	ДатаПроведения = ДокОбъект.Дата;
	Если Не ЗначениеЗаполнено(ДатаПроведения) Тогда Возврат КонецЕсли;
	Для Каждого Стр из ДокОбъект.ТЧОснования Цикл
		Движение(ДокОбъект.Движения, ДатаПроведения, ДокОбъект.Организация, ДокОбъект.Контрагент, ДокОбъект.СтатьяДДС, Стр.Основание, Стр.Сумма, Приход);
	КонецЦикла;
КонецПроцедуры

Процедура Движение(Движения, ДатаДвижения, Организация, Контрагент, СтатьяДДС, ОбъектРасчётов, Сумма, Приход = Истина)
	Если Сумма = 0 Тогда Возврат КонецЕсли;
	НС = Движения.ВзаиморасчётыСКонтрагентамиПрочие.Добавить();
	НС.ВидДвижения = ?(Приход, ВидДвиженияНакопления.Приход, ВидДвиженияНакопления.Расход);
	НС.Период = ДатаДвижения;
	НС.Организация = Организация;
	НС.Контрагент = Контрагент;
	НС.СтатьяДДС = СтатьяДДС;
	НС.ОбъектРасчётов = ОбъектРасчётов;
	НС.Сумма = Сумма;	
КонецПроцедуры

#КонецОбласти	

