
Процедура УдалитьДанные(Организация, ФизическоеЛицо) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЛицаСПравомПодписи.Период КАК Период,
	                      |	ЛицаСПравомПодписи.Организация КАК Организация,
	                      |	ЛицаСПравомПодписи.ТипОтветственного КАК ТипОтветственного
	                      |ИЗ
	                      |	РегистрСведений.ЛицаСПравомПодписи КАК ЛицаСПравомПодписи
	                      |ГДЕ
	                      |	ЛицаСПравомПодписи.Организация = &Организация
	                      |	И ЛицаСПравомПодписи.ФизическоеЛицо = &ФизическоеЛицо");
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	Выб = Запрос.Выполнить().Выбрать();
	Пока Выб.Следующий() Цикл
		МЗ = РегистрыСведений.ЛицаСПравомПодписи.СоздатьМенеджерЗаписи();
		МЗ.Период = Выб.Период;
		МЗ.Организация = Выб.Организация;
		МЗ.ТипОтветственного = Выб.ТипОтветственного;
		МЗ.Удалить();	
	КонецЦикла;	
КонецПроцедуры

Процедура ЗаписатьДанные(Период, Организация, ТипОтветственного, ФизическоеЛицо) Экспорт
	МЗ = РегистрыСведений.ЛицаСПравомПодписи.СоздатьМенеджерЗаписи();
	МЗ.Период = ?(ЗначениеЗаполнено(Период), Период, Дата(2000, 1, 1));
	МЗ.Организация = Организация;
	МЗ.ТипОтветственного = ТипОтветственного;
	МЗ.ФизическоеЛицо = ФизическоеЛицо;
	МЗ.Записать(Ложь);	
КонецПроцедуры
