
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	РаботаСДокументами.ЗаполнитьРеквизитыПоУмолчанию(ЭтотОбъект);
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НачислениеЗарплаты") Тогда
		Основание = ДанныеЗаполнения;
		Дата = ТекущаяДатаСеанса();
		МестоХранения = ДанныеЗаполнения.МестоХранения;
		МасСотрудники = ДанныеЗаполнения.ТЧСотрудники.Выгрузить().ВыгрузитьКолонку("Сотрудник");
		ТЗ = РегистрыНакопления.Зарплата.ПолучитьОстаткиПоСотрудникам(ЭтотОбъект,МасСотрудники);
		ТЧСотрудники.Загрузить(ТЗ);
	Иначе
		ВызватьИсключение("Документ можно создавать только на основании документа ""Начисление зарплаты""");
	КонецЕсли;		
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	УстановитьПривилегированныйРежим(Истина);
	РаботаСДокументами.УстановитьЗаписьВсехРегистров(Движения);
	//РегистрыНакопления.Зарплата.СформироватьДвижения(ЭтотОбъект);	
	Движения.Записать();
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = ПараметрыСеанса.Пользователь;
КонецПроцедуры




