
&НаКлиенте
Процедура НайтиПоКонтактнойИнформации(Команда)
	П = Новый Структура("РежимВыбора", Истина);
	Оп = Новый ОписаниеОповещения("ПослеЗакрытияФормыВыбораКонтактнойИнформации", ЭтаФорма);
	ОткрытьФорму("РегистрСведений.КонтактнаяИнформация.ФормаСписка", П, ЭтаФорма,,,, Оп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#Область Оповещения

&НаКлиенте
Процедура ПослеЗакрытияФормыВыбораКонтактнойИнформации(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если РезультатЗакрытия = Неопределено Тогда Возврат КонецЕсли;
	ПоказатьЗначение(, РезультатЗакрытия);
КонецПроцедуры

#КонецОбласти

	



