
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	РаботаСДокументами.ЗаполнитьРеквизитыПоУмолчанию(ЭтотОбъект);
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПрочиеРасходы") Тогда
		Дата = ТекущаяДатаСеанса();
		Основание = ДанныеЗаполнения;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Организация = ДанныеЗаполнения.Организация;
		МестоХранения = ДанныеЗаполнения.МестоХранения;
		СтатьяДДС = ДанныеЗаполнения.СтатьяДДС;
		ДатаОтгрузочногоДокумента = ДанныеЗаполнения.ДатаОтгрузочногоДокумента;
		НомерОтгрузочногоДокумента = ДанныеЗаполнения.НомерОтгрузочногоДокумента;
		Сумма = ДанныеЗаполнения.Сумма;
		ТЧРасходы.Загрузить(ДанныеЗаполнения.ТЧРасходы.Выгрузить());
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	УстановитьПривилегированныйРежим(Истина);
	РаботаСДокументами.УстановитьЗаписьВсехРегистров(Движения);
	// Формируем движения
	РегистрыНакопления.Убытки.СформироватьДвижения(ЭтотОбъект);
	РегистрыНакопления.ВзаиморасчётыСКонтрагентамиПрочие.СформироватьДвижения(ЭтотОбъект);
	// Записываем движения
	Движения.Записать();
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = ПараметрыСеанса.Пользователь;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	РаботаСДокументами.МожноРедактироватьДокумент(ЭтотОбъект, Отказ);
КонецПроцедуры
