
Процедура ПечатьПлатёжнаяВедомостьНаАванс(Док, Таб) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Таб.ОтображатьСетку = Ложь;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	Таб.АвтоМасштаб = Истина;
	Таб.КлючПараметровПечати = "Параметры_печати_Документ_ПлатёжнаяВедомостьНаАванс_ПлатёжнаяВедомостьНаАванс";	
	Макет = Документы.ПлатёжнаяВедомостьНаАванс.ПолучитьМакет("ПлатёжнаяВедомостьНаАванс");
	оШапка = Макет.ПолучитьОбласть("Шапка");
	оШапка.Параметры.Номер = Док.Номер;
	оШапка.Параметры.Дата = Формат(Док.Дата, "ДФ=dd.MM.yyyy");
	оШапка.Параметры.ПериодДокумента = Формат(Док.Дата, "ДФ='ММММ гггг'");
    Таб.Вывести(оШапка);
	оСтрока = Макет.ПолучитьОбласть("Строка");
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПлатёжнаяВедомостьНаАвансТЧСотрудники.Ссылка КАК Док,
	                      |	ПлатёжнаяВедомостьНаАвансТЧСотрудники.НомерСтроки КАК НомерСтроки,
	                      |	ПлатёжнаяВедомостьНаАвансТЧСотрудники.Сотрудник КАК Сотрудник,
	                      |	ПлатёжнаяВедомостьНаАвансТЧСотрудники.Сумма КАК Сумма
	                      |ИЗ
	                      |	Документ.ПлатёжнаяВедомостьНаАванс.ТЧСотрудники КАК ПлатёжнаяВедомостьНаАвансТЧСотрудники
	                      |ГДЕ
	                      |	ПлатёжнаяВедомостьНаАвансТЧСотрудники.Ссылка = &Док
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	НомерСтроки");
	Запрос.Параметры.Вставить("Док", Док);
	Выб = Запрос.Выполнить().Выбрать();
	Пока Выб.Следующий() Цикл
		оСтрока.Параметры.Заполнить(Выб);
		Таб.Вывести(оСтрока);
	КонецЦикла;
	оПодвал = Макет.ПолучитьОбласть("Подвал");
	оПодвал.Параметры.Итого = Док.ТЧСотрудники.Итог("Сумма");
	оПодвал.Параметры.Комментарий = Док.Комментарий;
	Таб.Вывести(оПодвал);
	Таб.ВывестиГоризонтальныйРазделительСтраниц();
КонецПроцедуры
