
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РаботаСДокументами.МожноРедактироватьДокументВФорме(Объект.Ссылка, ЭтаФорма);
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	РассчитатьИтоги(Истина);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить(РаботаСДокументами.СвойствоЗаписьИзФормы(), Истина);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, ТекущийОбъект);
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура ЗаполнитьПоДебиторскойЗадолженности(Команда)
	ЗаполнитьПоДебиторскойЗадолженностиНаСервере();
	РассчитатьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоКредиторскойЗадолженности(Команда)
	ЗаполнитьПоКредиторскойЗадолженностиНаСервере();
	РассчитатьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура ТЧДебиторскаяЗадолженностьПриИзменении(Элемент)
	РассчитатьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура ТЧДебетРасчётныйДокументПриИзменении(Элемент)
	ТекСтр = Элементы.ТЧДебиторскаяЗадолженность.ТекущиеДанные;
	Если ТипЗнч(ТекСтр.ОбъектРасчётов) = Тип("СправочникСсылка.ДоговорыСКонтрагентами") Тогда Возврат КонецЕсли;
	ТекСтр.Сумма = РаботаСДокументамиВызовСервера.ПолучитьСуммуДокумента(ТекСтр.ОбъектРасчётов);
КонецПроцедуры

&НаКлиенте
Процедура ТЧКредиторскаяЗадолженностьПриИзменении(Элемент)
	РассчитатьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура ТЧКредитРасчётныйДокументПриИзменении(Элемент)
	ТекСтр = Элементы.ТЧКредиторскаяЗадолженность.ТекущиеДанные;
	Если ТипЗнч(ТекСтр.ОбъектРасчётов) = Тип("СправочникСсылка.ДоговорыСКонтрагентами") Тогда Возврат КонецЕсли;
	ТекСтр.Сумма = РаботаСДокументамиВызовСервера.ПолучитьСуммуДокумента(ТекСтр.ОбъектРасчётов);
КонецПроцедуры

#КонецОбласти 

#Область Дополнительно

&НаКлиенте
Процедура РассчитатьИтоги(ТолькоРазницу = Ложь)
	Если Не ТолькоРазницу Тогда
		Объект.СуммаДебет = Объект.ТЧДебиторскаяЗадолженность.Итог("Сумма");
		Объект.СуммаКредит = Объект.ТЧКредиторскаяЗадолженность.Итог("Сумма");
	КонецЕсли;
	СуммаРазница = Объект.СуммаДебет - Объект.СуммаКредит;
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьПоДебиторскойЗадолженностиНаСервере()
	Объект.ТЧДебиторскаяЗадолженность.Очистить();
	ДатаСреза = РаботаСДокументамиВызовСервера.ПолучитьГраницуДокумента(Объект);
	ТЗ = ПолучитьЗадолженность(ДатаСреза, Объект.Организация, Объект.КонтрагентДебитор, Истина);
	Для Каждого Стр Из ТЗ Цикл
		НС = Объект.ТЧДебиторскаяЗадолженность.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Стр);
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоКредиторскойЗадолженностиНаСервере()
	Объект.ТЧКредиторскаяЗадолженность.Очистить();
	ДатаСреза = РаботаСДокументамиВызовСервера.ПолучитьГраницуДокумента(Объект);
	ТЗ = ПолучитьЗадолженность(ДатаСреза, Объект.Организация, Объект.КонтрагентКредитор, Ложь);
	Для Каждого Стр Из ТЗ Цикл
		НС = Объект.ТЧКредиторскаяЗадолженность.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Стр);
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗадолженность(ДатаСреза, Организация, Контрагент, Дебиторская = Истина)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВЗ.ОбъектРасчётов КАК ОбъектРасчётов,
	                      |	ВЗ.Сумма КАК Сумма
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		СПокупателями.ОбъектРасчётов КАК ОбъектРасчётов,
	                      |		СПокупателями.СуммаОстаток КАК Сумма
	                      |	ИЗ
	                      |		РегистрНакопления.ВзаиморасчётыСПокупателями.Остатки(
	                      |				&ДатаСреза,
	                      |				Организация = &Организация
	                      |					И Контрагент = &Контрагент) КАК СПокупателями где Не &Дебиторская
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		СПоставщиками.ОбъектРасчётов,
	                      |		-СПоставщиками.СуммаОстаток
	                      |	ИЗ
	                      |		РегистрНакопления.ВзаиморасчётыСПоставщиками.Остатки(
	                      |				&ДатаСреза,
	                      |				Организация = &Организация
	                      |					И Контрагент = &Контрагент) КАК СПоставщиками где &Дебиторская
						  //|	
						  //|	ОБЪЕДИНИТЬ ВСЕ
						  //|	
						  //|	ВЫБРАТЬ
						  //|		Прочие.Договор,
						  //|		Прочие.СуммаОстаток
						  //|	ИЗ
						  //|		РегистрНакопления.ВзаиморасчётыСКонтрагентамиПрочие.Остатки(
						  //|				&ДатаСреза,
						  //|				Организация = &Организация
						  //|					И Контрагент = &Контрагент) КАК Прочие
	                      |) КАК ВЗ
						  //|ГДЕ
						  //|	ВЫБОР
						  //|			КОГДА &Дебиторская
						  //|				ТОГДА ВЗ.Сумма < 0
						  //|			ИНАЧЕ ВЗ.Сумма > 0
						  //|		КОНЕЦ
						  |");
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Дебиторская", Дебиторская);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции	

#КонецОбласти
