
// Подключение

Функция Подключиться(ДанныеПодключения) Экспорт
	Структура = Новый Структура("COMConnector, База", Неопределено, Неопределено);
	Если ДанныеПодключения.Файловая Тогда
		СтрокаПодключения = "File=""" + ДанныеПодключения.Сервер + """";	
	Иначе
		СтрокаПодключения = "Srvr=""" + ДанныеПодключения.Сервер + """" + 
						";Ref=""" + ДанныеПодключения.БазаДанных + """";	
	КонецЕсли;	
	Если ЗначениеЗаполнено(ДанныеПодключения.Пользователь) Тогда					
		СтрокаПодключения = СтрокаПодключения +	";Usr=""" + ДанныеПодключения.Пользователь + """";
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеПодключения.Пароль) Тогда
		СтрокаПодключения = СтрокаПодключения +	";Pwd=""" + ДанныеПодключения.Пароль + """";
	КонецЕсли;
	СтрокаПодключения = СтрокаПодключения + ";";	
	Попытка
		Структура.COMConnector = Новый COMОбъект("V83.comconnector");
		Структура.База = Структура.COMConnector.Connect(СтрокаПодключения);
	Исключение
		Сообщить(ОписаниеОшибки());
		Структура.COMConnector = Неопределено;
		Структура.База = Неопределено;
	КонецПопытки;
	Возврат Структура;
КонецФункции

Процедура Отключиться(Соединение) Экспорт
	Соединение.COMConnector = Ложь;
	Соединение.База = Ложь;	
КонецПроцедуры



