
Функция ПолучитьПоХозяйственнойОперации(ХозяйственнаяОперация) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СтатьиДДСХозяйственныеОперации.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.СтатьиДвиженияДенежныхСредств.ТЧХозяйственныеОперации КАК СтатьиДДСХозяйственныеОперации
	                      |ГДЕ
	                      |	СтатьиДДСХозяйственныеОперации.ХозяйственнаяОперация = &ХозяйственнаяОперация
	                      |	И НЕ СтатьиДДСХозяйственныеОперации.Ссылка.ПометкаУдаления
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	СтатьиДДСХозяйственныеОперации.Ссылка.Наименование");
	Запрос.УстановитьПараметр("ХозяйственнаяОперация", ХозяйственнаяОперация);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
КонецФункции	