
Функция ПолучитьПоАдресу(Адрес) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	УчётныеЗаписиЭлектроннойПочты.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.УчётныеЗаписиЭлектроннойПочты КАК УчётныеЗаписиЭлектроннойПочты
	                      |ГДЕ
	                      |	УчётныеЗаписиЭлектроннойПочты.АдресЭлектроннойПочты = &Адрес");
	Запрос.УстановитьПараметр("Адрес", Адрес);
	Рез = Запрос.Выполнить();
	Возврат ?(Рез.Пустой(), Справочники.УчётныеЗаписиЭлектроннойПочты.ПустаяСсылка(), Рез.Выгрузить()[0].Ссылка);
КонецФункции

Функция ПолучитьПоФизическомуЛицу(ФизическоеЛицо) Экспорт 
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЕСТЬNULL(УчётныеЗаписиЭлектроннойПочты.Ссылка, Константа.Значение) КАК УчётнаяЗапись
	                      |ИЗ
	                      |	Константа.УчётнаяЗаписьРассылкиСообщенийСистемы КАК Константа
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УчётныеЗаписиЭлектроннойПочты КАК УчётныеЗаписиЭлектроннойПочты
	                      |		ПО (УчётныеЗаписиЭлектроннойПочты.ФизическоеЛицо = &ФизическоеЛицо)");
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	Возврат Запрос.Выполнить().Выгрузить()[0].УчётнаяЗапись;	
КонецФункции
