
#Область Рассчёт_строк_документа

Процедура РассчитатьКоличество(Стр, ПостфиксКоличества = "") Экспорт
	ЕстьКоличествоУпаковок = ЕстьРеквизит(Стр, "КоличествоУпаковок");
	ОсноваРасчёта = ?(ЕстьКоличествоУпаковок, "КоличествоУпаковок", "Количество");		
	РеквизитКоличество = "Количество" + ПостфиксКоличества; 
	РеквизитКоличествоУпаковок = ?(ЕстьКоличествоУпаковок, "КоличествоУпаковок" + ПостфиксКоличества, РеквизитКоличество);	
	Если ОсноваРасчёта = "КоличествоУпаковок" Тогда // Рассчитаем количество по коэффициенту упаковки
		Если ЗначениеЗаполнено(Стр.Упаковка) Тогда
			Коэффициент = ОбщегоНазначенияВызовСервера.РассчитатьКоэффициентЕдиницы(Стр.Упаковка);
			Стр[РеквизитКоличество] = Стр[РеквизитКоличествоУпаковок] * Коэффициент;
		Иначе
			Стр[РеквизитКоличество] = Стр[РеквизитКоличествоУпаковок];
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

Процедура РассчитатьСтроку(Стр, ЦенаВключаетНДС = Истина, ОсноваРасчёта = "", ПостфиксКоличества = "") Экспорт
	ЕстьКоличествоУпаковок = ЕстьРеквизит(Стр, "КоличествоУпаковок");
	Если ПустаяСтрока(ОсноваРасчёта) Тогда
		ОсноваРасчёта = ?(ЕстьКоличествоУпаковок, "КоличествоУпаковок", "Количество");		
	КонецЕсли;	
	РеквизитКоличество = "Количество" + ПостфиксКоличества; 
	РеквизитКоличествоУпаковок = ?(ЕстьКоличествоУпаковок, "КоличествоУпаковок" + ПостфиксКоличества, РеквизитКоличество);	
	РассчитатьКоличество(Стр, ПостфиксКоличества);
	Если Не ЕстьРеквизит(Стр, "Сумма") Тогда Возврат КонецЕсли;	
	// Рассчитываем
	ЕстьЦенаSKU = ЕстьРеквизит(Стр, "ЦенаSKU");
	Если ОсноваРасчёта = "Цена" Тогда
		Если ЕстьЦенаSKU Тогда
			Стр.ЦенаSKU = РассчитатьЦену(Стр.Цена, Стр[РеквизитКоличествоУпаковок], Стр[РеквизитКоличество], Ложь); 
		КонецЕсли;
		Стр.Сумма = Стр.Цена * Стр[РеквизитКоличествоУпаковок];	
	ИначеЕсли ОсноваРасчёта = "Сумма" Тогда
		Стр.Цена = Стр.Сумма / ?(Стр[РеквизитКоличествоУпаковок] = 0, 1, Стр[РеквизитКоличествоУпаковок]);
		Если ЕстьЦенаSKU Тогда
			Стр.ЦенаSKU = РассчитатьЦену(Стр.Цена, Стр[РеквизитКоличествоУпаковок], Стр[РеквизитКоличество], Ложь);
		КонецЕсли;
	ИначеЕсли ОсноваРасчёта = "СуммаНДС" Тогда	
		Если Не ЦенаВключаетНДС Тогда
			Стр.СуммаСНДС = Стр.Сумма + Стр.СуммаНДС;
		КонецЕсли;
		Возврат;
	//ИначеЕсли ОсноваРасчёта = "СуммаСНДС" Тогда	
	//	Стр.СуммаСНДС = Стр.Сумма + Стр.СуммаНДС;
	ИначеЕсли ЕстьРеквизит(Стр, "Цена") Тогда
		Если ЕстьЦенаSKU Тогда
			Стр.Цена = РассчитатьЦену(Стр.ЦенаSKU, Стр[РеквизитКоличествоУпаковок], Стр[РеквизитКоличество], Истина);
		КонецЕсли;
		Стр.Сумма = Стр.Цена * Стр[РеквизитКоличествоУпаковок];		
	КонецЕсли;
	// Скидка
	СуммаОсноваНДС = Стр.Сумма;
	Если ЕстьРеквизит(Стр, "СуммаСкидки") Тогда
		Если ОсноваРасчёта = "Сумма" Тогда
			Стр.ПроцентСкидки = Стр.СуммаСкидки / Стр.Сумма * 100;
			Если ЕстьРеквизит(Стр, "СкидкаНаЦену") Тогда
				Стр.СкидкаНаЦену = Стр.СуммаСкидки / ?(Стр[РеквизитКоличествоУпаковок] = 0, 1, Стр[РеквизитКоличествоУпаковок]);
			КонецЕсли;
		ИначеЕсли ОсноваРасчёта = "Цена" Тогда
			Если ЕстьРеквизит(Стр, "СкидкаНаЦену") Тогда
				Стр.СуммаСкидки = Стр.Сумма - (Стр.Цена-Стр.СкидкаНаЦену)*Стр[РеквизитКоличествоУпаковок];
			КонецЕсли;
			Стр.ПроцентСкидки = Стр.СуммаСкидки / Стр.Сумма * 100;
		Иначе
			Стр.СуммаСкидки = Стр.Сумма / 100 * Стр.ПроцентСкидки;	
			Если ЕстьРеквизит(Стр, "СкидкаНаЦену") Тогда
				Стр.СкидкаНаЦену = Стр.СуммаСкидки / ?(Стр[РеквизитКоличествоУпаковок] = 0, 1, Стр[РеквизитКоличествоУпаковок]); 
			КонецЕсли;
		КонецЕсли;
		СуммаОсноваНДС = СуммаОсноваНДС - Стр.СуммаСкидки;
	КонецЕсли;	
	// Рассчитываем НДС 
	Если ЕстьРеквизит(Стр, "СтавкаНДС") и ЕстьРеквизит(Стр, "СуммаНДС") Тогда
		Стр.СуммаНДС = РассчитатьСуммуНДС(Стр.СтавкаНДС, СуммаОсноваНДС, ЦенаВключаетНДС);
		Если ЕстьРеквизит(Стр, "СуммаСНДС") Тогда
			Стр.СуммаСНДС = СуммаОсноваНДС + ?(ЦенаВключаетНДС, 0, Стр.СуммаНДС);	
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

Функция РассчитатьЦену(Цена, КоличествоУпаковок, Количество, ОтЦеныSKU)
	Коэффициент = ?(КоличествоУпаковок = 0, 1, Количество / КоличествоУпаковок);
	Возврат ?(ОтЦеныSKU, Цена * Коэффициент, Цена / Коэффициент);
КонецФункции	

Функция РассчитатьСуммуНДС(СтавкаНДС, Сумма, СуммаВключаетНДС = Истина) Экспорт
	ПроцентНДС = ОбщегоНазначенияВызовСервераПовтИсп.ПроцентСтавкиНДС(СтавкаНДС);
	СуммаНДС = 0;
	Если ПроцентНДС > 0 Тогда
		СуммаНДС = ?(СуммаВключаетНДС, Сумма / (100 + ПроцентНДС) * ПроцентНДС, Сумма / 100 * ПроцентНДС);	
	КонецЕсли;	
	Возврат Окр(СуммаНДС, 2);
КонецФункции

// Рассчитываем сумму или суммы НДС в строке основания платёжного документа
Функция РассчитатьСуммуНДСПлатёжногоДокумента(СтрОснованиеПлатежа) Экспорт
	Если СтрОснованиеПлатежа.НесколькоСтавокНДС Тогда
		МасРасшифровкаНДС = ОбщегоНазначенияКлиентСервер.КонвертироватьИзJSON(СтрОснованиеПлатежа.РасшифровкаНДС, Ложь);
		СуммаИсходная = 0;
		Для Каждого Стр Из МасРасшифровкаНДС Цикл
			СуммаИсходная = СуммаИсходная + Стр.СуммаСНДС;	
		КонецЦикла;
		Коэффициент = ?(СуммаИсходная = 0, 1, СтрОснованиеПлатежа.Сумма / СуммаИсходная);
		СтрОснованиеПлатежа.СуммаНДС = 0;
		СуммаОстаток = СтрОснованиеПлатежа.Сумма;
		Для А = 1 По МасРасшифровкаНДС.Количество() Цикл
			СтрНДС = МасРасшифровкаНДС[А - 1];
			СтрНДС.СуммаСНДС = ?(А = МасРасшифровкаНДС.Количество(), СуммаОстаток, Окр(СтрНДС.СуммаСНДС * Коэффициент, 2));	
			СтрНДС.СуммаНДС = РассчитатьСуммуНДС(СтрНДС.СтавкаНДС, СтрНДС.СуммаСНДС, Истина);
			СтрОснованиеПлатежа.СуммаНДС = СтрОснованиеПлатежа.СуммаНДС + СтрНДС.СуммаНДС;
			СуммаОстаток = СуммаОстаток - СтрНДС.СуммаСНДС;
		КонецЦикла;
		СтрОснованиеПлатежа.РасшифровкаНДС = ОбщегоНазначенияКлиентСервер.КонвертироватьВJSON(МасРасшифровкаНДС);
	Иначе
		СтрОснованиеПлатежа.СуммаНДС = РассчитатьСуммуНДС(СтрОснованиеПлатежа.СтавкаНДС, СтрОснованиеПлатежа.Сумма, Истина);
	КонецЕсли;	
КонецФункции	

Функция ПолучитьСледующийКодСтроки(ТЧ) Экспорт
	Результат = 0;
	Для Каждого Стр Из ТЧ Цикл
		Результат = Макс(Результат, Стр.КодСтроки); 
	КонецЦикла;
	Возврат Результат + 1;
КонецФункции

#КонецОбласти
	
#Область Проверки

Функция ЕстьРеквизит(Объект, ИмяРеквизита) Экспорт
	Структура = Новый Структура(ИмяРеквизита, Неопределено); 
	ЗаполнитьЗначенияСвойств(Структура, Объект); 
	Возврат Структура[ИмяРеквизита] <> Неопределено;	
КонецФункции

#КонецОбласти

#Область Номенклатура  

Процедура УстановитьПараметрыНоменклатуры(Стр, Объект, БезЦен = Ложь) Экспорт
	ЦенаВключаетНДС = ?(ЕстьРеквизит(Объект, "ЦенаВключаетНДС"), Объект.ЦенаВключаетНДС, Истина);
	СтрСтруктура = ПреобразоватьСтрокуТаблицыВСтруктуру(Стр, Объект);
	ОбщегоНазначенияВызовСервера.ПолучитьДанныеНоменклатуры(СтрСтруктура, БезЦен, ЦенаВключаетНДС);
	ЗаполнитьЗначенияСвойств(Стр, СтрСтруктура);
	РассчитатьСтроку(Стр, ЦенаВключаетНДС);
КонецПроцедуры

Процедура УстановитьПараметрыНоменклатурыКонтрагента(Стр, Объект, ТЗЦены = Неопределено) Экспорт
	СтрСтруктура = ПреобразоватьСтрокуТаблицыВСтруктуру(Стр, Объект);
	ОбщегоНазначенияВызовСервера.ПолучитьДанныеНоменклатурыКонтрагента(СтрСтруктура, ТЗЦены);
	ЗаполнитьЗначенияСвойств(Стр, СтрСтруктура);
	РассчитатьСтроку(Стр, ?(ЕстьРеквизит(Объект, "ЦенаВключаетНДС"), Объект.ЦенаВключаетНДС, Истина));
КонецПроцедуры

Процедура УстановитьЦенуНоменклатуры(Стр, Объект) Экспорт
	СтрСтруктура = ПреобразоватьСтрокуТаблицыВСтруктуру(Стр, Объект);
	ОбщегоНазначенияВызовСервера.ПолучитьЦенуНоменклатуры(СтрСтруктура);
	ЗаполнитьЗначенияСвойств(Стр, СтрСтруктура);
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Стр, ?(ЕстьРеквизит(Объект, "ЦенаВключаетНДС"), Объект.ЦенаВключаетНДС, Истина));	
КонецПроцедуры

Процедура ДобавитьНоменклатуруПоШтрихкоду(Штрихкод, Объект, СтруктураТОвара = Неопределено, ИмяТЧ = "ТЧТовары", ВидЦены = Неопределено, Форма = Неопределено, ТекстОшибки = "") Экспорт
	Если Не ЗначениеЗаполнено(Штрихкод) Тогда Возврат КонецЕсли;
	Если СтруктураТОвара = Неопределено Тогда 
		СтруктураТОвара = ОбщегоНазначенияВызовСервера.ПолучитьНоменклатуруПоШтрихкоду(Штрихкод);
	КонецЕсли;
	Если СтруктураТОвара = Неопределено Тогда
		ТекстОшибки = Нстр("fr = 'Erreur ('; ru = 'Ошибка ('; en = 'Error ('; es = 'Error ('") + Штрихкод + Нстр("fr = ""); contacter l'administrateur!""; ru = '); обратитесь к администратору!'; en = '); contact the administrator!'; es = '); ¡póngase en contacto con el administrador!'");
		Возврат; 
	КонецЕсли; 
	Мас = Объект[ИмяТЧ].НайтиСтроки(СтруктураТОвара);
	Если Мас.Количество() = 0 Тогда 
		НС = Объект[ИмяТЧ].Добавить();
		ЗаполнитьЗначенияСвойств(НС,СтруктураТОвара);
		Если Не ВидЦены = Неопределено и ЕстьРеквизит(НС, "ВидЦены") Тогда
			НС.ВидЦены = ВидЦены;
		КонецЕсли;
		СтрСтруктура = ПреобразоватьСтрокуТаблицыВСтруктуру(НС, Объект);
		ОбщегоНазначенияВызовСервера.ПолучитьДанныеНоменклатуры(СтрСтруктура);
		ЗаполнитьЗначенияСвойств(НС,СтрСтруктура);
		Если ЕстьРеквизит(НС, "КоличествоУпаковок") Тогда 
			НС.КоличествоУпаковок = 1;
		ИначеЕсли ЕстьРеквизит(НС, "Количество") Тогда 
			НС.Количество = 1;
		КонецЕсли;
	Иначе
		НС = Мас.Получить(0);
		Если ЕстьРеквизит(НС, "КоличествоУпаковок") Тогда 
			НС.КоличествоУпаковок = НС.КоличествоУпаковок + 1;
		ИначеЕсли ЕстьРеквизит(НС, "Количество") Тогда 
			НС.Количество = НС.Количество + 1;
		КонецЕсли;
	КонецЕсли;
	РассчитатьСтроку(НС, ?(ЕстьРеквизит(Объект, "ЦенаВключаетНДС"), Объект.ЦенаВключаетНДС, Истина));
	Если Не Форма = Неопределено Тогда 
		Форма.Элементы[ИмяТЧ].ТекущаяСтрока = НС.ПолучитьИдентификатор();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область Денежные_документы

Процедура ДобавитьОснованиеВДенежныйДокумент(ДокОбъект, Основание) Экспорт
	НС = ДокОбъект.ТЧОснования.Добавить();
	НС.Основание = Основание;
	ДанныеСуммы = РаботаСДокументамиВызовСервера.ПолучитьСуммуОснованияДляПлатёжногоДокумента(Основание);
	ЗаполнитьЗначенияСвойств(НС, ДанныеСуммы);	
КонецПроцедуры

#КонецОбласти

#Область Разное

Процедура УстановитьТипЗначенияПоля(Элемент, Реквизит, ОписаниеТипов) Экспорт
	Если ОписаниеТипов.СодержитТип(ТипЗнч(Реквизит)) Тогда Возврат КонецЕсли;
	Элемент.ОграничениеТипа = ОписаниеТипов;
	Реквизит = ОписаниеТипов.ПривестиЗначение();
КонецПроцедуры

Функция ПреобразоватьСтрокуТаблицыВСтруктуру(Стр, Объект) Экспорт
	Результат = Новый Структура;
	Результат.Вставить("Номенклатура", Стр.Номенклатура);
	Результат.Вставить("Характеристика", Стр.Характеристика);
	Результат.Вставить("Упаковка", Стр.Упаковка);
	Если ЕстьРеквизит(Стр, "КоличествоУпаковок") Тогда
		Результат.Вставить("КоличествоУпаковок", Стр.КоличествоУпаковок);
		Результат.Вставить("Количество", Стр.Количество);
	КонецЕсли;
	Если ЕстьРеквизит(Стр, "НоменклатураКонтрагента") Тогда
		Результат.Вставить("НоменклатураКонтрагента", Стр.НоменклатураКонтрагента);
		Если ЕстьРеквизит(Объект, "Контрагент") Тогда
			Результат.Вставить("Поставщик", Объект.Контрагент);
		КонецЕсли;
	ИначеЕсли ЕстьРеквизит(Объект, "Ссылка") Тогда 
		Если  ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ОприходованиеТоваров") Тогда 
			Результат.Вставить("Поставщик", Неопределено);
		КонецЕсли;
	КонецЕсли;
	Если ЕстьРеквизит(Стр, "СтавкаНДС") Тогда
		Результат.Вставить("СтавкаНДС", Стр.СтавкаНДС);	
	КонецЕсли;
	Если ЕстьРеквизит(Стр, "СуммаНДС") Тогда
		Результат.Вставить("СуммаНДС", Стр.СуммаНДС);	
	КонецЕсли;
	Если ЕстьРеквизит(Стр, "ВидЦены") Тогда
		Результат.Вставить("ВидЦены", Стр.ВидЦены);	
	КонецЕсли;
	Если ЕстьРеквизит(Стр, "Цена") Тогда
		Результат.Вставить("Цена", Стр.Цена);
		Результат.Вставить("ДатаЦены", ?(ЕстьРеквизит(Объект, "Дата"), КонецДня(Объект.Дата), ТекущаяДата()));
		Если ЕстьРеквизит(Стр, "ЦенаSKU") Тогда
			Результат.Вставить("ЦенаSKU", Стр.ЦенаSKU);
		КонецЕсли;
	КонецЕсли;
	Если ЕстьРеквизит(Стр, "ЦенаМинимальная") Тогда
		Результат.Вставить("ЦенаМинимальная", Стр.ЦенаМинимальная);	
	КонецЕсли;
	Если ЕстьРеквизит(Стр, "ЦенаРозничная") Тогда
		Результат.Вставить("ЦенаРозничная", Стр.ЦенаРозничная);	
	КонецЕсли;
	Если ЕстьРеквизит(Стр, "Сумма") Тогда
		Результат.Вставить("Сумма", Стр.Сумма);	
	КонецЕсли;
	Если ЕстьРеквизит(Стр, "СуммаСНДС") Тогда
		Результат.Вставить("СуммаСНДС", Стр.СуммаСНДС);	
	КонецЕсли;
	Если ЕстьРеквизит(Стр, "Организация") Тогда
		Результат.Вставить("Организация", Стр.Организация);	
	КонецЕсли;
	Если ЕстьРеквизит(Объект, "ТипЦеныПоТипуЦен") и ЕстьРеквизит(Стр, "ЦенаПоТипуЦен") Тогда
		Результат.Вставить("ТипЦеныПоТипуЦен", Объект.ТипЦеныПоТипуЦен);	
		Результат.Вставить("ЦенаПоТипуЦен", Стр.ЦенаПоТипуЦен);	
	КонецЕсли;
	Возврат Результат;
КонецФункции

Процедура ЗаполнитьСписокВыбораВидовЦен(ОсновнойВидЦены, ЭлементФормы) Экспорт
	ВидЦеныРозничная = ПредопределенноеЗначение("Справочник.ВидыЦен.Розничная");
	ЭлементФормы.СписокВыбора.Очистить();
	Если ЗначениеЗаполнено(ОсновнойВидЦены) Тогда
		ЭлементФормы.СписокВыбора.Добавить(ОсновнойВидЦены);
	КонецЕсли;
	Если ОсновнойВидЦены <> ВидЦеныРозничная Тогда
		ЭлементФормы.СписокВыбора.Добавить(ВидЦеныРозничная);	
	КонецЕсли;
	ЭлементФормы.СписокВыбора.Добавить(Неопределено, Нстр("fr = '<Arbitraire>'; ru = '<Произвольная>'; en = '\u003cArbitrary\u003e'; es = '\u003cArbitraria\u003e'"));	
КонецПроцедуры

Процедура УстановитьПараметрыФункциональныхОпций(Форма) Экспорт
	Структура = Новый Структура("Организация, МестоХранения", Неопределено, Неопределено);
	СтруктураОбъект = Новый Структура("Объект", Неопределено);
	ЗаполнитьЗначенияСвойств(СтруктураОбъект, Форма);
	Если СтруктураОбъект.Объект = Неопределено Тогда // По реквизитам формы
		ЗаполнитьЗначенияСвойств(Структура, Форма);		
	Иначе // По реквизитам объекта
		ЗаполнитьЗначенияСвойств(Структура, Форма.Объект);
	КонецЕсли;
	// Удалим неопределённые
	Если Структура.Количество() > 0 Тогда
		Форма.УстановитьПараметрыФункциональныхОпцийФормы(Структура);	
	КонецЕсли;	
КонецПроцедуры

Процедура УдалитьСвязанныеСтроки(Объект, ИмяТаблицы, Идентификатор) Экспорт
	Если ТипЗнч(Идентификатор) = Тип("Число") Тогда
		Отбор = Новый Структура("КодСтроки", Идентификатор);
	ИначеЕсли ТипЗнч(Идентификатор) = Тип("УникальныйИдентификатор") Тогда
		Отбор = Новый Структура("ID", Идентификатор);
	КонецЕсли;
	МасУдаление = Объект[ИмяТаблицы].НайтиСтроки(Отбор);
	Для А = 1 - МасУдаление.Количество() По 0 Цикл
		Объект[ИмяТаблицы].Удалить(МасУдаление[-А]);	
	КонецЦикла;	
КонецПроцедуры	

#КонецОбласти

#Область Даты

Функция ДобавитьДень(ДатаИсходная, КоличествоДней) Экспорт
	Возврат ДатаИсходная + КоличествоДней * (60 * 60 * 24);	
КонецФункции	

#КонецОбласти

