 
#Область Обработчики_событий_формы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Контрагент", Объект.Ссылка));
	ЗначениеВРеквизитФормы(РегистрыСведений.РеквизитыКонтрагентов.ПолучитьДеревоРеквизитовКонтрагента(Объект.Ссылка), "ДЗРеквизиты");	
	УстановитьДоступностьЛичныйКабинет(); 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщегоНазначенияКлиент.РазвернутьДеревоЗначений(ДЗРеквизиты, Элементы.ДЗРеквизиты);
	УстановитьДоступностьЭлементов();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	РеквизитыКонтрагентов.ПередЗаписьюНаСервере(ТекущийОбъект, РеквизитФормыВЗначение("ДЗРеквизиты"), Отказ);   
	Если СокрЛП(ЭтотОбъект.Имя) <> "" Тогда 
		ТекущийОбъект.Логин = ЭтотОбъект.Имя;
		ТекущийОбъект.Пароль = ЭтотОбъект.Пароль; 
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	РеквизитыКонтрагентов.ПриЗаписиНаСервере(ТекущийОбъект, РеквизитФормыВЗначение("ДЗРеквизиты"));
	ОбновитьПользователя();
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура ЗаполнитьПоИНН(Команда)
	РаботаСДокументамиКлиент.ЗаписатьЕслиНовый(ЭтаФорма);
	РеквизитыКонтрагентовКлиент.ОбработатьРезультатЗаполненияРеквизитовПоИНН(ЭтаФорма, ЗаполнитьПоИНННаСервере()); 
КонецПроцедуры

&НаКлиенте
Процедура ПокупательПриИзменении(Элемент)
	УстановитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ВидКонтрагентаПриИзменении(Элемент)
	УстановитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура КонтрольКредитаПриИзменении(Элемент)
	УстановитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРеквизит(Команда)
	РеквизитыКонтрагентовКлиент.СформироватьМенюВыбораВидаРеквизита(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура КомментарийРеквизита(Команда)
	РеквизитыКонтрагентовКлиент.ОткрытьФормуВводаДополнительныхДанных(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьВФактическийАдрес(Команда)
	РеквизитыКонтрагентовКлиент.Скопировать(ЭтаФорма, ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.АдресФактический"));
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьВАдресДоставки(Команда)
	РеквизитыКонтрагентовКлиент.Скопировать(ЭтаФорма, ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.АдресДоставки"));
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьВАдресПроживания(Команда)
	РеквизитыКонтрагентовКлиент.Скопировать(ЭтаФорма, ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.АдресПроживания"));
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьВАдресПоПрописке(Команда)
	РеквизитыКонтрагентовКлиент.Скопировать(ЭтаФорма, ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.АдресПоПрописке"));
КонецПроцедуры

&НаКлиенте
Процедура ДЗРеквизитыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	РеквизитыКонтрагентовКлиент.ВыборТаблицаФормы(ЭтаФорма, ВыбраннаяСтрока, СтандартнаяОбработка);	
КонецПроцедуры

&НаКлиенте
Процедура ДЗРеквизитыПриАктивизацииСтроки(Элемент)
	РеквизитыКонтрагентовКлиент.ПриАктивацииСтроки(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ДЗРеквизитыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	РеквизитыКонтрагентовКлиент.ОбработкаВыбораТаблицаФормы(ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка); 
КонецПроцедуры

&НаКлиенте
Процедура ДЗРеквизитыПередНачаломИзменения(Элемент, Отказ)
	РеквизитыКонтрагентовКлиент.ПередНачаломИзменения(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаДоставка Тогда 
		ЗаполнитьСтраницуДоставка();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДЗРеквизитыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	//Если Не ОтменаРедактирования Тогда
	//	Если Не Элемент.ТекущиеДанные = Неопределено Тогда
	//		Если Элемент.ТекущиеДанные.Реквизит = ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.ICE") Тогда 
	//			Объект.ICE = СокрЛП(Элемент.ТекущиеДанные.Представление);
	//		КонецЕсли;
	//		Если Элемент.ТекущиеДанные.Реквизит = ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.CIN") Тогда 
	//			Объект.CIN = СокрЛП(Элемент.ТекущиеДанные.Представление);
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЛичныйКабинетПриИзменении(Элемент)
	УстановитьДоступностьЛичныйКабинет();    
	Если Объект.ЛичныйКабинетПартнера Тогда
		Имя = СтрЗаменить(Объект.Наименование, " ", "");   
		Пароль = НовыйПароль();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область Дополнительно

&НаСервере
Функция ЗаполнитьПоИНННаСервере()
	Возврат РеквизитыКонтрагентов.ЗаполнитьРеквизитыПоИННВФорме(ЭтаФорма);
КонецФункции

&НаКлиенте
Процедура УстановитьДоступностьЭлементов()
	Элементы.СтраницаДоставка.Видимость = Объект.Покупатель;
	Элементы.СтраницаЛичныйКабинет.Видимость = Объект.Покупатель;
	Элементы.СтраницаКредит.Видимость = Объект.Покупатель;
	Элементы.СуммаКредита.Доступность = Объект.КонтрольКредита;
	Элементы.СрокОплаты.Доступность = Объект.КонтрольКредита;
	Элементы.СпособРасчётаОтсрочки.Доступность = Объект.КонтрольКредита;
КонецПроцедуры

Процедура ЗаполнитьСтраницуДоставка()
	Если Не Объект.ТЧГрафикДоставок.Количество() = 0 тогда Возврат; КонецЕсли;
	Для ДеньНедели = 1 по 7 Цикл 
		Стр = Объект.ТЧГрафикДоставок.Добавить();
		Стр.ДеньНедели = Перечисления.ДниНедели.Получить(ДеньНедели-1);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ОбновитьРеквизитыОбъектаНаСервере();
	Если РеквизитыКонтрагентовВызовСервера.СуществуетКонтрагентСУказаннымICE(Объект.ICE,Объект.Ссылка) Тогда
		ТекстСообщения = НСтр("fr = 'Contrepartie avec ce ICE existe déjà !'; ru = 'Контрагент с таким идентификационным номеров уже существует!'; en = 'A counterparty with such identification numbers already exists!'; es = 'La contraparte con estos números de identificación ya existe!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Отказ = Истина;
		возврат;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьРеквизитыОбъектаНаСервере()
	ДеревоРеквизитов = РеквизитФормыВЗначение("ДЗРеквизиты");
	Мас = ДеревоРеквизитов.Строки.НайтиСтроки(Новый Структура("Реквизит",ПланыВидовХарактеристик.ВидыРеквизитовКонтрагентов.ICE),Истина);
	Если Мас.Количество() = 0 Тогда 
		Объект.ICE = "";
	Иначе
		Объект.ICE = СокрЛП(Мас.Получить(0).Представление);
	КонецЕсли;
	Мас = ДеревоРеквизитов.Строки.НайтиСтроки(Новый Структура("Реквизит",ПланыВидовХарактеристик.ВидыРеквизитовКонтрагентов.CIN),Истина);
	Если Мас.Количество() = 0 Тогда 
		Объект.CIN = "";
	Иначе
		Объект.CIN = СокрЛП(Мас.Получить(0).Представление);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЛичныйКабинет()
	Элементы.Имя.Доступность = Объект.ЛичныйКабинетПартнера;
	Элементы.Пароль.Доступность = Объект.Покупатель;
	Элементы.Организация.Доступность = Объект.Покупатель;
КонецПроцедуры	

&НаСервере
Процедура ОбновитьПользователя()
	Если ЗначениеЗаполнено(Объект.Пользователь) Тогда
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Объект.Пользователь.ИдентификаторПользователяИБ);
		ПользовательИБ.Имя = Имя;
		ПользовательИБ.Пароль = Пароль;
		ПользовательИБ.Записать();
		ТекПользователь = Объект.Пользователь.ПолучитьОбъект();
		ТекПользователь.Организация = Организация;
		ТекПользователь.Записать();
	Иначе
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПароль(Команда)
	
	Пароль = НовыйПароль();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НовыйПароль()
	
	ГСП = Новый ГенераторСлучайныхПаролей;	
	НовыйПароль = ГСП.СлучайныйПароль(8);
	
	Возврат НовыйПароль;
	
КонецФункции

&НаКлиенте
Процедура СоздатьЛогин(Команда)
	Имя = СтрЗаменить(Объект.Наименование, " ", "");  
КонецПроцедуры

#КонецОбласти
