#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Элементы.ПоказыватьВыведенные.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьУчетСтанков");
	Справочники.ПроизводственноеОборудование.УстановитьОтборВыведенных(Список, ПоказыватьВыведенные);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоказыватьВыведенныеПриИзменении(Элемент)

	УстановитьОтборВыведенныхНаСервере();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОтборВыведенныхНаСервере()

	Справочники.ПроизводственноеОборудование.УстановитьОтборВыведенных(Список, ПоказыватьВыведенные);

КонецПроцедуры

#КонецОбласти
